{"session_id": "accelerating-growth-capital-markets-data-driven-strategies-success", "title": "Accelerating Growth in Capital Markets: Data-Driven Strategies for Success", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "FINANCIAL SERVICES", "technologies": ["AI/BI", "DATA MARKETPLACE", "DELTA SHARING"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Real-time"], "speakers": ["Software Engineering Manager, B3 - Bolsa, Brasil e Balcão"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Growth in capital markets thrives on innovation, agility and real-time insights. This session highlights how leading firms use Databricks’ Data Intelligence Platform to uncover opportunities, optimize trading strategies and deliver personalized client experiences. Learn how advanced analytics and AI help organizations expand their reach, improve decision-making and unlock new revenue streams. Industry leaders share how unified data platforms break down silos, deepen insights and drive success in a fast-changing market. Key takeaways: Discover how data intelligence empowers capital markets firms to thrive in today’s competitive landscape! /Financial Services Industry Director\nDatabricks /CDO - Wealth Management\nNorthern Trust /Software Engineering Manager"}
{"session_id": "accelerating-innovation-across-life-sciences-value-chain-data-ai", "title": "Accelerating Innovation Across the Life Sciences Value Chain With a Data + AI Foundation", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES", "technologies": ["DELTA LAKE", "MOSAIC AI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Governance", "Data Quality"], "speakers": ["Industry Marketing Lead, HLS, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Artificial intelligence and robust data strategies are revolutionizing life sciences, delivering measurable value across drug discovery, commercial operations, supply chain, manufacturing and commercialization. Foundational data governance ensures data quality, compliance and interoperability, enabling organizations to extract actionable insights from vast, complex datasets. AI accelerates drug discovery by identifying novel targets and optimizing compounds, while data intelligence and sharing streamline clinical trials, regulatory submissions and market positioning. In manufacturing and supply chain, advanced analytics and AI-driven tools optimize workflows, forecast disruptions and enhance operational efficiency. Together, these capabilities empower life sciences organizations to innovate faster, reduce costs and bring therapies to market more efficiently, driving growth and improving patient outcomes. /Industry Marketing Lead, HLS"}
{"session_id": "ai-motion-build-roadmap-impact-just-30-minutes", "title": "AI in Motion: Build a Roadmap for Impact in Just 30 Minutes", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY, PROFESSIONAL SERVICES", "technologies": ["AI/BI", "MOSAIC AI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON, VIRTUAL", "areas_of_interest": ["AI"], "speakers": ["Lead Data & AI Strategist, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "This high-velocity workshop is designed for data and AI leaders seeking to rapidly develop a comprehensive AI strategy tailored to their organization's needs. In just 30 minutes, participants will engage in a focused, interactive session that delivers actionable insights and a strategic framework for AI implementation. Key components of the workshop include: By the end of this intensive session, you will have the foundation of a robust AI strategy and guidance on roadmap execution. /Lead Data & AI Strategist"}
{"session_id": "beyond-chatbots-building-autonomous-insurance-applications-agentic-ai", "title": "Beyond Chatbots: Building Autonomous Insurance Applications With Agentic AI Framework", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "FINANCIAL SERVICES", "technologies": ["MLFLOW", "MOSAIC AI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Data Governance"], "speakers": ["VP, Software Engineering, Travelers"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "The insurance industry is at the crossroads of digital transformation, facing challenges from market competition and customer expectations. While conventional ML applications have historically provided capabilities in this domain, the emergence of Agentic AI frameworks presents a revolutionary opportunity to build truly autonomous insurance applications. We will address issues related to data governance and quality while discussing how to monitor/evaluate fine-tune models. We'll demonstrate the application of the agentic framework in the insurance context and how these autonomous agents can work collaboratively to handle complex insurance workflows — from submission intake and risk evaluation to expedited quote generation. This session demonstrates how to architect intelligent insurance solutions using Databricks Mosaic AI agentic core components including Unity Catalog, Playground, model evaluation/guardrails, privacy filters, AI functions and AI/BI Genie. /Sr. Delivery Solutions Architect\nDatabricks /VP, Software Engineering"}
{"session_id": "build-your-data-and-ai-culture", "title": "Build Your Data and AI Culture", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "EDUCATION, ENTERPRISE TECHNOLOGY, FINANCIAL SERVICES", "technologies": ["AI/BI"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["Director, Learning & Enablement APJ, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Many studies have indicated that having a strong Data & AI culture helps our businesses be more successful. This can lead to better business performance, becoming more profitable and being more competitive compared to your peer companies as well as attaining and retaining top talent. What does it mean to have a Data & AI culture? It’s the ability for an organization to make data-driven decisions. It means using insights to improve your business results and using data ultimately allows you to enable AI. It tends to be the people that get in the way of having and sustaining an effective Data & AI culture. Do you have people already in your teams that can help you build your Data & AI culture? Can you attract and retain that talent to your organization? Can you help integrate that great talent into your organization to promote a Data & AI culture? It’s also ensuring that you fundamentally change the way you/your teams/organizations work. /Sr.Director Customer Enablement\nDatabricks /Director, Learning & Enablement APJ"}
{"session_id": "building-your-talent-pipeline-databricks-university-alliance", "title": "Building Your Talent Pipeline With the Databricks University Alliance", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "LIGHTNING TALK", "industry": "EDUCATION", "technologies": ["APACHE SPARK"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["Program Manager, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "The Databricks University Alliance represents more than 1,000 universities across the globe. Join us to see how you can leverage this network of faculty and students to broaden your talent pipeline to students learning with the latest tools in data and AI from Databricks. /Program Manager"}
{"session_id": "data-drives-dairy-royal-frieslandcampinas-data-centric-transformation", "title": "Data Drives Dairy: Royal FrieslandCampina's Data-Centric Transformation With Databricks", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "RETAIL AND CPG - FOOD", "technologies": ["AI/BI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["Analytics"], "speakers": ["Chief Data & Analytics Officer, Royal FrieslandCampina (RFC)"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "/Chief Data & Analytics Officer"}
{"session_id": "databricks-ai-factory-transforming-seven-west-media", "title": "Databricks AI Factory Transforming Seven West Media", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "MEDIA AND ENTERTAINMENT", "technologies": ["DELTA LAKE", "MLFLOW", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Machine Learning", "Scala"], "speakers": ["Director, Data & Growth, Seven West Media"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "The implementation of the Databricks AI Factory enabled Seven West Media to transform its business by accelerating the launch of AI-driven use cases, fostering innovation and reducing time to market. By leveraging a unified data and AI platform, the company achieved better ROI through optimized workflows, improved operational efficiency and scalable machine learning models. The AI Factory empowered data teams to experiment faster, unlocking deeper audience insights that enhanced engagement and content personalization. This transformation positioned Seven West Media as a leader in AI-driven media, driving measurable business impact and future-proofing its data strategy. /Director, Data & Growth"}
{"session_id": "databricks-apps-turning-data-and-ai-practical-user-friendly", "title": "Databricks Apps: Turning Data and AI Into Practical, User-Friendly Applications", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY, PROFESSIONAL SERVICES", "technologies": ["DATABRICKS APPS"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["Director of Product, Apps, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "In this session, we present an overview of the GA release of Databricks Apps, the new app hosting platform that integrates all the Databricks services necessary to build production-ready data and AI applications. With Apps, data and developer teams can build new interfaces into the data intelligence platform, further democratizing the transformative power of data and AI across the organization. We'll cover common use cases, including RAG chat apps, interactive visualizations and custom workflow builders, as well as look at several best practices and design patterns when building apps. Finally, we'll look ahead with the vision, strategy and roadmap for the year ahead. /Director of Product, Apps"}
{"session_id": "databricks-databricks-powering-marketing-insights-lakehouse", "title": "Databricks on Databricks: Powering Marketing Insights with Lakehouse", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "LAKEFLOW", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Scala"], "speakers": ["Sr Director Marketing Analytics, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "This presentation outlines the evolution of our marketing data strategy, focusing on how we’ve built a strong foundation using the Databricks Lakehouse. We will explore key advancements across data ingestion, strategy, and insights, highlighting the transition from legacy systems to a more scalable and intelligent infrastructure. Through real-world applications, we will showcase how unified Customer 360 insights drive personalization, predictive analytics enhance campaign effectiveness, and GenAI optimizes content creation and marketing execution. Looking ahead, we will demonstrate the next phase of our CDP, the shift toward an end-user-first analytics model powered by AIBI, Genie and Matik, and the growing importance of clean rooms for secure data collaboration. This is just the beginning, and we are poised to unlock even greater capabilities in the future. /Sr. Dir, Marketing Tech + Growth\nDatabricks /Sr Director Marketing Analytics"}
{"session_id": "democratizing-data-regulated-industry-best-practices-and-outcomes-jp", "title": "Democratizing Data in a Regulated Industry: Best Practices and Outcomes With J.P. Morgan Payments", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "FINANCIAL SERVICES", "technologies": ["DATABRICKS SQL", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["Chief Data Officer - JP Morgan Payments, J.P.Morgan"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Join our 2024 Databricks Disruptor award winners for a session on how they leveraged the Databricks and AWS platforms to build an internal technology marketplace in the highly regulated banking industry empowering end-users to innovate and own their data sets while maintaining strict compliance. In this talk, leaders from the J.P. Morgan Payments Data team share how they’ve done it — from keeping customer needs at the center of all decision-making to promoting a culture of experimentation. They’ll also expand upon how J.P. Morgan Payments products team now leverages the data platform they’ve built to create customer products including Cash Flow Intelligence. /Chief Data Officer - JP Morgan Payments"}
{"session_id": "developing-dreamers-data-ais-future-how-8451-builds-upskilling", "title": "Developing the Dreamers of Data + AI’s Future: How 84.51˚ builds upskilling to accelerate adoption", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "RETAIL AND CPG - FOOD", "technologies": ["AI/BI", "APACHE SPARK", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Data Science", "Machine Learning"], "speakers": ["Data Science L&D Director, 84.51°"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "“Once an idea has taken hold of the brain it's almost impossible to eradicate. An idea that is fully formed — fully understood — that sticks, right in there somewhere.” The Data Scientists and Engineers at 84.51˚ utilize the Databricks Lakehouse for a wide array of tasks, including data exploration, analysis, machine learning operations, orchestration, automated deployments and collaboration. In this talk, 84.51˚’s Data Science Learning Lead, Michael Carrico, will share their approach to upskilling a diverse workforce to support the company’s strategic initiatives. This approach includes creating tailored learning experiences for a variety of personas using content curated in partnership with Databricks’ educational offerings. Then he will demonstrate how he puts his 11 years of data science and engineering experience to work by using the Databricks Lakehouse not just as a subject, but also as a tool to create impactful training experiences and a learning culture at 84.51˚. /Data Science L&D Director"}
{"session_id": "driving-databricks-platform-revenue-intelligence-roi", "title": "Driving Databricks Platform With Revenue Intelligence ROI", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "LAKEFLOW", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": [], "speakers": ["Senior Director, Data Management, Veeam"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Demonstrating a real ROI is key to driving executive and stakeholder buy-in for major technology changes. At Veeam, we aligned our Databricks Platform change with projects to increase sales pipeline and improve customer retention. By delivering targeted improvements on those critical business metrics, we created positive ROI in short order while at the same time setting the foundation for long term Databricks Platform success. This session targets data and business leaders looking to understand how they can turn their infrastructure change into a business revenue driver. /Senior Director, Data Management"}
{"session_id": "dusting-cobwebs-moving-26-year-old-heritage-platform-databricks", "title": "Dusting off the Cobwebs — Moving off a 26-year-old Heritage Platform to Databricks [Teradata]", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "FINANCIAL SERVICES", "technologies": ["DATABRICKS SQL", "DLT", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["Data Platforms Executive, NAB"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Join us to hear about how National Australia Bank (NAB) successfully completed a significant milestone in its data strategy by decommissioning its 26-year-old Teradata environment and migrating to a new strategic data platform called 'Ada'. This transition marks a pivotal shift from legacy systems to a modern, cloud-based data and AI platform powered by Databricks. The migration process, which spanned two years, involved ingesting 16 data sources, transferring 456 use cases, and collaborating with hundreds of users across 12 business units. This strategic move positions NAB to leverage the full potential of cloud-native data analytics, enabling more agile and data-driven decision-making across the organization. The successful migration to Ada represents a significant step forward in NAB's ongoing efforts to modernize its data infrastructure and capitalize on emerging technologies in the rapidly evolving financial services landscape /Data Platforms Executive"}
{"session_id": "evolving-data-insights-privacy-mastercard", "title": "Evolving Data Insights With Privacy at Mastercard", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES, PUBLIC SECTOR, FINANCIAL SERVICES", "technologies": ["DATABRICKS APPS", "DELTA SHARING", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["VP Data Strategy, Mastercard"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Mastercard is a global technology company whose role is anchored in trust. It supports 3.4 billion cards and over 143 billion transactions annually. To address customers’ increasing data volume and complex privacy needs, Mastercard has developed a novel service atop Databricks’ Clean Rooms and broader Data Intelligence Platform. This service combines several Databricks components with Mastercard’s IP, providing an evolved method for data-driven insights and value-added services while ensuring a unique standalone turnkey service. The result is a secure environment where multiple parties can collaborate on sensitive data without directly accessing each other’s information. After this session, attendees will understand how Mastercard used its expertise in privacy-enhancing technologies to create collaboration tools powered by Databricks’ Clean Rooms, AI/BI, Apps, Unity Catalog, Workflows and DatabricksIQ — as well as how to take advantage of this new privacy-enhancing service directly. /Lead Solutions Architect\nDatabricks /VP Data Strategy"}
{"session_id": "financial-services-industry-forum-shifting-financial-intelligence", "title": "Financial Services Industry Forum: Shifting to Financial Intelligence", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "FINANCIAL SERVICES", "technologies": ["AI/BI", "DATA MARKETPLACE", "MOSAIC AI"], "duration": "60 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Data Engineering"], "speakers": ["SVP, Field Engineering & Co-Founder, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Join the 60-minute kickoff session at the Financial Services Forum to explore how data and AI transform finance. Featuring keynotes from top innovators in banking, capital markets, and insurance and exciting announcements from Databricks, this event offers invaluable insights. What to expect: Connect with C-suite executives and industry pioneers shaping financial services. Leave with actionable strategies to drive growth, ensure compliance and transform your organization through intelligence-driven decisions! /Financial Services, Cyber, Public Sector\nDatabricks /Partner, Chief Data Officer, Head of Data Engineering\nGoldman Sachs /SVP, Field Engineering & Co-Founder"}
{"session_id": "healthcare-and-life-sciences-industry-forum", "title": "Healthcare and Life Sciences Industry Forum", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES", "technologies": ["AI/BI", "MOSAIC AI", "UNITY CATALOG"], "duration": "60 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["Vice President, Data & Analytics, Cencora"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Join us for an engaging 60-minute Healthcare and Life Sciences Industry Forum at the year’s premier Databricks event! You’ll hear directly from Databricks experts and industry leaders about how unifying data, governing AI models and empowering teams with data intelligence can drive meaningful change across the healthcare and life sciences continuum. Discover how data and AI are transforming the industry — helping streamline healthcare operations, personalize patient care and accelerate breakthroughs in research and development. Don’t miss this opportunity to learn about the future of data-driven healthcare. /AVP, Healthcare & Life Sciences GTM\nDatabricks /Vice President, Data & Analytics"}
{"session_id": "healthcare-providers-leverage-data-ai-streamline-operations-and-impact", "title": "Healthcare Providers Leverage Data + AI to Streamline Operations and Impact Experience", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES", "technologies": ["DELTA LAKE", "MOSAIC AI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["Industry Marketing Lead, HLS, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Healthcare is undergoing rapid transformation as leading providers and innovators harness the power of data and AI to deliver a comprehensive Patient 360, elevate staff and clinician experience, streamline operations and advance precision health. This session convenes thought leaders at the forefront of healthcare innovation, showcasing how AI-driven insights and robust data strategies are enabling holistic patient views, automating administrative workflows and supporting personalized care pathways. Attendees will explore real-world examples of AI optimizing clinical decisions, improving operational efficiency, and enhancing both patient and staff satisfaction, while addressing challenges in data interoperability, privacy and responsible technology adoption. /Industry Marketing Lead, HLS"}
{"session_id": "how-ad-tech-runs-databricks", "title": "How Ad Tech Runs on Databricks", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "MEDIA AND ENTERTAINMENT", "technologies": ["AI/BI", "MOSAIC AI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": [], "speakers": ["Sr. Data Scientist, The Trade Desk"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "/Global Head, Media & Advertising GTM\nDatabricks /VP, Engineering\nIntegral Ad Science /Sr. Data Scientist"}
{"session_id": "how-adobe-extracts-value-data-agentic-ai-powered-data-and-analytics", "title": "How Adobe Extracts Value From Data With Agentic AI-Powered Data and Analytics Engineering Workbench", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "MEDIA AND ENTERTAINMENT", "technologies": ["DATABRICKS SQL", "MLFLOW", "MOSAIC AI"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["Global Head, Media & Advertising GTM, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Discover how an AI-first, agentic solution is redefining the Data Development and Delivery Lifecycle (DDLC). This next-generation engineering workbench equips data engineers, analysts and practitioners with intelligent automation, context-aware guidance and collaborative capabilities to accelerate and streamline every stage of the data lifecycle — from business use case definition to actionable insights. By embedding agentic AI across the workflow, the platform significantly enhances development speed, quality and delivery efficiency, enabling organizations to realize data and analytics outcomes faster and with greater confidence. /Global Head, Media & Advertising GTM"}
{"session_id": "how-should-enterprises-tackle-ai-agents-and-data-cloud-databricks", "title": "How Should Enterprises Tackle AI, Agents and Data Cloud With Databricks?", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES", "technologies": ["AI/BI", "MOSAIC AI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["Founder & Investor, Aisera"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "In this session we will cover how enterprises can build and buy solutions for AI, Agents and Data Coud. Databricks provides a data cloud platform and foundational layer. Companies have good established choices for public or hybrid cloud for compute, GPU, network, storage, and microservices. We will discuss Gen AI platform and Agents OS platform as next foundational layers on top of Data Cloud to support third-party AI apps or internally-developed AI apps. Users and organizations need Killer AI & Agent apps to realize the promise and vision of AI and ROI. /VP & Head of Cloud, Data, and Analytics\nGilead Sciences /Founder & Investor"}
{"session_id": "integrating-ai-data-unified-strategy-business", "title": "Integrating AI With Data: A Unified Strategy for Business", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY, FINANCIAL SERVICES", "technologies": ["AI/BI"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Scala"], "speakers": ["Vice President of Data, Analytics & AI, EXL"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "In the modern business landscape, AI and data strategies can no longer operate in isolation. To drive meaningful outcomes, organizations must align these critical components within a unified framework tied to overarching business objectives. This presentation explores the necessity of integrating AI and data strategies, emphasizing the importance of high-quality data, scalable architectures and robust governance. Attendees will learn three essential steps that need to be taken: Additionally, the talk will highlight the cultural shift required to bridge IT and business silos, fostering roles that combine technical and business expertise. We’ll dive into specific practical steps that can be taken to ensure an organization has a cohesive and blended AI and data strategy, using specific case examples. /Vice President of Data, Analytics & AI"}
{"session_id": "learning-goldman-sachs-legend-lakehouse-data-governance", "title": "Learning from Goldman Sachs' Legend Lakehouse for Data Governance", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "FINANCIAL SERVICES", "technologies": ["APACHE ICEBERG", "APACHE SPARK", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Real-time"], "speakers": ["Managing Director, Goldman Sachs"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Data is the backbone of modern decision-making, but centralizing it is only the tip of the iceberg. Entitlements, secure sharing and just-in-time availability are critical challenges to any large-scale platform. Join Goldman Sachs as we reveal how our Legend Lakehouse, coupled with Databricks, overcomes these hurdles to deliver high-quality, governed data at scale. By leveraging an open table format (Apache Iceberg) and open catalog format (Unity Catalog), we ensure platform interoperability and vendor neutrality. Databricks Unity Catalog then provides a robust entitlement system that aligns with our data contracts, ensuring consistent access control across producer and consumer workspaces. Finally, Legend functions, integrating with Databricks User Defined Functions (UDF), offer real-time data enrichment and secure transformations without exposing raw datasets. Discover how these components unite to streamline analytics, bolster governance and power innovation. /Managing Director"}
{"session_id": "life-sciences-how-ai-transforming-drug-discovery-commercialization", "title": "Life Sciences: How AI is Transforming Drug Discovery to Commercialization", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES", "technologies": ["DELTA LAKE", "MOSAIC AI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["Industry Marketing Lead, HLS, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Artificial intelligence is revolutionizing the life sciences industry, accelerating progress from drug discovery to commercialization. By harnessing vast datasets and advanced analytics, AI enables researchers to identify promising compounds, predict outcomes and optimize clinical trials with unprecedented speed and accuracy. In manufacturing and supply chain, AI streamlines operations, enhances quality control and improves forecasting. Commercial teams leverage AI-driven insights for targeted market strategies and personalized engagement. This session explores real-world applications and success stories, highlighting how AI is driving innovation, efficiency and better patient outcomes across the entire life sciences value chain. /Industry Marketing Lead, HLS"}
{"session_id": "media-and-advertising-industry-forum", "title": "Media and Advertising Industry Forum", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "MEDIA AND ENTERTAINMENT", "technologies": ["AI/BI", "DATABRICKS SQL", "MOSAIC AI"], "duration": "60 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["Senior Vice President, Acxiom"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Join us at the Media & Advertising Forum to explore how data and AI are transforming media and advertising from content to creative and identity to outcomes. Featuring innovators from leading agencies, platforms, streamers and ad tech — plus exciting announcements from Databricks — this session delivers must-have insights for industry leaders and change agents. What to expect: /Global Head, Media & Advertising GTM\nDatabricks /SVP of Emerging Technology\nFox Corporation /Senior Vice President"}
{"session_id": "meeting-global-electricity-demands-strategic-role-nuclear-and-hydro", "title": "Meeting Global Electricity Demands: The Strategic Role of Nuclear and Hydro", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENERGY AND UTILITIES", "technologies": ["AI/BI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["ML Engineer, Hydro Quebec"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Join us for a groundbreaking session featuring two pioneers at the forefront of AI and data innovation in the energy sector: Westinghouse Electric Company and Hydro-Quebec. In the first segment, we'll explore AI's crucial role in enhancing safety, efficiency and compliance in nuclear operations through technologies like HiVE and Bertha, focusing on the unique reliability and credibility requirements of the regulated nuclear industry. Following this, Hydro-Quebec will demonstrate how they're tackling growing energy demands through innovative hierarchical forecasting systems that process terabytes of IoT sensor data across multiple levels. Their bottom-up approach leverages distributed computing paradigms and MLOps principles to train models on millions of time series datasets, ensuring grid efficiency and resilience. Together, these presentations showcase how AI and advanced data systems are transforming critical infrastructure management across the energy sector. /CTO, EVP R&D and Innovation\nWestinghouse Electric Company /ML Engineer"}
{"session_id": "new-competitive-edge-building-resilient-supply-chains-data-ai", "title": "The New Competitive Edge: Building Resilient Supply Chains With Data + AI", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "RETAIL AND CPG - FOOD", "technologies": ["DELTA SHARING"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["VP Data, Analytics and AI (CDO), Danone"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Consumer-facing industries are evolving faster than ever — and in today’s competitive landscape, it’s supply chains, not companies, that are truly competing. While data and AI offer huge potential for optimization, many organizations struggle to turn use cases into real business impact. In this session, leaders from retail, consumer goods, travel and hospitality will share how they’re building strong data foundations to unlock AI-driven supply chain optimization. Learn how they're using generative AI to boost productivity, streamline operations and improve insights through better data collaboration. /Global VP | Consumer Industries GTM\nDatabricks /SAP /VP Data, Analytics and AI (CDO)"}
{"session_id": "overwhelmed-empowered-how-sap-democratizing-data-ai-databricks-solve", "title": "From Overwhelmed to Empowered: How SAP is Democratizing Data & AI with Databricks to Solve Problems", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "LIGHTNING TALK", "industry": "EDUCATION, ENTERPRISE TECHNOLOGY", "technologies": ["DELTA LAKE", "MLFLOW", "UNITY CATALOG"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": [], "speakers": ["Technology & Innovation Manager, SAP SE"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "/Technology & Innovation Manager"}
{"session_id": "payer-digital-transformation-impact-data-ai", "title": "Payer Digital Transformation: The Impact of Data + AI", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES", "technologies": ["DELTA LAKE", "MOSAIC AI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Governance"], "speakers": ["ML Engineering"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Payer organizations are rapidly embracing digital transformation, leveraging data and AI to drive operational efficiency, improve member experiences and enhance decision-making. This session explores how advanced analytics, robust data governance and AI-powered insights are enabling payers to streamline claims processing, personalize member engagement, manage pharmacy operations, and optimize care management. Thought leaders from Evernorth will share real-world examples of data-driven innovation, discuss strategies for overcoming interoperability and privacy challenges, and highlight the future potential of AI in reshaping the payer landscape. /Sr. Directory Industry GTM\nDatabricks /Head of Data and Analytics Architecture\nCigna/Evernorth /IT Senior Principal\nCigna /Vice President Healthcare\nFractal /VP, AI/ML Engineering"}
{"session_id": "prediction-prevention-transforming-risk-management-insurance", "title": "From Prediction to Prevention: Transforming Risk Management in Insurance", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "FINANCIAL SERVICES", "technologies": ["AI/BI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Engineering", "Machine Learning"], "speakers": ["Manager AI & Data Engineering, Intact Financial Corp"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Protecting insurers against emerging threats is critical. This session reveals how leading companies use Databricks’ Data Intelligence Platform to transform risk management, enhance fraud detection, and ensure compliance. Learn how advanced analytics, AI, and machine learning process vast data in real time to identify risks and mitigate threats. Industry leaders will share strategies for building resilient operations that protect against financial losses and reputational harm. Key takeaways: Discover how data intelligence is revolutionizing insurance risk management and safeguarding the industry’s future. /Global Head of Insurance ProServ\nDatabricks /AVP, P&C Actuarial Data and Technology\nNationwide /Head of Data & Analytics\nTravelers /Manager AI & Data Engineering"}
{"session_id": "public-sector-industry-forum", "title": "Public Sector Industry Forum", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "EDUCATION, PUBLIC SECTOR", "technologies": ["DELTA LAKE", "MOSAIC AI", "UNITY CATALOG"], "duration": "60 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["VP, Federal Government, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Join the 60-minute kickoff session at the Public Sector Forum for an opportunity to to accelerate innovation into your enterprise through governance, compliance and GenAI. Featuring keynotes from data-driven agency leaders and providing a future-looking journey from Databricks, this event offers invaluable insights. Understand the outcomes of Data and AI powering transformation across common areas of government and beyond: You will not want to miss this exclusive opportunity to own your data and eliminate government silos. Discover the Data + AI Company with deep compliance experience and widespread adoption. /VP and GM, Public Sector\nDatabricks /VP, Federal Government"}
{"session_id": "real-world-use-cases-gaming-data-and-ai", "title": "Real World Use Cases for Gaming with Data and AI", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "MEDIA AND ENTERTAINMENT", "technologies": ["MLFLOW", "MOSAIC AI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": [], "speakers": ["Sr. Solutions Architect, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "In this breakout session you will hear from some of the biggest names in Gaming. FanDuel will share their experiences with Databricks and Monte Carlo simulations and GeoComply will share how they’ve integrated Databricks into their solution to help Gaming customers across the globe address regulatory requirements and keep bettors safe. /Sr. Solutions Architect"}
{"session_id": "real-world-use-cases-gaming-data-and-ai-fanduel", "title": "Real World Use Cases for Gaming With Data and AI at FanDuel", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "MEDIA AND ENTERTAINMENT", "technologies": ["AI/BI", "DATABRICKS SQL", "MOSAIC AI"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["Data Governance", "Data Quality"], "speakers": ["Sr. Director, Data Governance, FanDuel"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "In this session you'll receive an initial primer on different ways that Databricks is serving gaming worldwide. You will then hear from FanDuel regarding how they've found quality is always your best bet. They will share how reinforcing your data through Governance and Data Quality using Monte Carlo and Databricks has helped them further their success. /Global Games GTM Leader\nDatabricks /Ludia /Data Governance Engineer\nYelp /Sr. Director, Data Governance"}
{"session_id": "reduce-risk-while-you-improve-services-and-operations", "title": "Reduce Risk While You Improve Services and Operations", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "EDUCATION, PUBLIC SECTOR", "technologies": ["DATABRICKS APPS", "DATABRICKS WORKFLOWS"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": [], "speakers": ["VP, Federal Government, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Supporting the scale of Public Sector data and the need to protect sensitive information is essential to public sector organizations. /VP and GM, Public Sector\nDatabricks /VP, Federal Government"}
{"session_id": "reinvent-government-data-intelligence-era", "title": "Reinvent Government in an Data Intelligence Era", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "EDUCATION, PUBLIC SECTOR", "technologies": ["DATABRICKS WORKFLOWS"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["Streaming"], "speakers": ["VP, Federal Government, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "To dramatically transform the way citizen services are delivered, organizations must bring all data together — streaming, structured and unstructured — in a secure and governed platform. /VP and GM, Public Sector\nDatabricks /VP, Federal Government"}
{"session_id": "retail-consumer-goods-industry-forum-how-ai-transforming-how-brands", "title": "Retail & Consumer Goods Industry Forum: How AI is Transforming How Brands Connect With Consumers", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "RETAIL AND CPG - FOOD", "technologies": ["AI/BI", "DATABRICKS APPS", "DELTA SHARING"], "duration": "60 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Machine Learning", "Real-time"], "speakers": ["SVP, Head of Enterprise Data, PepsiCo"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Consumer industries are being transformed by AI as physical and digital experiences converge. In this flagship session for retail, travel, restaurants and consumer goods attendees at Data + AI Summit, Databricks and a panel of industry leaders will explore how real-time data and machine learning are enabling brands to gain deeper consumer insights, personalize interactions and move closer to true 1:1 marketing. From AI agents shopping on behalf of consumers to consumer-centric supply chains, discover how the most innovative companies will use AI to reshape customer relationships and drive growth in an increasingly connected world. /Global Head of Brand Intelligence, Data & Analytics\nValentino /Global VP | Consumer Industries GTM\nDatabricks /Head of Consumer Industries Marketing\nDatabricks /SVP, Head of Enterprise Data"}
{"session_id": "revolutionizing-counterparty-credit-risk-saccr-how-morgan-stanley", "title": "Revolutionizing Counterparty Credit Risk (SACCR) – How Morgan Stanley Scaled With Databricks", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "FINANCIAL SERVICES", "technologies": ["APACHE SPARK", "DATABRICKS WORKFLOWS", "DELTA LAKE"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": [], "speakers": ["Sr. Solutions Architect, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Learn how Morgan Stanley scaled one of their most significant regulatory calculators (SACCR) by leveraging Databricks for horizontal and vertical scaling. Discover how we harnessed Databricks to improve performance, improve calculation accuracy, regulatory compliance and more. /Executive Director\nMorgan Stanley /Sr. Solutions Architect"}
{"session_id": "revolutionizing-cybersecurity-scbs-journey-self-managed-siem", "title": "Revolutionizing Cybersecurity: SCB's Journey to a Self-Managed SIEM", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "FINANCIAL SERVICES", "technologies": ["DELTA LAKE", "MLFLOW", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["Global Head, Cybersecurity Operations, Standard Chartered Bank"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Join us to explore how Standard Chartered Bank's (SCB) groundbreaking strategy is reshaping the future of the cybersecurity landscape by replacing traditional SIEM with a cutting-edge Databricks solution, achieving remarkable business outcomes: This talk unveils SCB's journey to a distributed, multi-cloud lakehouse architecture that unlocks unprecedented performance and commercial optimization. Explore why a unified data and AI platform is becoming the cornerstone of next-generation, self-managed SIEM solutions for forward-thinking organizations in this era of AI-powered banking transformation. /Global Head, Cybersecurity Operations"}
{"session_id": "revolutionizing-data-insights-and-buyer-experience-gm-financial-cloud", "title": "Revolutionizing Data Insights and the Buyer Experience at GM Financial with Cloud Data Modernization", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "RETAIL AND CPG - FOOD, FINANCIAL SERVICES", "technologies": ["MOSAIC AI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Governance"], "speakers": ["Head Senior VP, Data Analytics, GM Financial"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Deloitte and GM (General Motors) Financial have collaborated to design and implement a cutting-edge cloud analytics platform, leveraging Databricks. In this session, we will explore how we overcame challenges including dispersed and limited data capabilities, high-cost hardware and outdated software, with a strategic and comprehensive approach. With the help of Deloitte and Databricks, we were able to develop a unified Customer360 view, integrate advanced AI-driven analytics, and establish robust data governance and cyber security measures. Attendees will gain valuable insights into the benefits realized, such as cost savings, enhanced customer experiences, and broad employee upskilling opportunities. Unlock the impact of cloud data modernization and advanced analytics in the automotive finance industry and beyond with Deloitte and Databricks. /Principal\nDeloitte Consulting, LLP /Head Senior VP, Data Analytics"}
{"session_id": "scaling-success-how-banks-are-unlocking-growth-data-and-ai", "title": "Scaling Success: How Banks are Unlocking Growth With Data and AI", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "FINANCIAL SERVICES", "technologies": ["AI/BI", "DATA MARKETPLACE", "MOSAIC AI"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Machine Learning"], "speakers": ["Chief Data and AI Officer, FIS GLOBAL"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Growth in banking isn’t just about keeping pace—it’s about setting the pace. This session explores how leading banks leverage Databricks’ Data Intelligence Platform to uncover new revenue opportunities, deepen customer relationships, and expand market reach. Hear from industry leaders who have transformed their growth strategies by harnessing the power of advanced analytics and machine learning. Learn how personalized customer experiences, predictive insights and unified data platforms are driving innovation and helping banks scale faster than ever. Key takeaways: Join us in discovering how data intelligence is redefining growth in banking and thriving throughout uncertainty. /Field CTO\nDatabricks /E&Y /Chief Data and AI Officer"}
{"session_id": "securing-future-how-banks-are-reducing-risk-data-and-ai", "title": "Securing the Future: How Banks are Reducing Risk With Data and AI", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "FINANCIAL SERVICES", "technologies": ["MOSAIC AI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": [], "speakers": ["CIO, Nationwide Building SOCIETY"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "/Head of Global Banking & EMEA FINSERV\nDatabricks /CIO"}
{"session_id": "simon-denny-unfiltered-unscripted", "title": "Simon + Denny - Unfiltered & Unscripted", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY, MEDIA AND ENTERTAINMENT, FINANCIAL SERVICES", "technologies": ["APACHE SPARK", "DELTA LAKE", "MOSAIC AI"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Architecture"], "speakers": ["PM Director, Developer Relations, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Two industry veterans have been debating data architecture, tearing apart trends and tinkering with tech for decades and they’re bringing the conversation live — and you’re in control. Got a burning question about lake structures or internal performance? Worried about AI taking over the world? Want straight-talking opinions on the latest hype? Need real-world advice from the people who the experts get advice from? Want to get the juicy behind-the-scenes gossip about any announcements and shockwaves from the Keynotes? This is your chance to have your questions answered! Submit your questions ahead of time or bring them on the day — no topic is off-limits (though there's always a risk of side quests into coffee, sci-fi, or the quirks of English weather). Come for the insights, stay for the chaos. /CTO\nAdvancing Analytics /PM Director, Developer Relations"}
{"session_id": "sponsored-aws-buy-aws", "title": "Sponsored by: AWS | Buy with AWS", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "LIGHTNING TALK", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["DATA MARKETPLACE", "MOSAIC AI"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": [], "speakers": [], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "AWS Marketplace is transforming how enterprises worldwide find, buy, deploy, and govern software, data, and professional services. Easily find and deploy the software, data, and services that you need from over 5,000+ Sellers with fast procurement and flexible pricing and terms. AWS Marketplace enables seamless integration with AWS services as well as consolidated AWS billing, centralized governance, and simplified vendor management. AWS delivers the solutions you need, when and where you need them including Buy with AWS direct on AWS Partner websites. Learn more about how AWS Marketplace is driving value for customers and AWS Partners."}
{"session_id": "sponsored-deloitte-accelerating-biopharmaceutical-breakthroughs", "title": "Sponsored by: Deloitte | Accelerating Biopharmaceutical Breakthroughs with an Innovative Enterprise Data Strategy", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "LIGHTNING TALK", "industry": "HEALTH AND LIFE SCIENCES", "technologies": ["UNITY CATALOG"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["Data Governance", "Data Integration", "Data Quality", "Real-time", "Scala"], "speakers": [], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "In the rapidly evolving life sciences and healthcare industry, leveraging data-as-a-product is crucial for driving innovation and achieving business objectives. Join us to explore how Deloitte is revolutionizing data strategy solutions by overcoming challenges such as data silos, poor data quality, and lack of real-time insights with the Databricks Data Intelligence Platform. Learn how effective data governance, seamless data integration, and scalable architectures support personalized medicine, regulatory compliance, and operational efficiency. This session will highlight how these strategies enable biopharma companies to transform data into actionable insights, accelerate breakthroughs and enhance life sciences outcomes."}
{"session_id": "sponsored-ey-navigating-future-knowledge-powered-insights-ai", "title": "Sponsored by: EY | Navigating the Future: Knowledge-Powered Insights on AI, Information Governance, Real-Time Analytics", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "PROFESSIONAL SERVICES", "technologies": ["AI/BI", "DATABRICKS APPS"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Science", "Real-time"], "speakers": [], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "In an era where data drives strategic decision-making, organizations must adapt to the evolving landscape of business analytics. This session will focus on three pivotal themes shaping the future of data management and analytics in 2025. Join our panel of experts, including a Business Analytics Leader, Head of Information Governance, and Data Science Leader, as they explore: - Knowledge-Powered AI: Discover trends in Knowledge-Powered AI and how these initiatives can revolutionize business analytics, with real-world examples of successful implementations. - Information Governance: Explore the role of information governance in ensuring data integrity and compliance. Our experts will discuss strategies for establishing robust frameworks that protect organizational assets. - Real-Time Analytics: Understand the importance of real-time analytics in today’s fast-paced environment. The panel will highlight how organizations can leverage real-time data for agile decision-making."}
{"session_id": "sponsored-impetus-supercharge-ai-automated-migration-databricks-impetus", "title": "Sponsored by: Impetus | Supercharge AI with automated migration to Databricks with Impetus", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "MANUFACTURING, RETAIL AND CPG - FOOD, FINANCIAL SERVICES", "technologies": ["DATABRICKS SQL", "DELTA LAKE", "UNITY CATALOG"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["Analytics", "Scala"], "speakers": [], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Migrating legacy workloads to a modern, scalable platform like Databricks can be complex and resource-intensive. Impetus, an Elite Databricks Partner and the Databricks Migration Partner of the Year 2024, simplifies this journey with LeapLogic, an automated solution for data platform modernization and migration services. LeapLogic intelligently discovers, transforms, and optimizes workloads for Databricks, ensuring minimal risk and faster time-to-value. In this session, we’ll showcase real-world success stories of enterprises that have leveraged Impetus’ LeapLogic to modernize their data ecosystems efficiently. Join us to explore how you can accelerate your migration journey, unlock actionable insights, and future-proof your analytics with a seamless transition to Databricks."}
{"session_id": "sponsored-monte-carlo-investing-data-quality-nasdaqs-journey-data-ai", "title": "Sponsored by: Monte Carlo | Investing in Data Quality: Nasdaq’s Journey to Data + AI Reliability", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "FINANCIAL SERVICES", "technologies": ["DELTA LAKE", "UNITY CATALOG"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Data Quality"], "speakers": [], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "As one of the world’s largest stock exchanges, Nasdaq knows that high-quality data + AI isn’t just a nice-to-have – it’s mission critical. That means choosing technology partners that can deliver on performance, scale, and reliability is just as important. That’s why their team has invested heavily in improving their organization’s data quality with data + AI observability. Join Michael Weiss to learn about the evolution of data at Nasdaq, how they partner with Monte Carlo to meet the needs of their modern data + AI challenges in their highly-regulated and scrutinized industry, and best practices and tips for how to implement a data quality program at any scale."}
{"session_id": "sponsored-sigma-moving-premises-unified-business-intelligence", "title": "Sponsored by: Sigma | Moving from On-premises to Unified Business Intelligence with Databricks & Sigma", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "MANUFACTURING, RETAIL AND CPG - FOOD, TRAVEL AND HOSPITALITY", "technologies": ["DATABRICKS SQL", "DELTA SHARING", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Real-time", "Scala"], "speakers": [], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Faced with the limitations of a legacy, on-prem data stack and scalability bottlenecks in MicroStrategy, Saddle Creek Logistics Services needed a modern solution to handle massive data volumes and accelerate insight delivery. By migrating to a cloud-native architecture powered by Sigma and Databricks, the team achieved significant performance gains and operational efficiency. In this session, Saddle Creek will walk through how they leveraged Databricks’ cloud-native processing engine alongside a unified governance layer through Unity Catalog to streamline and secure downstream analytics in Sigma. Learn how embedded dashboards and near real-time reporting—cutting latency from 9 minutes to just 3 seconds—have empowered data-driven collaboration with external partners and driven a major effort to consolidate over 30,000 reports and objects to under 1,000."}
{"session_id": "sponsored-sigma-trading-spreadsheets-speed-tradestations-self-service", "title": "Sponsored by: Sigma | Trading Spreadsheets for Speed: TradeStation’s Self-Service Revolution", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "LIGHTNING TALK", "industry": "PROFESSIONAL SERVICES, FINANCIAL SERVICES", "technologies": ["AI/BI", "DATABRICKS WORKFLOWS", "UNITY CATALOG"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["Analytics", "Data Architecture", "Scala"], "speakers": [], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "To meet the growing internal demand for accessible, reliable data, TradeStation migrated from fragmented, spreadsheet-driven workflows to a scalable, self-service analytics framework powered by Sigma on Databricks. This transition enabled business and technical users alike to interact with governed data models directly on the lakehouse, eliminating data silos and manual reporting overhead. In brokerage trading operations, the integration supports robust risk management, automates key operational workflows, and centralizes collaboration across teams. By leveraging Sigma’s intuitive interface on top of Databricks’ scalable compute and unified data architecture, TradeStation has accelerated time-to-insight, improved reporting consistency, and empowered teams to operationalize data-driven decisions at scale."}
{"session_id": "tech-industry-forum-tip-spear-data-and-ai", "title": "Tech Industry Forum: Tip of the Spear With Data and AI", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["APACHE ICEBERG", "DELTA LAKE", "UNITY CATALOG"], "duration": "60 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Engineering"], "speakers": ["Chief Product & Technology Officer, ThredUp Inc."], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Join us for the Tech Industry Forum, formerly known as the Tech Innovators Summit, now part of Databricks Industry Experience. This session will feature keynotes, panels and expert talks led by top customer speakers and Databricks experts. Tech companies are pushing the boundaries of data and AI to accelerate innovation, optimize operations and build collaborative ecosystems. In this session, we’ll explore how unified data platforms empower organizations to scale their impact, democratize analytics across teams and foster openness for building tomorrow’s products. Key topics include: After the session, connect with your peers during the exclusive Industry Forum Happy Hour. Reserve your seat today! /Industry Marketing, Digital Natives\nDatabricks /Director, Product\nDatabricks /VP, Data Engineering\nZillow /Data Magician\nDatabricks /VP of Data & AI\nRobinhood /Dropbox /Chief Product & Technology Officer"}
{"session_id": "techcombanks-multi-million-dollar-transformation-leveraging-cloud-and", "title": "Techcombank's Multi-Million Dollar Transformation Leveraging Cloud and Databricks", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "FINANCIAL SERVICES", "technologies": ["DATABRICKS SQL", "DELTA LAKE", "MLFLOW"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["Chief Data and Analytics Officer, Techcombank (TCB)"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "The migration to the Databricks Data Intelligence Platform has enabled Techcombank to more efficiently unify data from over 50 systems, improve governance, streamline daily operational analytics pipelines and use advanced analytics tools and AI to create more meaningful and personalized experiences for customers. With Databricks, Techcombank has also introduced key solutions that are reshaping its digital banking services: AI-driven lead management system: Techcombank's internally developed AI program called 'Lead Allocation Curated Engine' (LACE) optimizes lead management and provides relationship managers with enriched insights for smarter lead allocation to drive business growth. AI-powered program for digital banking inclusion of small businesses: An AI-powered GeoSense assists frontline workers with analytics-driven insights about which small businesses and merchants to engage in the bank's digital ecosystem. And more examples, which will be presented. /Chief Data and Analytics Officer"}
{"session_id": "telco-reimagined-real-world-journeys-data-and-ai-customer-experience", "title": "Telco Reimagined: Real-World Journeys in Data and AI for Customer Experience Transformation", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "MEDIA AND ENTERTAINMENT", "technologies": ["DATABRICKS SQL", "MOSAIC AI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Machine Learning"], "speakers": ["Head of Global Telecom Industry, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "How are today’s leading telecom operators transforming customer experience at scale with data and AI? Join us for an inspiring fireside chat with senior leaders from Optus and T-Mobile as they share their transformation stories — from the first steps to major milestones and the tangible business impact achieved with Databricks’ Data Intelligence Platform. You’ll hear firsthand how these forward-thinking CSP’s are driving measurable outcomes through unified data, machine learning and AI. Discover the high-impact use cases they’re prioritizing — like proactive care and hyper-personalization — and gain insight into their bold vision for the future of customer experience in telecom. Whether you're just beginning your AI journey or scaling to new heights, this session offers an authentic look at what’s working, what’s next and how data and AI are helping telecoms lead in a competitive landscape. /Head of Global Telecom Industry"}
{"session_id": "telecom-innovation-exchange-demos-and-dialogues", "title": "Telecom Innovation Exchange: Demos and Dialogues", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "MEDIA AND ENTERTAINMENT", "technologies": ["DATABRICKS SQL", "MOSAIC AI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Scala"], "speakers": ["Head of Global Telecom Industry, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Join us for an interactive breakout session designed to explore scalable, real-world solutions powered by Partners with Databricks. In this high-energy session, you'll hear from three of our leading partners — Accenture, Capgemini and Wipro — as they each deliver rapid-fire, 5-minute demos of their most impactful, production-grade solutions built for the telecom industry. From network intelligence to customer experience to AI-driven automation, these solutions are already driving tangible outcomes at scale. After the demos, you’ll have the unique opportunity to engage directly with each partner in a “speed dating” style format. Dive deep into the solutions, ask your questions and explore how these approaches can be tailored to your organization’s needs. Whether you're solving for churn, fraud, network ops or enterprise AI use cases, this session is your chance to connect, collaborate and walk away with practical ideas you can take back to your teams. /Head of Global Telecom Industry"}
{"session_id": "telecommunications-industry-forum-intelligent-telecom-efficiency", "title": "Telecommunications Industry Forum: The Intelligent Telecom: Efficiency, Revenue Growth, Impact", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "MEDIA AND ENTERTAINMENT", "technologies": ["DATABRICKS SQL", "MOSAIC AI", "UNITY CATALOG"], "duration": "60 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["Head of Global Telecom Industry, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "The telecommunications industry is at a pivotal moment. As networks expand to support 5G, IoT and next-generation customer experiences, success will belong to those who harness the full power of data and AI. These leaders will drive greater efficiency, unlock new revenue streams and deliver world-class service. Join us at the DAIS Telecom Forum for an exclusive Telecom Keynote where industry trailblazers reveal how they are transforming their organizations with the Databricks Data Intelligence Platform. Gain firsthand insights into how leading telecoms are leveraging open, interoperable data strategies to break down silos, improve operational agility and deliver measurable business outcomes. Don’t miss this opportunity to connect with global telecom leaders, learn from real-world success stories and be inspired to lead your organization’s next wave of transformation. The future of telecom is being built now — be part of the conversation. /Head of Global Telecom Industry"}
{"session_id": "transforming-data-rheem-silos-scalable-data-lakehouse-databricks-and", "title": "Transforming Data at Rheem: From Silos to Scalable Data Lakehouse With Databricks and Unity Catalog", "track": "DATA STRATEGY", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "MANUFACTURING", "technologies": ["DATABRICKS SQL", "DELTA LAKE", "UNITY CATALOG"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Scala"], "speakers": ["Vice President, Enterprise Applications, Rheem"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Rheem's journey from a fragmented data landscape to a robust, scalable data platform powered by Databricks showcases the power of data modernization. In just 1.5 years, Rheem evolved from siloed reporting to 30+ certified data products, integrated with 20+ source systems, including MDM. This transformation has unlocked significant business value across sales, procurement, service and operations, enhancing decision-making and operational efficiency. This session will delve into Rheem's implementation of Databricks, highlighting how it has become the cornerstone of rapid data product development and efficient data sharing across the organization. We will also explore the upcoming enhancements with Unity Catalog, including the full migration from HMS to UC. Attendees will gain insights into best practices for building a centralized data platform, enhancing developer experience, improving governance capabilities as well as tips and tricks for a successful UC migration and enablement. /Senior Manager, AI & Data\nEY /Vice President, Enterprise Applications"}
{"session_id": "transforming-government-data-and-ai-singapore-govtechs-journey", "title": "Transforming Government With Data and AI: Singapore GovTech's Journey With Databricks", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "PUBLIC SECTOR", "technologies": ["AI/BI", "DATABRICKS WORKFLOWS", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Quality"], "speakers": ["Deputy Chief Data Officer, GovTech"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "GovTech is an agency in the Singapore Government focused on tech for good. The GovTech Chief Data Office (CDO) has built the GovTech Data Platform with Databricks at the core. As the government tech agency, we safeguard national-level government and citizen data. A comprehensive data strategy is essential to uplifting data maturity. GovTech has adopted the service model approach where data services are offered to stakeholders based on their data maturity. Their maturity is uplifted through partnership, readying them for more advanced data analytics. CDO offers a plethora of data assets in a “data restaurant” ranging from raw data to data products, all delivered via Databricks and enabled through fine-grained access control, underpinned by data management best practices such as data quality, security and governance. Within our first year on Databricks, CDO was able to save 8,000 man-hours, democratize data across 50% of the agency and achieve six-figure savings through BI consolidation. /Senior Manager, Data Management\nGovTech Singapore /Deputy Chief Data Officer"}
{"session_id": "valentino-customer-journey-databricks", "title": "VALENTINO — Customer Journey with Databricks", "track": "DATA STRATEGY", "level": "ADVANCED", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY, MANUFACTURING, RETAIL AND CPG - FOOD", "technologies": ["DATABRICKS WORKFLOWS", "DELTA LAKE", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Pipeline"], "speakers": ["Global Head of Brand Intelligence, Data & Analytics, Valentino"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "VALENTINO decided to adopt Databricks within their own Data Strategy and Digital Transformation in order to address audience targeting across ads and marketing automation. Among several data sources and different legacy systems, Databricks offers the capabilities for an holistic view and the most recent data availability. In the past, at VALENTINO we spent significant time building and exporting CSVs and data pipelines for marketing teams —campaigns often go out late. /Global Head of Brand Intelligence, Data & Analytics"}
