{"session_id": "breaking-silos-cignas-journey-seamless-data-sharing-delta-sharing", "title": "Breaking Silos: Cigna’s Journey to Seamless Data Sharing with Delta Sharing", "track": "DATA SHARING AND COLLABORATION", "level": "BEGINNER", "type": "LIGHTNING TALK", "industry": "HEALTH AND LIFE SCIENCES", "technologies": ["APACHE SPARK", "DATABRICKS SQL", "UNITY CATALOG"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["ELT", "Real-time"], "speakers": ["Senior Director, Evernorth Health Services"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "As data ecosystems grow increasingly complex, the ability to share data securely, seamlessly, and in real time has become a strategic differentiator. In this session, Cigna will showcase how Delta Sharing on Databricks has enabled them to modernize data delivery, reduce operational overhead, and unlock new market opportunities. Learn how Cigna achieved significant savings by streamlining operations, compute, and platform overhead for just one use case. Explore how decentralizing data ownership—transitioning from hyper-centralized teams to empowered product owners—has simplified delivery and accelerated innovation. Most importantly, see how this modern open data-sharing framework has positioned Cigna to win contracts they previously couldn’t, by enabling real-time, cross-organizational data collaboration with external partners. Join us to hear how Cigna is using Delta Sharing not just as a technical enabler, but as a business catalyst. /Senior Director"}
{"session_id": "breaking-silos-using-sap-delta-sharing-connector-seamless-access", "title": "Breaking Silos: Using the SAP Delta Sharing Connector for Seamless Access in Databricks", "track": "DATA SHARING AND COLLABORATION", "level": "BEGINNER", "type": "BREAKOUT", "industry": "MANUFACTURING, RETAIL AND CPG - FOOD, FINANCIAL SERVICES", "technologies": ["DELTA SHARING"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "ELT", "ETL"], "speakers": ["Product Manager, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "We’re excited to announce the General Availability of the SAP Delta Sharing Connector, enabling SAP Business Data Cloud (BDC) customers to securely and seamlessly share data with Databricks — no complex ETL or data duplication required. This connector enables organizations to securely share SAP data for analytics and AI in Databricks, while also supporting bidirectional data sharing back to SAP. In this session, we’ll walk through a live demo of the SAP Delta Sharing Connector in action, followed by a real-world customer story showcasing how this integration is driving value across analytics and AI use cases. You’ll also leave with practical best practices to help you implement the connector in your own environment. Whether you’re looking to bring SAP data into Databricks for advanced analytics or build AI models on top of trusted SAP datasets, this session will show you how to get started — securely and efficiently. /Staff Product Manager\nDatabricks /Product Manager"}
