{"session_id": "ai-and-genie-analyzing-healthcare-improvement-opportunities", "title": "AI and Genie: Analyzing Healthcare Improvement Opportunities", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY, HEALTH AND LIFE SCIENCES", "technologies": ["AI/BI", "DATABRICKS SQL", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "SQL"], "speakers": ["Software Architect, Premier Inc"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Improving healthcare impacts us all. We highlight how Premier Inc. took risk-adjusted patient data from more than 1,300 member hospitals across America, applying a natural language interface using AI/BI Genie, allowing our users to discover new insights. The stakes are high, new insights surfaced represent potential care improvement and lives positively impacted. Using Genie and our AI-ready data in Unity Catalog, our team was able to stand up a Genie instance in three short days, bypassing costs and time of custom modeling and application development. Additionally, Genie allowed our internal teams to generate complex SQL, as much as 10 times faster than writing it by hand. As Genie and lakehouse apps continue to advance rapidly, we are excited to leverage these features by introducing Genie to as many as 20,000 users across hundreds of hospitals. This will support our members’ ongoing mission to enhance the care they provide to the communities they serve. /Senior Director, Analytics\nPremier Inc /Software Architect"}
{"session_id": "ai-assisted-bi-everything-you-need-know", "title": "AI-Assisted BI: Everything You Need to Know", "track": "ANALYTICS AND BI", "level": "BEGINNER", "type": "LIGHTNING TALK", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS SQL"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Business Intelligence", "SQL"], "speakers": ["Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Explore how AI is transforming business intelligence and data analytics across the Databricks Platform. This session provides a comprehensive overview of AI-assisted capabilities — from auto-generating dashboards and visualizations to enabling conversational analytics with Genie. We’ll also cover AI-powered notebooks and SQL editors that accelerate code generation, streamline exploratory analysis and simplify workflows. Whether you’re a data engineer, analyst or BI developer, you’ll walk away ready to harness AI to drive faster, smarter decisions across your organization. /Sr. Product Manager\nDatabricks /Databricks"}
{"session_id": "ai-powered-profits-smarter-order-and-inventory-management", "title": "AI-Powered Profits: Smarter Order and Inventory Management", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "MANUFACTURING", "technologies": ["AI/BI", "DELTA SHARING"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": [], "speakers": ["VP, Data and Enterprise Digital, Xylem"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "/Solutions Architect\nDatabricks /VP, Data and Enterprise Digital"}
{"session_id": "aibi-dashboards-and-aibi-genie-dashboards-and-last-mile-analytics-made", "title": "AI/BI Dashboards and AI/BI Genie: Dashboards and Last-Mile Analytics Made Simple", "track": "ANALYTICS AND BI", "level": "BEGINNER", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES, PROFESSIONAL SERVICES, RETAIL AND CPG - FOOD", "technologies": ["AI/BI", "DATABRICKS SQL", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["VP of Data + AI Architecture, JosueBogran.com & zeb.co"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Databricks announced two new features in 2024: AI/BI Dashboards and AI/BI Genie. Dashboards is a redesigned dashboarding experience for your regular reporting needs, while Genie provides a natural language experience for your last-mile analytics. In this session, Databricks Solutions Architect and content creator Youssef Mrini will present alongside Databricks MVP and content creator Josue A. Bogran on how you can get the most value from these tools for your organization. Content covered includes: Fluff-free, full of practical tips, and geared to help you deliver immediate impact with these new Databricks capabilities. /Solutions Architect\nDatabricks /VP of Data + AI Architecture"}
{"session_id": "aibi-driving-speed-value-supply-chain", "title": "AI/BI Driving Speed to Value in Supply Chain", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "RETAIL AND CPG - FOOD", "technologies": ["AI/BI", "DATABRICKS WORKFLOWS", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Science"], "speakers": ["Data Science Manager, Conagra Brands"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Conagra is a global food manufacturer with $12.2B in revenue, 18K+ employees, 45+ plants in US, Canada and Mexico. Conagra's Supply Chain organization is heavily focused on delivering results in productivity, waste reduction, inventory rationalization, safety and customer service levels. By migrating the Supply Chain reporting suite to Databricks over the past 2 years, Conagra's Supply Chain Analytics & Data Science team has been able to deliver new AI solutions which complement traditional BI platforms and lay the foundation for additional AI/ML applications in the future. With Databricks Genie integrated within traditional BI reports, Conagra Supply Chain users can now go from insight to action faster and with fewer clicks, enabling speed to value in a complex Supply Chain. The Databricks platform also allows the team to curate data products to be consumed by traditional BI applications today as well as the ability to rapidly scale for the AI/ML applications of tomorrow. /Head of SC Adv Analytics & Data Science\nConagra Brands /Data Science Manager"}
{"session_id": "aibi-genie-look-under-hood-everyones-friendly-neighborhood-genai", "title": "AI/BI Genie: A Look Under the Hood of Everyone's Friendly, Neighborhood GenAI Product", "track": "ANALYTICS AND BI", "level": "ADVANCED", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS SQL"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["swe, databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Go beyond the user interface and explore the cutting-edge technology driving AI/BI Genie. This session breaks down the AI/BI Genie architecture, showcasing how LLMs, retrieval-augmented generation (RAG) and finely tuned knowledge bases work together to deliver fast, accurate responses. We’ll also explore how AI agents orchestrate workflows, optimize query performance and continuously refine their understanding. Ideal for those who want to geek out about the tech stack behind Genie, this session offers a rare look at the magic under the hood. /Software Engineer\nDatabricks /swe"}
{"session_id": "analyst-roadmap-databricks-sql-end-end-bi", "title": "Analyst Roadmap to Databricks: From SQL to End-to-End BI", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "RETAIL AND CPG - FOOD", "technologies": ["AI/BI", "DATABRICKS SQL", "UNITY CATALOG"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Pipeline", "SQL"], "speakers": ["Senior Business Analyst, Spencer Gifts"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Analysts often begin their Databricks journey by running familiar SQL queries in the SQL Editor, but that’s just the start. In this session, I’ll share the roadmap I followed to expand beyond ad-hoc querying into SQL Editor/notebook-driven development to scheduled data pipelines producing interactive dashboards — all powered by Databricks SQL and Unity Catalog. You’ll learn how to organize tables with primary-key/foreign-key relationships along with creating table and column comments to form the semantic model, utilizing DBSQL features like RELY constraints. I’ll also show how parameterized dashboards can be set up to empower self-service analytics and feed into Genie Spaces. Attendees will walk away with best practices for starting out with building a robust BI platform on Databricks, including tips for table design and metadata enrichment. Whether you’re a data analyst or BI developer, this talk will help you unlock powerful, AI-enhanced analytics workflows. /Senior Business Analyst"}
{"session_id": "bridging-bi-tools-deep-dive-aibi-dashboards-power-bi-practitioners", "title": "Bridging BI Tools: Deep Dive Into AI/BI Dashboards for Power BI Practitioners", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES, RETAIL AND CPG - FOOD", "technologies": ["AI/BI", "DATABRICKS SQL", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["Snr. Solutions Architect, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "In the rapidly-evolving field of data analytics, (AI/BI) dashboards and Power BI stand out as two formidable approaches, each offering unique strengths and catering to specific use cases. Power BI has earned its reputation for delivering user-friendly, highly customisable visualisations and reports for data analysis. On the other hand, AI/BI dashboards have gained good traction due to their seamless integration with the Databricks platform, making them an attractive option for data practitioners. This session will provide a comparison of these two tools, highlighting their respective features, strengths and potential limitations. Understanding the nuances between these tools is crucial for organizations aiming to make informed decisions about their data analytics strategy. This session will equip participants with the knowledge needed to select the most appropriate tool or combination of tools to meet their data analysis requirements and drive data-informed decision-making processes. /Senior Solutions Architect\nDatabricks /Snr. Solutions Architect"}
{"session_id": "building-dashboards-production-grade-data-product", "title": "Building Dashboards as a Production-Grade Data Product", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS SQL", "DATABRICKS WORKFLOWS"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["Senior Software Development Engineer, Zillow"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "At Zillow, we have accelerated the volume and quality of our dashboards by leveraging a modern SDLC with version control and CI/CD. In the past three months, we have released 32 production-grade dashboards and shared them securely across the organization while cutting error rates in half over that span. In this session, we will provide an overview of how we utilize Databricks asset bundles and GitLab CI/CD to create performant dashboards that can be confidently used for mission-critical operations. As a concrete example, we'll then explore how Zillow's Data Platform team used this approach to automate our on-call support analysis, leveraging our dashboard development strategy alongside Databricks LLM offerings to create a comprehensive view that provides actionable performance metrics alongside AI-generated insights and action items from the hundreds of requests that make up our support workload. /Senior Software Development Engineer"}
{"session_id": "caring-our-data-how-chick-fil-enables-data-driven-decision-making", "title": "Caring for Our Data: How Chick-fil-A Enables Data-Driven Decision Making with Databricks", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "RETAIL AND CPG - FOOD", "technologies": ["AI/BI", "APACHE SPARK", "DATABRICKS SQL"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Scala"], "speakers": ["Data architect, Chick-fil-A"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Chick-fil-A’s adoption of Databricks has been rewarding, providing us with a modern, scalable, efficient data platform that meets our evolving needs. With lakehouse, Chick-fil-A can unlock new insights, drive business success and continue “Winning Hearts Every Day.” Our top priority is ensuring our customers have an exceptional experience. We have unrivaled discipline in store operations and guest interaction, but our data systems were lagging. Owner/operators were spending too much time sitting in front of screens getting data to manage their stores. That data was often slow and untrusted. This is why we’re enabling AI that enables them to ask questions to get accurate responses, allowing them to spend more time in store working with team members/delighting customers. Databricks also provided BI performance improvement that has addressed major challenges to store operators, helping them to make better decisions with sales forecasting, labor optimizations and inventory management. /Enterprise Architect\nChick-fil-A, Inc /Data architect"}
