{"session_id": "ai-and-genie-analyzing-healthcare-improvement-opportunities", "title": "AI and Genie: Analyzing Healthcare Improvement Opportunities", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY, HEALTH AND LIFE SCIENCES", "technologies": ["AI/BI", "DATABRICKS SQL", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "SQL"], "speakers": ["Software Architect, Premier Inc"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Improving healthcare impacts us all. We highlight how Premier Inc. took risk-adjusted patient data from more than 1,300 member hospitals across America, applying a natural language interface using AI/BI Genie, allowing our users to discover new insights. The stakes are high, new insights surfaced represent potential care improvement and lives positively impacted. Using Genie and our AI-ready data in Unity Catalog, our team was able to stand up a Genie instance in three short days, bypassing costs and time of custom modeling and application development. Additionally, Genie allowed our internal teams to generate complex SQL, as much as 10 times faster than writing it by hand. As Genie and lakehouse apps continue to advance rapidly, we are excited to leverage these features by introducing Genie to as many as 20,000 users across hundreds of hospitals. This will support our members’ ongoing mission to enhance the care they provide to the communities they serve. /Senior Director, Analytics\nPremier Inc /Software Architect"}
{"session_id": "ai-assisted-bi-everything-you-need-know", "title": "AI-Assisted BI: Everything You Need to Know", "track": "ANALYTICS AND BI", "level": "BEGINNER", "type": "LIGHTNING TALK", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS SQL"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Business Intelligence", "SQL"], "speakers": ["Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Explore how AI is transforming business intelligence and data analytics across the Databricks Platform. This session provides a comprehensive overview of AI-assisted capabilities — from auto-generating dashboards and visualizations to enabling conversational analytics with Genie. We’ll also cover AI-powered notebooks and SQL editors that accelerate code generation, streamline exploratory analysis and simplify workflows. Whether you’re a data engineer, analyst or BI developer, you’ll walk away ready to harness AI to drive faster, smarter decisions across your organization. /Sr. Product Manager\nDatabricks /Databricks"}
{"session_id": "ai-bi-without-bs", "title": "AI for BI without the BS", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "ENTERPRISE TECHNOLOGY, FINANCIAL SERVICES", "technologies": ["AI/BI", "MOSAIC AI"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": [], "speakers": ["Co-Founder & President, Omni"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "/Co-Founder & President"}
{"session_id": "ai-powered-profits-smarter-order-and-inventory-management", "title": "AI-Powered Profits: Smarter Order and Inventory Management", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "MANUFACTURING", "technologies": ["AI/BI", "DELTA SHARING"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": [], "speakers": ["VP, Data and Enterprise Digital, Xylem"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "/Solutions Architect\nDatabricks /VP, Data and Enterprise Digital"}
{"session_id": "aibi-dashboards-and-aibi-genie-dashboards-and-last-mile-analytics-made", "title": "AI/BI Dashboards and AI/BI Genie: Dashboards and Last-Mile Analytics Made Simple", "track": "ANALYTICS AND BI", "level": "BEGINNER", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES, PROFESSIONAL SERVICES, RETAIL AND CPG - FOOD", "technologies": ["AI/BI", "DATABRICKS SQL", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["VP of Data + AI Architecture, JosueBogran.com & zeb.co"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Databricks announced two new features in 2024: AI/BI Dashboards and AI/BI Genie. Dashboards is a redesigned dashboarding experience for your regular reporting needs, while Genie provides a natural language experience for your last-mile analytics. In this session, Databricks Solutions Architect and content creator Youssef Mrini will present alongside Databricks MVP and content creator Josue A. Bogran on how you can get the most value from these tools for your organization. Content covered includes: Fluff-free, full of practical tips, and geared to help you deliver immediate impact with these new Databricks capabilities. /Solutions Architect\nDatabricks /VP of Data + AI Architecture"}
{"session_id": "aibi-driving-speed-value-supply-chain", "title": "AI/BI Driving Speed to Value in Supply Chain", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "RETAIL AND CPG - FOOD", "technologies": ["AI/BI", "DATABRICKS WORKFLOWS", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Science"], "speakers": ["Data Science Manager, Conagra Brands"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Conagra is a global food manufacturer with $12.2B in revenue, 18K+ employees, 45+ plants in US, Canada and Mexico. Conagra's Supply Chain organization is heavily focused on delivering results in productivity, waste reduction, inventory rationalization, safety and customer service levels. By migrating the Supply Chain reporting suite to Databricks over the past 2 years, Conagra's Supply Chain Analytics & Data Science team has been able to deliver new AI solutions which complement traditional BI platforms and lay the foundation for additional AI/ML applications in the future. With Databricks Genie integrated within traditional BI reports, Conagra Supply Chain users can now go from insight to action faster and with fewer clicks, enabling speed to value in a complex Supply Chain. The Databricks platform also allows the team to curate data products to be consumed by traditional BI applications today as well as the ability to rapidly scale for the AI/ML applications of tomorrow. /Head of SC Adv Analytics & Data Science\nConagra Brands /Data Science Manager"}
{"session_id": "aibi-genie-look-under-hood-everyones-friendly-neighborhood-genai", "title": "AI/BI Genie: A Look Under the Hood of Everyone's Friendly, Neighborhood GenAI Product", "track": "ANALYTICS AND BI", "level": "ADVANCED", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS SQL"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["swe, databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Go beyond the user interface and explore the cutting-edge technology driving AI/BI Genie. This session breaks down the AI/BI Genie architecture, showcasing how LLMs, retrieval-augmented generation (RAG) and finely tuned knowledge bases work together to deliver fast, accurate responses. We’ll also explore how AI agents orchestrate workflows, optimize query performance and continuously refine their understanding. Ideal for those who want to geek out about the tech stack behind Genie, this session offers a rare look at the magic under the hood. /Software Engineer\nDatabricks /swe"}
{"session_id": "analyst-roadmap-databricks-sql-end-end-bi", "title": "Analyst Roadmap to Databricks: From SQL to End-to-End BI", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "RETAIL AND CPG - FOOD", "technologies": ["AI/BI", "DATABRICKS SQL", "UNITY CATALOG"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Pipeline", "SQL"], "speakers": ["Senior Business Analyst, Spencer Gifts"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Analysts often begin their Databricks journey by running familiar SQL queries in the SQL Editor, but that’s just the start. In this session, I’ll share the roadmap I followed to expand beyond ad-hoc querying into SQL Editor/notebook-driven development to scheduled data pipelines producing interactive dashboards — all powered by Databricks SQL and Unity Catalog. You’ll learn how to organize tables with primary-key/foreign-key relationships along with creating table and column comments to form the semantic model, utilizing DBSQL features like RELY constraints. I’ll also show how parameterized dashboards can be set up to empower self-service analytics and feed into Genie Spaces. Attendees will walk away with best practices for starting out with building a robust BI platform on Databricks, including tips for table design and metadata enrichment. Whether you’re a data analyst or BI developer, this talk will help you unlock powerful, AI-enhanced analytics workflows. /Senior Business Analyst"}
{"session_id": "bridging-bi-tools-deep-dive-aibi-dashboards-power-bi-practitioners", "title": "Bridging BI Tools: Deep Dive Into AI/BI Dashboards for Power BI Practitioners", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES, RETAIL AND CPG - FOOD", "technologies": ["AI/BI", "DATABRICKS SQL", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["Snr. Solutions Architect, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "In the rapidly-evolving field of data analytics, (AI/BI) dashboards and Power BI stand out as two formidable approaches, each offering unique strengths and catering to specific use cases. Power BI has earned its reputation for delivering user-friendly, highly customisable visualisations and reports for data analysis. On the other hand, AI/BI dashboards have gained good traction due to their seamless integration with the Databricks platform, making them an attractive option for data practitioners. This session will provide a comparison of these two tools, highlighting their respective features, strengths and potential limitations. Understanding the nuances between these tools is crucial for organizations aiming to make informed decisions about their data analytics strategy. This session will equip participants with the knowledge needed to select the most appropriate tool or combination of tools to meet their data analysis requirements and drive data-informed decision-making processes. /Senior Solutions Architect\nDatabricks /Snr. Solutions Architect"}
{"session_id": "building-dashboards-production-grade-data-product", "title": "Building Dashboards as a Production-Grade Data Product", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS SQL", "DATABRICKS WORKFLOWS"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["Senior Software Development Engineer, Zillow"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "At Zillow, we have accelerated the volume and quality of our dashboards by leveraging a modern SDLC with version control and CI/CD. In the past three months, we have released 32 production-grade dashboards and shared them securely across the organization while cutting error rates in half over that span. In this session, we will provide an overview of how we utilize Databricks asset bundles and GitLab CI/CD to create performant dashboards that can be confidently used for mission-critical operations. As a concrete example, we'll then explore how Zillow's Data Platform team used this approach to automate our on-call support analysis, leveraging our dashboard development strategy alongside Databricks LLM offerings to create a comprehensive view that provides actionable performance metrics alongside AI-generated insights and action items from the hundreds of requests that make up our support workload. /Senior Software Development Engineer"}
{"session_id": "clickhouse-and-databricks-building-strong-integration-your-lakehouse", "title": "ClickHouse and Databricks: Building a Strong Integration With Your Lakehouse", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["DELTA LAKE", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["Analytics", "ELT", "Real-time"], "speakers": ["Principal Product Manager, ClickHouse"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "ClickHouse is a C++ based, column-oriented database built for real-time analytics. While it has its own internal storage format, the rise of open lakehouse architectures has created a growing need for seamless interoperability. In response, we have developed integrations with your favorite lakehouse ecosystem to enhance compatibility, performance and governance. From integrating with Unity Catalog to embedding the Delta Kernel into ClickHouse, this session will explore the key design considerations behind these integrations, their benefits to the community, the lessons learned and future opportunities for improved compatibility and seamless integration. /Principal Product Manager"}
{"session_id": "deliver-data-where-its-needed-scale-aibi-dashboards-enterprise", "title": "Deliver Data Where It’s Needed: Scale AI/BI Dashboards for Enterprise Reporting", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS SQL"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": [], "speakers": ["Product Manager, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "/Staff Software Engineer\nDatabricks /Product Manager"}
{"session_id": "driving-trusted-insights-aibi-and-unity-catalog-metric-views", "title": "Driving Trusted Insights With AI/BI and Unity Catalog Metric Views", "track": "ANALYTICS AND BI", "level": "BEGINNER", "type": "LIGHTNING TALK", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS SQL", "UNITY CATALOG"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Deliver trusted, high-performance insights by incorporating Unity Catalog metric views and business semantics into your AI/BI workflows. This session dives into the architecture and best practices for defining reusable metrics, implementing governance and enhancing query performance in AI/BI Dashboards and Genie. Learn how to manage business semantics effectively to ensure data consistency while empowering business users with governed, self-service analytics. Ideal for teams looking to streamline analytics at scale, this session provides practical strategies for driving data accuracy and governance. /Sr. Staff Product Manager\nDatabricks /Databricks"}
{"session_id": "easy-ways-optimize-your-databricks-costs", "title": "Easy Ways to Optimize Your Databricks Costs", "track": "ANALYTICS AND BI", "level": "BEGINNER", "type": "BREAKOUT", "industry": "ENERGY AND UTILITIES, ENTERPRISE TECHNOLOGY, FINANCIAL SERVICES", "technologies": ["AI/BI", "DATABRICKS SQL", "DELTA LAKE"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["Senior Resident Solutions Architect, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "In this session, we will explore effective strategies for optimizing costs on the Databricks platform, a leading solution for handling large-scale data workloads. Databricks, known for its open and unified approach, offers several tools and methodologies to ensure users can maximize their return on investment (ROI) while managing expenses efficiently. Key points: By the end of this session, you will have a comprehensive understanding of how to leverage Databricks' built-in tools for cost optimization, ensuring that their data and AI projects not only deliver value but do so in a cost-effective manner. This session is ideal for data engineers, financial analysts, and decision-makers looking to enhance their organization’s efficiency and financial performance through strategic cost management on Databricks. /Solutions Architect\nDatabricks /Senior Resident Solutions Architect"}
{"session_id": "empowering-business-users-databricks-integrating-aibi-genie-microsoft", "title": "Empowering Business Users With Databricks — Integrating AI/BI Genie With Microsoft Teams", "track": "ANALYTICS AND BI", "level": "ADVANCED", "type": "BREAKOUT", "industry": "ENERGY AND UTILITIES, RETAIL AND CPG - FOOD, TRAVEL AND HOSPITALITY", "technologies": ["AI/BI"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Data Engineering", "Real-time"], "speakers": ["Solutions Architect, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "In this session, we'll explore how Rooms To Go enhances organizational collaboration by integrating AI/BI Genie with Microsoft Teams. Genie enables warehouse employees and members of the sales team to interact with data using natural language, simplifying data exploration and analysis. By connecting Genie to Microsoft Teams, we bring real-time data insights directly to a user’s phone. We'll provide a comprehensive overview on setting up this integration as well as a demo of how the team uses it daily. Attendees will gain practical knowledge to implement this integration, empowering their teams to access and interact with data seamlessly within Microsoft Teams. /Manager Data Engineering & Integration\nRooms To Go /Solutions Architect"}
{"session_id": "getting-data-ai-ready-testimonial-good-governance-practices", "title": "Getting Data AI Ready: Testimonial of Good Governance Practices Constructing Accurate Genie Spaces", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENERGY AND UTILITIES", "technologies": ["AI/BI", "DATABRICKS SQL", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Business Intelligence"], "speakers": ["Sr Business Intelligence Mgr, T-Mobile"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Genie Rooms have played an integral role in democratizing important datasets like Cell Tower and Lease Information. However, in order to ensure that this exciting new release from Databricks was configured as optimally as possible from development to deployment, we needed additional scaffolding around governance. In this talk we will describe the four main components we used in conjunction with the Genie Room to build a successful product and will provide generalizable lessons to help others get the most out of this object. At the core are a declarative, metadata approach to creating UC tables deployed on a robust framework. Second, a platform that efficiently crowdsourced targeted feedback from different user groups. Third, a tool that balances the LLM’s creativity with human wisdom. And finally, a platform that enforces our principle of separating Storage from Compute to manage access to the room at a fine-grained level and enables a whole host of interesting use-cases. /Principal Architect, ML Solutions\nT-Mobile /Sr Business Intelligence Mgr"}
{"session_id": "how-feastables-partners-engine-leverage-advanced-data-models-and-ai", "title": "How Feastables Partners With Engine to Leverage Advanced Data Models and AI for Smarter BI", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "RETAIL AND CPG - FOOD", "technologies": ["DATABRICKS SQL", "DATABRICKS WORKFLOWS", "DLT"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Science", "Real-time", "Scala"], "speakers": ["Senior Vice President Strategy and Commercialization, Feastables"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Feastables, founded by YouTube sensation MrBeast, partnered with Engine to build a modern, AI-enabled BI ecosystem that transforms complex, disparate data into actionable insights, driving smarter decision-making across the organization. In this session, learn how Engine, a Built-On Databricks Partner, brought expertise combined with strategic partnerships that enabled Feastables to rapidly stand up a secure, modern data estate to unify complex internal and external data sources into a single, permissioned analytics platform. Feastables unlocked the power of cross-functional collaboration by democratizing data access throughout their enterprise and seamlessly integrating financial, retailer, supply chain, syndicated, merchandising and e-commerce data. Discover how a scalable analytics framework combined with advanced AI models and tools empower teams with Smarter BI across sales, marketing, supply chain, finance and executive leadership to enable real-time decision-making at scale. /SVP of Data Science\nEngine /Senior Vice President Strategy and Commercialization"}
{"session_id": "how-get-most-out-your-bi-tools-databricks", "title": "How to Get the Most Out of Your BI Tools on Databricks", "track": "ANALYTICS AND BI", "level": "BEGINNER", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY, PROFESSIONAL SERVICES", "technologies": ["AI/BI", "DATABRICKS SQL", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Warehouse", "SQL", "Scala"], "speakers": ["DBSQL Product Specialist, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Unlock the full potential of your BI tools with Databricks. This session explores how features like Photon, Databricks SQL, Liquid Clustering, AI/BI Genie and Publish to Power BI enhance performance, scalability and user experience. Learn how Databricks accelerates query performance, optimizes data layouts and integrates seamlessly with BI tools. Gain actionable insights and best practices to improve analytics efficiency, reduce latency and drive better decision-making. Whether migrating from a data warehouse or optimizing an existing setup, this talk provides the strategies to elevate your BI capabilities. /DBSQL Product Specialist"}
{"session_id": "how-we-turned-200-business-users-analysts-aibi-genie", "title": "How We Turned 200+ Business Users Into Analysts With AI/BI Genie", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS SQL"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "SQL"], "speakers": ["Sr. Marketing Analytics Manager, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "AI/BI Genie has transformed self-service analytics for the Databricks Marketing team. This user-friendly conversational AI tool empowers marketers to perform advanced data analysis using natural language — no SQL required. By reducing reliance on data teams, Genie increases productivity and enables faster, data-driven decisions across the organization. But realizing Genie’s full potential takes more than just turning it on. In this session, we’ll share the end-to-end journey of implementing Genie for over 200 marketing users, including lessons learned, best practices and the real business impact of this Databricks-on-Databricks solution. Learn how Genie democratizes data access, enhances insight generation and streamlines decision-making at scale. /Sr. Marketing Analytics Manager"}
{"session_id": "iqvias-analytics-patient-support-services-transforming-scalability", "title": "IQVIA's Analytics for Patient Support Services: Transforming Scalability, Performance and Governance", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES", "technologies": ["AI/BI", "DATABRICKS SQL", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["Analytics", "Data Governance", "Scala"], "speakers": ["Head of Data Practice, Customertimes"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "This presentation will explore the transformation of IQVIA's decade-old patient support platform through the implementation of Databricks Data Intelligence Platform. Facing scalability challenges, performance bottlenecks and rising costs, the existing platform required significant redesign to handle growing data volumes and complex analytics. Key issues included static metrics limiting workflow optimization, fragmented data governance and heightened compliance and security demands. By partnering with Customertimes (a Databricks Partner) and adopting Databricks' centralized, scalable analytics solution with enhanced self-service capabilities, IQVIA achieved improved query performance, cost efficiency and robust governance, ensuring operational effectiveness and regulatory compliance in an increasingly complex environment. /Director, Data and Analytics\nIQVIA /Head of Data Practice"}
{"session_id": "latest-innovations-aibi-dashboards-and-genie", "title": "Latest Innovations in AI/BI Dashboards and Genie", "track": "ANALYTICS AND BI", "level": "BEGINNER", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS SQL"], "duration": "40 MIN", "experience": "IN PERSON, VIRTUAL", "areas_of_interest": ["AI", "Analytics"], "speakers": ["Sr Eng Director, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Discover how the latest innovations in Databricks AI/BI Dashboards and Genie are transforming self-service analytics. This session offers a high-level tour of new capabilities that empower business users to ask questions in natural language, generate insights faster and make smarter decisions. Whether you're a long-time Databricks user or just exploring what's possible with AI/BI, you'll walk away with a clear understanding of how these tools are evolving — and how to leverage them for greater business impact. /Product Management\nDatabricks /Sr Eng Director"}
{"session_id": "measuring-user-adoption-and-kpis-data-products-using-databricks", "title": "Measuring User Adoption and KPIs for Data Products Using Databricks", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES", "technologies": ["DATA MARKETPLACE", "DATABRICKS SQL", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": [], "speakers": ["Director of Product, Kythera Labs"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "In this session, attendees will learn how to leverage Databricks' system tables to measure user adoption and track key performance indicators (KPIs) for data products. The session will focus on how organizations can use system tables to analyze user behavior, assess engagement with data products and identify usage trends that can inform product development. By measuring KPIs such as user retention, frequency of use and data queries, organizations can optimize their data products for better performance and ROI. /Director of Product"}
{"session_id": "optimizing-smart-meter-iiot-data-databricks-scale-interactive", "title": "Optimizing Smart Meter IIoT Data in Databricks for At-Scale Interactive Electrical Load Analytics", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENERGY AND UTILITIES", "technologies": ["AI/BI", "APACHE SPARK", "DATABRICKS SQL"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "ETL"], "speakers": ["Senior Director - Strategic Partnerships, Plotly"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Octave is a Plotly Dash application used daily by about 1,000 Hydro-Québec technicians and engineers to analyze smart meter load and voltage data from 4.5M meters across the province. As adoption grew, Octave’s back end was migrated to Databricks to address increasingly massive scale (>1T data points), governance and security requirements. This talk will summarize how Databricks was optimized to support performant at-scale interactive Dash application experiences while in parallel managing complex back-end ETL processes. The talk will outline optimizations targeted to further optimize query latency and user concurrency, along with plans to increase data update frequency. Non-technology related success factors to be reviewed will include the value of: subject matter expertise, operational autonomy, code quality for long-term maintainability and proactive vendor technical support. /Senior Director - Strategic Partnerships"}
{"session_id": "power-bi-and-databricks-practical-best-practices", "title": "Power BI and Databricks: Practical Best Practices", "track": "ANALYTICS AND BI", "level": "BEGINNER", "type": "BREAKOUT", "industry": "MANUFACTURING, PROFESSIONAL SERVICES, FINANCIAL SERVICES", "technologies": ["AI/BI", "DATABRICKS SQL", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["Sr. Solution Architect, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Power BI has long been the dominant BI tool in the market. In this session, we'll discuss how to get the most out of PowerBI and Databricks, beginning with high-level architecture and moving down into detailed how-to guides for troubleshooting common failure points. At the end, you'll receive a cheat-sheet which summarizes those best practices into an easy-to-reference format. /Sr. Solution Architect"}
{"session_id": "real-time-market-insights-powering-optivers-live-trading-dashboard", "title": "Real-Time Market Insights — Powering Optiver’s Live Trading Dashboard with Databricks Apps and Dash", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "FINANCIAL SERVICES", "technologies": ["APACHE SPARK", "DATABRICKS APPS", "DATABRICKS SQL"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Real-time", "Scala", "Streaming"], "speakers": ["Software Engineer, Optiver"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "In the fast-paced world of trading, real-time insights are critical for making informed decisions. This presentation explores how Optiver, a leading high-frequency trading firm, harnesses Databricks apps to power its live trading dashboards. The technology enables traders to analyze market data, detect patterns and respond instantly. In this talk, we will showcase how our system leverages Databricks’ scalable infrastructures such as Structured Streaming to efficiently handle vast streams of financial data while ensuring low-latency performance. In addition, we will show how the integration of Databricks apps with Dash has empowered traders to rapidly develop and deploy custom dashboards, minimizing dependency on developers. Attendees will gain insights into our architecture, data processing techniques and lessons learned in integrating Databricks apps with Dash in order to drive rapid, data-driven trading decisions. /Software Engineer"}
{"session_id": "retail-genie-no-code-ai-apps-empowering-bi-users-be-self-sufficient", "title": "Retail Genie: No-Code AI Apps for Empowering BI Users to be Self-Sufficient", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "MANUFACTURING, RETAIL AND CPG - FOOD", "technologies": ["AI/BI", "DATABRICKS SQL", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "SQL"], "speakers": ["Solutions Architect, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Explore how Databricks AI/BI Genie revolutionizes retail analytics, empowering business users to become self-reliant data explorers. This session highlights no-code AI apps that create a conversational interface for retail data analysis. Genie spaces harness NLP and generative AI to convert business questions into actionable insights, bypassing complex SQL queries. We'll showcase retail teams effortlessly analyzing sales trends, inventory and customer behavior through Genie's intuitive interface. Witness real-world examples of AI/BI Genie's adaptive learning, enhancing accuracy and relevance over time. Learn how this technology democratizes data access while maintaining governance via Unity Catalog integration. Discover Retail Genie's impact on decision-making, accelerating insights and cultivating a data-driven retail culture. Join us to see the future of accessible, intelligent retail analytics in action. /Sr. Solutions Architect\nDatabricks /Solutions Architect"}
{"session_id": "scaling-aibi-genie-best-practices-curating-and-managing-production", "title": "Scaling AI/BI Genie: Best Practices for Curating and Managing Production Spaces", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS SQL"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["Product Manager, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Unlock Genie's full potential with best practices for curating, deploying and monitoring Genie spaces at scale. This session offers a deep dive into the latest enhancements and provides practical guidance on designing high-quality spaces, streamlining deployment workflows and implementing robust monitoring to ensure accuracy and performance in production. Ideal for teams aiming to scale conversational analytics, you’ll leave with actionable strategies to keep your Genie spaces efficient, reliable and aligned with business outcomes. /Software Engineering Manager\nDatabricks /Product Manager"}
{"session_id": "scaling-trust-bi-how-bolt-manages-thousands-metrics-across-databricks", "title": "Scaling Trust in BI: How Bolt Manages Thousands of Metrics Across Databricks, dbt, and Looker", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENERGY AND UTILITIES, ENTERPRISE TECHNOLOGY, RETAIL AND CPG - FOOD", "technologies": ["AI/BI", "DATABRICKS SQL", "DATABRICKS WORKFLOWS"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["Staff Analytics Engineer, Bolt"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Managing metrics across teams can feel like everyone’s speaking a different language, which often leads to loss of trust in numbers. Based on a real-world use case, we’ll show you how to establish a governed source of truth for metrics that works at scale and builds a solid foundation for AI integration. You’ll explore how Bolt.eu’s data team governs consistent metrics for different data users and leverages Euno’s automations to navigate the overlap between Looker and dbt. We’ll cover best practices for deciding where your metrics belong and how to optimize engineering and maintenance workflows across Databricks, dbt and Looker. For curious analytics engineers, we’ll dive into thinking in dimensions & measures vs. tables & columns and determining when pre-aggregations make sense. The goal is to help you contribute to a self-serve experience with consistent metric definitions, so business teams and AI agents can access the right data at the right time without endless back-and-forth. /Co-Founder & CEO\nEuno /Staff Analytics Engineer"}
{"session_id": "securely-deploying-aibi-all-users-your-enterprise", "title": "Securely Deploying AI/BI to All Users in Your Enterprise", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS SQL"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Scala"], "speakers": ["Staff Product Manager, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Bringing AI/BI to every business user starts with getting security, access and governance right. In this session, we’ll walk through the latest best practices for configuring Databricks accounts, setting up workspaces, and managing authentication protocols to enable secure and scalable onboarding. Whether you're supporting a small team or an entire enterprise, you'll gain practical insights to protect your data while ensuring seamless and governed access to AI/BI tools. /Staff Software Engineer\nDatabricks /Staff Product Manager"}
{"session_id": "shifting-left-setting-your-genai-ecosystem-work-business-analysts", "title": "Shifting Left — Setting up Your GenAI Ecosystem to Work for Business Analysts", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY, PROFESSIONAL SERVICES, FINANCIAL SERVICES", "technologies": ["AI/BI", "MOSAIC AI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Science"], "speakers": ["ML Innovation, Experian"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "At Data and AI in 2022, Databricks pioneered the term to shift left in how AI workloads would enable less data science driven people to create their own apps. In 2025, we take a look at how Experian is doing on that journey. This session highlights Databricks services that assist with the shift left paradigm for Generative AI, including how AI/BI Genie helps with Generative analytics, and how Agent Studio helps with synthetic generation of test cases to validate model performance. /Head of AI/ML Innovation"}
{"session_id": "sponsored-ey-xoople-fueling-enterprise-ai-earth-data-intelligence", "title": "Sponsored by: EY | Xoople: Fueling enterprise AI with Earth data intelligence products", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "ENERGY AND UTILITIES, ENTERPRISE TECHNOLOGY, MANUFACTURING", "technologies": ["AI/BI"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": [], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Xoople aims to provide its users with trusted AI-Ready Earth data and accelerators that unlock new insights for enterprise AI. With access to scientific-grade Earth data that provides spatial intelligence on real-world changes, data scientists and BI analysts can increase forecast accuracy for their enterprise processes and models. These improvements drive smarter, data-driven business decisions across various business functions, including supply chain, finance, and risk across industries. Xoople, which has recently introduced their product, Enterprise AI-Ready Earth Data™, on the Databricks Marketplace, will have their CEO, Fabrizio Pirondini, discuss the importance of the Databricks Data Intelligence Platform in making Xoople’s product a reality for use in the enterprise."}
{"session_id": "sponsored-firebolt-10ms-queries-iceberg-turbocharging-your-lakehouse", "title": "Sponsored by: Firebolt | 10ms Queries on Iceberg: Turbocharging Your Lakehouse for Interactive Experiences with Firebolt", "track": "ANALYTICS AND BI", "level": "ADVANCED", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY, RETAIL AND CPG - FOOD, FINANCIAL SERVICES", "technologies": ["APACHE ICEBERG", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["Analytics", "Delta Lake", "ELT"], "speakers": [], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Open table formats such as Apache Iceberg or Delta Lake have transformed the data landscape. For the first time, we’re seeing a real open storage ecosystem emerging across database vendors. So far, open table formats have found little adoption powering low-latency, high-concurrency analytics use-cases. Data stored in open formats often gets transformed and ingested into closed systems for serving. The reason for this is simple: most modern query engines don’t properly support these workloads. In this talk we take a look under the hood of Firebolt and dive into the work we’re doing to support low-latency and high concurrency on Iceberg: caching of data and metadata, adaptive object storage reads, subresult reuse, and multi-dimensional scaling. After this session, you will know how you can build low-latency data applications on top of Iceberg. You’ll also have a deep understanding of what it takes for modern high-performance query engines to do well on these workloads."}
{"session_id": "sponsored-informatica-power-analytics-and-ai-databricks-master-golden", "title": "Sponsored by: Informatica | Power Analytics and AI on Databricks With Master (Golden) Record Data", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "HEALTH AND LIFE SCIENCES, MANUFACTURING, RETAIL AND CPG - FOOD", "technologies": ["DATABRICKS SQL", "DELTA LAKE", "UNITY CATALOG"], "duration": "", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["low-code interface, allowing data teams to quickly integrate siloed and create a complete consistent record that improves decision-making speed accuracy."], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Supercharge advanced analytics and AI insights on Databricks with accurate and consistent master data. This session explores how Informatica’s Master Data Management (MDM) integrates with Databricks to provide high-quality, integrated golden record data like customer, supplier, product 360 or reference data to support downstream analytics, Generative AI and Agentic AI. Enterprises can accelerate and de-risk the process of creating a golden record via a no-code/low-code interface, allowing data teams to quickly integrate siloed data and create a complete and consistent record that improves decision-making speed and accuracy."}
{"session_id": "sponsored-microsoft-leverage-power-microsoft-ecosystem-azure-databricks", "title": "Sponsored by: Microsoft | Leverage the power of the Microsoft Ecosystem with Azure Databricks", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["DATABRICKS APPS", "DATABRICKS WORKFLOWS"], "duration": "", "experience": "IN PERSON", "areas_of_interest": ["AI", "Data Lake"], "speakers": [], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Join us for this insightful session to learn how you can leverage the power of the Microsoft ecosystem along with Azure Databricks to take your business to the next level. Azure Databricks is a fully integrated, native, first-party solution on Microsoft Azure. Databricks and Microsoft continue to actively collaborate on product development, ensuring tight integration, optimized performance, and a streamlined support experience. Azure Databricks offers seamless integrations with Power BI, Azure Open AI, Microsoft Purview, Azure Data Lake Storage (ADLS) and Foundry. In this session, you’ll learn how you can leverage deep integration between Azure Databricks and the Microsoft solutions to empower your organization to do more with your data estate. You’ll also get an exclusive sneak peek into the product roadmap."}
{"session_id": "sponsored-prophecy-ready-genai-survey-says-governed-self-service-new", "title": "Sponsored by: Prophecy | Ready for GenAI? Survey Says Governed Self-Service Is the New Playbook for Data Teams", "track": "ANALYTICS AND BI", "level": "BEGINNER", "type": "LIGHTNING TALK", "industry": "HEALTH AND LIFE SCIENCES, RETAIL AND CPG - FOOD, FINANCIAL SERVICES", "technologies": ["DATABRICKS SQL", "UNITY CATALOG"], "duration": "", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": [], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Are data teams ready for AI? Prophecy’s exclusive survey, “The Impact of GenAI on Data Teams”, gives the clearest picture yet of GenAI’s potential in data management, and what’s standing in the way. The top two obstacles? Poor governance and slow access to high-quality data. The message is clear: Modernizing your data platform with Databricks is essential. But it’s only the beginning. To unlock the power of AI and analytics, organizations must deliver governed, self-service access to clean, trusted data. Traditional data prep tools introduce risks around security, quality, and cost. It’s no wonder data leaders cited data transformation as the area where GenAI will make the biggest impact. To deliver what’s needed teams need a shift to governed self-service. Data analysts and scientists move fast while staying within IT’s guardrails. Join us to learn more details from the survey and how leading organizations are ahead of the curve, using GenAI to reshape how data gets done."}
{"session_id": "sponsored-prophecy-reinventing-data-prep-age-ai-build-agent-driven", "title": "Sponsored by: Prophecy | Reinventing Data Prep in the Age of AI: Build an Agent-driven Pipeline in 7 Minutes", "track": "ANALYTICS AND BI", "level": "BEGINNER", "type": "LIGHTNING TALK", "industry": "HEALTH AND LIFE SCIENCES, RETAIL AND CPG - FOOD, FINANCIAL SERVICES", "technologies": ["DATABRICKS SQL", "UNITY CATALOG"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Data Pipeline"], "speakers": [], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Still coding data transformations by hand? Struggling with rigid, proprietary data prep tools? AI agents are flipping the script, reshaping data teams and delivering production-ready data preparation. Join this session to see how analysts, data scientists, and data engineers can build powerful, production-ready data pipelines simply by describing their intent in natural language. All in under 7 minutes. No complex UI or coding is required. Select datasets, join tables, apply filters, perform calculations - all just by chatting - and watch the pipeline materialize in real time. Ready to leave slow, traditional data prep behind and be part of the next wave of innovation? You won’t want to miss this session."}
{"session_id": "sponsored-sigma-flogistix-flowco-and-role-data-responsible-energy", "title": "Sponsored by: Sigma | Flogistix by Flowco, and the Role of Data in Responsible Energy Production", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "ENERGY AND UTILITIES, ENTERPRISE TECHNOLOGY", "technologies": ["DATABRICKS SQL", "DELTA LAKE", "UNITY CATALOG"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Architecture", "Real-time"], "speakers": [], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "As global energy demands continue to rise, organizations must boost efficiency while staying environmentally responsible. Flogistix uses Sigma and Databricks to build a unified data architecture for real-time, data-driven decisions in vapor recovery systems. With Sigma on the Databricks Data Intelligence Platform, Flogistix gains precise operational insights and identifies optimization opportunities that reduce emissions, streamline workflows, and meet industry regulations. This empowers everyone, from executives to field mechanics, to drive sustainable resource production. Discover how advanced analytics are transforming energy practices for a more responsible future."}
{"session_id": "sponsored-thoughtspot-beauty-numbers-sephoras-journey-data-delight", "title": "Sponsored by: ThoughtSpot | Beauty by the Numbers: Sephora's Journey from Data to Delight with ThoughtSpot", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "RETAIL AND CPG - FOOD", "technologies": ["AI/BI"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Business Intelligence", "Data Governance", "Machine Learning"], "speakers": [], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "This session explores how Sephora uses data to create impactful \"micro-moments that matter,\"-- personalized, timely reminders that enhance the customer journey. Discover how Sephora is transforming data into actionable insights, moving beyond traditional business intelligence with ThoughtSpot, within a modern data and AI stack that spans cloud platforms, advanced analytics, and machine learning democratization. The session will also cover Sephora's collaborative approach to data governance and the nuances of building high-performing, nimble teams that can adapt to change and drive innovation. Join us to see intelligence in action and understand how Sephora is using data not just to analyze the past, but to shape a more delightful future for its customers."}
{"session_id": "sponsored-thoughtspot-how-chevron-fuels-cloud-data-modernization", "title": "Sponsored by: ThoughtSpot | How Chevron Fuels Cloud Data Modernization", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "ENERGY AND UTILITIES, MANUFACTURING", "technologies": ["AI/BI"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Business Intelligence"], "speakers": [], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Learn how Chevron transitioned their central finance and procurement analytics into the cloud using Databricks and ThoughtSpot’s Agentic Analytics Platform. Explore how Chevron leverages ThoughtSpot to unlock actionable insights, enhance their semantic layer with user-driven understanding, and ultimately drive more impactful strategies for customer engagement and business growth. In this session, Chevron explains the dos, don’ts, and best practices of migrating from outdated legacy business intelligence to real time, AI-powered insights."}
{"session_id": "streamline-your-bi-infrastructure-databricks-aibi-and-save-millions", "title": "Streamline Your BI Infrastructure With Databricks AI/BI and Save Millions on Traditional BI Tools", "track": "ANALYTICS AND BI", "level": "BEGINNER", "type": "LIGHTNING TALK", "industry": "ENTERPRISE TECHNOLOGY, MANUFACTURING, FINANCIAL SERVICES", "technologies": ["AI/BI", "DATABRICKS SQL"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Business Intelligence"], "speakers": ["Business Intelligence Senior Analyst, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Earlier this year, we finished migration of all dashboards from a traditional BI system to Databricks AI/BI ecosystem, resulting in annual savings of approximately $900,000. We also unlocked the below advantages: We will speak about our journey and how you can migrate your dashboards from traditional BI to AI/BI. Having listed the advantages above, we will also speak of some challenges faced. Migration steps: Migration shenanigans: We look forward to sharing these lessons learned and insights with you to help you streamline your BI infrastructure and unlock the full potential of Databricks AI/BI. /Business Intelligence Senior Analyst"}
{"session_id": "supercharge-your-enterprise-bi-practitioners-guide-migrating-aibi", "title": "Supercharge Your Enterprise BI: A Practitioner’s Guide for Migrating to AI/BI", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY, PROFESSIONAL SERVICES", "technologies": ["AI/BI", "DATABRICKS SQL"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["Senior Engineering Manager, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Are you striving to build a data-driven culture while managing costs and reducing reporting latency? Are your BI operations bogged down by complex data movements rather than delivering insights? Databricks IT faced these challenges in 2024 and embarked on an ambitious journey to make Databricks AI/BI our enterprise-wide reporting platform. In just two quarters, we migrated 2,000 dashboards from a traditional BI tool — without disrupting business operations. We’ll share how we executed this large-scale transition cost-effectively, ensuring seamless change management and empowering non-technical users to leverage AI/BI. You’ll gain insights into: Join us to learn how your organization can achieve the same transformation with AI-powered enterprise reporting. /Sr. Director, Data\nDatabricks /Senior Engineering Manager"}
{"session_id": "take-it-limit-art-possible-aibi", "title": "Take it to the Limit: Art of the Possible in AI/BI", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS SQL"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["Staff Software Engineer, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Think you know everything AI/BI can do? Think again. This session explores the art of the possible with Databricks AI/BI Dashboards and Genie, going beyond traditional analytics to unleash the full power of the lakehouse. From incorporating AI into dashboards to handling large-scale data with ease to delivering insights seamlessly to end users — we’ll showcase creative approaches that unlock insights and real business outcomes. Perfect for adventurous data professionals looking to push limits and think outside the box. /Delivery Solution Architect\nDatabricks /Staff Software Engineer"}
{"session_id": "tech-industry-session-optimizing-costs-and-controls-democratize-data", "title": "Tech Industry Session: Optimizing Costs and Controls to Democratize Data and AI", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS APPS", "DATABRICKS SQL"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Scala"], "speakers": ["YipitData"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Join us for this session focused on how leading tech companies are enabling data intelligence across their organizations while maintaining cost efficiency and governance. Hear the successes and the challenges when Databricks empowers thousands of users—from engineers to business teams—by providing scalable tools for AI, BI and analytics. Topics include: Hear from customers and Databricks experts, followed by a customer panel featuring industry leaders. Gain insights into how Databricks helps tech innovators scale their platforms while maintaining operational excellence. /Product Management\nDatabricks /SVP Product and Engineering\nOT Technology, LLC /YipitData"}
{"session_id": "transforming-hps-print-elt-reporting-genit-real-time-insights-tool", "title": "Transforming HP’s Print ELT Reporting with GenIT: Real-Time Insights Tool Powered by Databricks AI", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS SQL", "MOSAIC AI"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "ELT", "Real-time", "SQL"], "speakers": ["Director, Big Data & Strategic Insights, HP"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Timely and actionable insights are critical for staying competitive in today’s fast-paced environment. At HP Print, manual reporting for executive leadership (ELT) has been labor-intensive, hindering agility and productivity. To address this, we developed the Generative Insights Tool (GenIT) using Databricks Genie and Mosaic AI to create a real-time insights engine automating SQL generation, data visualization, and narrative creation. GenIT delivers instant insights, enabling faster decisions, greater productivity, and improved consistency while empowering leaders to respond to printer trends. With automated querying, AI-powered narratives, and a chatbot, GenIT reduces inefficiencies and ensures quality data and insights. Our roadmap integrates multi-modal data, enhances chatbot functionality, and scales globally. This initiative shows how HP Print leverages GenAI to improve decision-making, efficiency, and agility, and we will showcase this transformation at the Databricks AI Summit. /Director, Big Data & Strategic Insights"}
{"session_id": "trillions-data-records-zero-bottlenecks-investor-decision-making", "title": "Trillions of Data Records, Zero Bottlenecks for Investor Decision-Making", "track": "ANALYTICS AND BI", "level": "BEGINNER", "type": "BREAKOUT", "industry": "FINANCIAL SERVICES", "technologies": ["APACHE SPARK", "DATABRICKS SQL", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Real-time", "Scala"], "speakers": ["Head of Data, J Goldman"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "In finance, every second counts. That’s why the Data team at J. Goldman & Co. needed to transform trillions of real-time market data records into a single, actionable insight — instantly, and without waiting on development resources. By modernizing their internal data platform with a scalable architecture, they built a streamlined, web-native alternative data interface that puts live market data directly in the hands of investment teams. With Databricks’ computational power and Unity Catalog’s secure governance, they eliminated bottlenecks and achieved the fastest time-to-market for critical investor decisions possible. Learn how J. Goldman & Co. Innovates with Databricks and Sigma to: /CTO\nJ. Goldman & Co., L.P. /Head of Data"}
{"session_id": "turn-genie-agent-using-conversation-apis", "title": "Turn Genie Into an Agent Using Conversation APIs", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS SQL"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "SQL"], "speakers": ["Software Engineer, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Transform your AI/BI Genie into a text-to-SQL powerhouse using the Genie Conversation APIs. This session explores how Genie functions as an intelligent agent, translating natural language queries into SQL to accelerate insights and enhance self-service analytics. You'll learn practical techniques for configuring agents, optimizing queries and handling errors — ensuring Genie delivers accurate, relevant responses in real time. A must-attend for teams looking to level up their AI/BI capabilities and deliver smarter analytics experiences. /Product Manager\nDatabricks /Software Engineer"}
{"session_id": "unified-advanced-analytics-integrating-power-bi-and-databricks-genie", "title": "Unified Advanced Analytics: Integrating Power BI and Databricks Genie for Real-time Insights", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY, MANUFACTURING, FINANCIAL SERVICES", "technologies": ["AI/BI", "DATABRICKS APPS", "LAKEFLOW"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Science", "Machine Learning"], "speakers": ["Senior Mgr of Analytics & Data Science, TurnPoint Services"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "In today’s data-driven landscape, business users expect seamless, interactive analytics without having to switch between different environments. This presentation explores our web application that unifies a Power BI dashboard with Databricks Genie, allowing users to query and visualize insights from the same dataset within a single, cohesive interface. We will compare two integration strategies: one that leverages a traditional webpage enhanced by an Azure bot to incorporate Genie’s capabilities, and another that utilizes Databricks Apps to deliver a smoother, native experience. We use the Genie API to build this solution. Attendees will learn the architecture behind these solutions, key design considerations and challenges encountered during implementation. Join us to see live demos of both approaches, and discover best practices for delivering an all-in-one, interactive analytics experience. /Associate VP of AI & Machine Learning\nIT Convergence /Senior Mgr of Analytics & Data Science"}
{"session_id": "unifying-gtm-analytics-strategic-shift-native-analytics-and-aibi", "title": "Unifying GTM Analytics: The Strategic Shift to Native Analytics and AI/BI Dashboards at Databricks", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY, MEDIA AND ENTERTAINMENT, FINANCIAL SERVICES", "technologies": ["AI/BI", "LAKEFLOW", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Scala"], "speakers": ["Director, GTM Analytics and Governance, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "The GTM team at Databricks recently launched the GTM Analytics Hub—a native AI/BI platform designed to centralize reporting, streamline insights, and deliver personalized dashboards based on user roles and business needs. Databricks Apps also played a crucial role in this integration by embedding AI/BI Dashboards directly into internal tools and applications, streamlining access to insights without disrupting workflows. This seamless embedding capability allows users to interact with dashboards within their existing platforms, enhancing productivity and collaboration. Furthermore, AI/BI Dashboards leverage Databricks' unified data and governance framework. Join us to learn how we’re using Databricks to build for Databricks—transforming GTM analytics with AI/BI Dashboards, and what it takes to drive scalable, user-centric analytics adoption across the business. /Sr. Manager, GTM Analytics Engineering\nDatabricks /Director, GTM Analytics and Governance"}
{"session_id": "using-databricks-power-news-sentiment-capital-iq-pro-application", "title": "Using Databricks to Power News Sentiment, a Capital IQ Pro Application", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "PROFESSIONAL SERVICES, FINANCIAL SERVICES", "technologies": ["AI/BI", "DATABRICKS WORKFLOWS", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": [], "speakers": ["Data Scientist, S&P Global"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "/Data Scientist"}
{"session_id": "whats-new-and-whats-next-building-impactful-aibi-dashboards", "title": "What's New and What's Next: Building Impactful AI/BI Dashboards", "track": "ANALYTICS AND BI", "level": "BEGINNER", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS SQL"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["Product Manager, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Ready to take your AI/BI dashboards to the next level? This session dives into the latest capabilities in Databricks AI/BI Dashboards and how to maximize impact across your organization. Learn how data authors can tailor visualizations for different audiences, optimize performance and seamlessly integrate with Genie for a unified analytics experience. We’ll also share practical tips on how business users and data teams can better collaborate — ensuring insights are accessible, actionable and aligned to business goals. /Sr. Manager, Engineering\nDatabricks /Product Manager"}
{"session_id": "whats-new-databricks-assistant-exploration-production", "title": "What’s New with Databricks Assistant: From Exploration to Production", "track": "ANALYTICS AND BI", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS SQL"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["SQL"], "speakers": ["Sr. Staff Product Manager, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Databricks Assistant helps you get from initial exploration all the way to production faster and easier than ever. In this session, we'll show you how Assistant simplifies and accelerates common workflows, boosting your productivity across notebooks and the SQL editor. You'll get practical tips, see end-to-end examples in action, and hear about the latest capabilities we're excited about. We'll also discuss how we're continually improving Assistant to make your development experience faster, more contextual and more customizable. Join us to discover how to get the most out of Databricks Assistant and empower your team to build better and faster. /Product Manager\nDatabricks /Sr. Staff Product Manager"}
{"session_id": "you-mean-i-can-talk-my-data-reimagining-how-kpmg-engages-data-using", "title": "You Mean I Can Talk to My Data? Reimagining How KPMG Engages Data Using AI|BI Genie", "track": "ANALYTICS AND BI", "level": "BEGINNER", "type": "LIGHTNING TALK", "industry": "PROFESSIONAL SERVICES, RETAIL AND CPG - FOOD, FINANCIAL SERVICES", "technologies": ["AI/BI", "DLT", "UNITY CATALOG"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI"], "speakers": ["Managing Director, KPMG"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "“I don’t want to spend time filtering through another dashboard — I just need an answer now.” We’ve all experienced the frustration of wading through dashboards, yearning for immediate answers. Traditional reports and visualizations, though essential, often complicate the process for decision-makers. The digital enterprise demands a shift towards conversational, natural language interactions with data. At KPMG, AI|BI Genie is reimagining our approach by allowing users to inquire about data just as they would consult a knowledgeable colleague, obtaining precise and actionable insights instantly. Discover how KPMG’s Contract to Cash team leverages AI|BI Genie to enhance data engagement, drive insights and foster business growth. Join us to see AI|BI Genie in action and learn how you can transform your data interaction paradigm. /Managing Director"}
{"session_id": "your-wish-ai-command-get-grips-databricks-genie", "title": "Your Wish is AI Command — Get to Grips With Databricks Genie", "track": "ANALYTICS AND BI", "level": "BEGINNER", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY, RETAIL AND CPG - FOOD, FINANCIAL SERVICES", "technologies": ["AI/BI", "DATABRICKS SQL"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["Analytics", "SQL"], "speakers": ["CTO, Advancing Analytics"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Picture the scene — you're exploring a deep, dark cave looking for insights to unearth when, in a burst of smoke, Genie appears and offers you not three but unlimited data wishes. This isn't a folk tale, it's the growing wave of Generative BI that is going to be a part of analytics platforms. Databricks Genie is a tool powered by a SQL-writing LLM that redefines how we interact with data. We'll look at the basics of creating a new Genie room, scoping its data tables and asking questions. We'll help it out with some complex pre-defined questions and ensure it has the best chance of success. We'll give the tool a personality, set some behavioural guidelines and prepare some hidden easter eggs for our users to discover. Generative BI is going to be a fundamental part of the analytics toolset used across businesses. If you're using Databricks, you should be aware of Genie, if you're not, you should be planning your Generative BI Roadmap, and this session will answer your wishes. /CTO"}
