{"session_id": "accelerating-growth-capital-markets-data-driven-strategies-success", "title": "Accelerating Growth in Capital Markets: Data-Driven Strategies for Success", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "FINANCIAL SERVICES", "technologies": ["AI/BI", "DATA MARKETPLACE", "DELTA SHARING"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Real-time"], "speakers": ["Software Engineering Manager, B3 - Bolsa, Brasil e Balcão"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Growth in capital markets thrives on innovation, agility and real-time insights. This session highlights how leading firms use Databricks’ Data Intelligence Platform to uncover opportunities, optimize trading strategies and deliver personalized client experiences. Learn how advanced analytics and AI help organizations expand their reach, improve decision-making and unlock new revenue streams. Industry leaders share how unified data platforms break down silos, deepen insights and drive success in a fast-changing market. Key takeaways: Discover how data intelligence empowers capital markets firms to thrive in today’s competitive landscape! /Financial Services Industry Director\nDatabricks /CDO - Wealth Management\nNorthern Trust /Software Engineering Manager"}
{"session_id": "accelerating-innovation-across-life-sciences-value-chain-data-ai", "title": "Accelerating Innovation Across the Life Sciences Value Chain With a Data + AI Foundation", "track": "DATA STRATEGY", "level": "BEGINNER", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES", "technologies": ["DELTA LAKE", "MOSAIC AI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Governance", "Data Quality"], "speakers": ["Industry Marketing Lead, HLS, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Artificial intelligence and robust data strategies are revolutionizing life sciences, delivering measurable value across drug discovery, commercial operations, supply chain, manufacturing and commercialization. Foundational data governance ensures data quality, compliance and interoperability, enabling organizations to extract actionable insights from vast, complex datasets. AI accelerates drug discovery by identifying novel targets and optimizing compounds, while data intelligence and sharing streamline clinical trials, regulatory submissions and market positioning. In manufacturing and supply chain, advanced analytics and AI-driven tools optimize workflows, forecast disruptions and enhance operational efficiency. Together, these capabilities empower life sciences organizations to innovate faster, reduce costs and bring therapies to market more efficiently, driving growth and improving patient outcomes. /Industry Marketing Lead, HLS"}
