{"session_id": "breaking-silos-cignas-journey-seamless-data-sharing-delta-sharing", "title": "Breaking Silos: Cigna’s Journey to Seamless Data Sharing with Delta Sharing", "track": "DATA SHARING AND COLLABORATION", "level": "BEGINNER", "type": "LIGHTNING TALK", "industry": "HEALTH AND LIFE SCIENCES", "technologies": ["APACHE SPARK", "DATABRICKS SQL", "UNITY CATALOG"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["ELT", "Real-time"], "speakers": ["Senior Architect, The Cigna Group"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "As data ecosystems grow increasingly complex, the ability to share data securely, seamlessly, and in real time has become a strategic differentiator. In this session, Cigna will showcase how Delta Sharing on Databricks has enabled them to modernize data delivery, reduce operational overhead, and unlock new market opportunities. Learn how Cigna achieved significant savings by streamlining operations, compute, and platform overhead for just one use case. Explore how decentralizing data ownership—transitioning from hyper-centralized teams to empowered product owners—has simplified delivery and accelerated innovation. Most importantly, see how this modern open data-sharing framework has positioned Cigna to win contracts they previously couldn’t, by enabling real-time, cross-organizational data collaboration with external partners. Join us to hear how Cigna is using Delta Sharing not just as a technical enabler, but as a business catalyst. /Senior Director\nEvernorth Health Services /Senior Architect"}
{"session_id": "breaking-silos-using-sap-delta-sharing-connector-seamless-access", "title": "Breaking Silos: Using the SAP Delta Sharing Connector for Seamless Access in Databricks", "track": "DATA SHARING AND COLLABORATION", "level": "BEGINNER", "type": "BREAKOUT", "industry": "MANUFACTURING, RETAIL AND CPG - FOOD, FINANCIAL SERVICES", "technologies": ["DELTA SHARING"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "ELT", "ETL"], "speakers": ["Product Manager, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "We’re excited to announce the General Availability of the SAP Delta Sharing Connector, enabling SAP Business Data Cloud (BDC) customers to securely and seamlessly share data with Databricks — no complex ETL or data duplication required. This connector enables organizations to securely share SAP data for analytics and AI in Databricks, while also supporting bidirectional data sharing back to SAP. In this session, we’ll walk through a live demo of the SAP Delta Sharing Connector in action, followed by a real-world customer story showcasing how this integration is driving value across analytics and AI use cases. You’ll also leave with practical best practices to help you implement the connector in your own environment. Whether you’re looking to bring SAP data into Databricks for advanced analytics or build AI models on top of trusted SAP datasets, this session will show you how to get started — securely and efficiently. /Staff Product Manager\nDatabricks /Product Manager"}
{"session_id": "cloud-cloud-data-sharing-walmart-direct-access-omni-channel-sales-data", "title": "Cloud-to-Cloud Data Sharing by Walmart: Direct Access to Omni-Channel Sales Data With Delta Sharing", "track": "DATA SHARING AND COLLABORATION", "level": "BEGINNER", "type": "BREAKOUT", "industry": "RETAIL AND CPG - FOOD", "technologies": ["DELTA LAKE"], "duration": "60 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "ELT", "Scala"], "speakers": ["Sr. Director Software Engineering, Walmart Data Ventures"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Walmart Data Ventures is part of Walmart’s first-party data offering. As first-party data grows in importance, Scintilla continues to expand its offerings and seeks to add value to its customers. Scintilla customers can now access Walmart data using Cloud Feeds, based on Databricks Delta Sharing technologies. In the past, Walmart used API-based data sharing models, which required customers to possess certain skills and technical attributes that weren’t always available. Now, with Cloud Feeds, Scintilla customers can more easily access data at much lower effort and without a dedicated technical team behind the scenes making it happen. Attendees will gain valuable insights into how Walmart has built its robust data sharing architecture and strategies to design scalable and collaborative data sharing architectures in their own organizations. /Director, Product Development\nWalmart Data Ventures /Sr. Director Software Engineering"}
{"session_id": "collaborative-innovation-how-spur-innovation-while-driving-efficiency", "title": "Collaborative Innovation: How to Spur Innovation While Driving Efficiency", "track": "DATA SHARING AND COLLABORATION", "level": "BEGINNER", "type": "BREAKOUT", "industry": "FINANCIAL SERVICES", "technologies": ["DELTA SHARING"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["Data Engineering"], "speakers": ["Head of Data Engineering – BI Platform Infrastructure, LV="], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "/Financial Services Industry Director\nDatabricks /Managing Director\nAon /Head of Advanced Engineering\nEverest /Head of Data Engineering – BI Platform Infrastructure"}
{"session_id": "cross-cloud-data-mesh-delta-sharing-and-uniform-mercedes-benz", "title": "Cross-Cloud Data Mesh with Delta Sharing and UniForm in Mercedes-Benz", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "MANUFACTURING", "technologies": ["APACHE ICEBERG", "DELTA LAKE", "DELTA SHARING"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "ELT"], "speakers": ["Lead Architect, Mercedes-Benz Group AG"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "In this presentation, we'll show how we achieved a unified development experience for teams working on Mercedes-Benz Data Platforms in AWS and Azure. We will demonstrate how we implemented Azure to AWS and AWS to Azure data product sharing (using Delta Sharing and Cloud Tokens), integration with AWS Glue Iceberg tables through UniForm and automation to drive everything using Azure DevOps Pipelines and DABs. We will also show how to monitor and track cloud egress costs and how we present a consolidated view of all the data products and relevant cost information. The end goal is to show how customers can offer the same user experience to their engineers and not have to worry about which cloud or region the Data Product lives in. Instead, they can enroll in the data product through self-service and have it available to them in minutes, regardless of where it originates. /Sr. Resident Solutions Architect\nDatabricks /Lead Architect"}
{"session_id": "data-monetization-through-delta-sharing-and-data-clean-rooms", "title": "Data Monetization Through Delta Sharing and Data Clean Rooms", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "ENTERPRISE TECHNOLOGY, MEDIA AND ENTERTAINMENT, RETAIL AND CPG - FOOD", "technologies": ["DATABRICKS SQL", "DELTA SHARING", "UNITY CATALOG"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "ELT", "SQL"], "speakers": ["CEO, Deep Sync"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Deep Sync, a leader in deterministic identity solutions, leverages the Databricks Lakehouse to manage an identity spine containing the most accurate and up-to-date attribute data for over 98% of U.S. households. In partnership with T-Mobile, Deep Sync is building a Data as a Service (DaaS) business on Databricks, enabling the use of consented subscriber data to create hyper-personalized experiences, measure marketing impact and more. This collaboration represents the first time T-Mobile’s consented data will be brought to market. The technical presentation, jointly delivered by Deep Sync and T-Mobile, will showcase the Databricks solutions powering this initiative, including Lakehouse (DBSQL, GenieRooms), Unity Catalog, Delta Sharing and multi-party Data Clean Rooms. The session will focus on Databricks solutions used to enable management, governance, security and collaboration between T-Mobile, Deep Sync and third-party customers. /VP of Data Commercialization\nMetroPCS Communications /CEO"}
{"session_id": "delta-sharing-action-architecture-and-best-practices", "title": "Delta Sharing in Action: Architecture and Best Practices", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES, RETAIL AND CPG - FOOD, FINANCIAL SERVICES", "technologies": ["DELTA SHARING", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "ELT"], "speakers": ["Staff Product Manager, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Delta Sharing is revolutionizing how enterprises share live data and AI assets securely, openly and at scale. As the industry’s first open data-sharing protocol, it empowers organizations to collaborate seamlessly across platforms and with any partner, whether inside or outside the Databricks ecosystem. In this deep-dive session, you’ll learn best practices and real-world use cases that show how Delta Sharing helps accelerate collaboration and fuel AI-driven innovation. We’ll also unveil the latest advancements, including: Whether you’re a data engineer, architect, or data leader, you’ll leave with practical strategies to future-proof your data-sharing architecture. Don’t miss the live demos, expert guidance and an exclusive look at what’s next in data collaboration. /Engineering Manager\nDatabricks /Staff Product Manager"}
{"session_id": "delta-sharing-demystified-options-use-cases-and-how-it-works", "title": "Delta Sharing Demystified: Options, Use Cases and How it Works", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["DELTA SHARING", "UNITY CATALOG"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["ELT"], "speakers": ["Lead consultant & Solutions Architect, Evidi"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Data sharing doesn’t have to be complicated. In this session, we’ll take a practical look at Delta Sharing in Databricks — what it is, how it works and how it fits into your organization’s data ecosystem. The focus will be on giving an overview of the different ways to share data using Databricks, from direct sharing setups to broader distribution via the Databricks Marketplace and more collaborative approaches like Clean Rooms. This talk is meant for anyone curious about modern, secure data sharing — whether you're just getting started or looking to expand your use of Databricks. Attendees will walk away with a clearer picture of what’s possible, what’s required to get started and how to choose the right sharing method for the right scenario. /Lead consultant & Solutions Architect"}
{"session_id": "empowering-data-collaboration-using-delta-sharing", "title": "Empowering Data Collaboration Using Delta Sharing", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "ENTERPRISE TECHNOLOGY, MANUFACTURING", "technologies": ["APACHE SPARK", "DELTA LAKE", "DELTA SHARING"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["Analytics", "ELT"], "speakers": ["Staff Data Engineer, Procore"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "At Procore, we're transforming the construction industry through innovative data solutions. This session unveils how we've supercharged our analytics offerings using a unified lakehouse architecture and Delta Sharing, delivering game-changing results for our customers and our business and how data professionals can unlock the full potential of their data assets and drive meaningful business outcomes. Key highlights: /Staff Data Engineer"}
{"session_id": "enabling-sleep-science-research-databricks-and-delta-sharing", "title": "Enabling Sleep Science Research With Databricks and Delta Sharing", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES, MANUFACTURING, RETAIL AND CPG - FOOD", "technologies": ["DELTA SHARING", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["Data Security", "ELT"], "speakers": ["Sr Director Architecture & Data Platform, Sleep Number"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Leveraging Databricks as a platform, we facilitate the sharing of anonymized datasets across various Databricks workspaces and accounts, spanning multiple cloud environments such as AWS, Azure, and GCP. This capability, powered by Delta Sharing, extends both within and outside Sleep Number, enabling accelerated insights while ensuring compliance with data security and privacy standards. In this session, we will showcase our architecture and implementation strategy for data sharing, highlighting the use of Databricks’ Unity Catalog and Delta Sharing, along with integration with platforms like Jira, Jenkins, and Terraform to streamline project management and system orchestration. /Director, Data Platform\nSleep Number Labs /Sr Director Architecture & Data Platform"}
{"session_id": "factset-collaboration-leading-customer-harnessing-delta-sharing", "title": "FactSet in Collaboration with a Leading Customer: Harnessing Delta Sharing for Accelerated Insights", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "FINANCIAL SERVICES", "technologies": ["DATABRICKS WORKFLOWS", "DELTA SHARING", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["Analytics", "ELT", "ETL"], "speakers": ["VP, Principal Product Manager, Factset"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Integrating external vendor data often means facing fragmented pipelines, costly ETL, and lengthy onboarding cycles. Join us to learn how a customer partnered with FactSet, using Delta Sharing to break through these barriers and significantly elevate their analytics capabilities. Why Attend? We'll explore how your organization can overcome similar challenges and set the stage for future innovation. Discover practical ways to enhance your data capabilities, advance strategic initiatives, and achieve faster insights with seamless integration of FactSet data on Databricks. /VP, Principal Product Manager"}
{"session_id": "how-danone-enhanced-global-data-sharing-delta-sharing", "title": "How Danone Enhanced Global Data Sharing with Delta Sharing", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "MANUFACTURING, RETAIL AND CPG - FOOD", "technologies": ["DELTA SHARING", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "ELT", "Scala"], "speakers": ["Lead Data Engineer, Danone"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Learn how Danone, a global leader in the food industry, improved its data-sharing processes using Delta Sharing, an open protocol developed by Databricks. This session will explore how Danone migrated from a traditional hub-and-spoke model to a more efficient and scalable data-sharing approach that works seamlessly across regions and platforms. We’ll discuss practical concepts such as in-region and cross-region data sharing, fine-grained access control, data discovery, and the implementation of data contracts. You’ll also hear about the strategies Danone uses to deliver governed data efficiently while maintaining compliance with global regulations. Additionally, we’ll discuss a cost comparison between direct data access and replication. Finally, we’ll share insights into the challenges faced by global organizations in managing data sharing at scale and how Danone addressed these issues. Attendees will gain practical knowledge on building a reliable and secure data-sharing framework for international collaboration. /Resident Solution Architect\nDatabricks /Lead Data Engineer"}
{"session_id": "how-data-sharing-transforming-healthcare-real-world-insights", "title": "How Data Sharing is Transforming Healthcare: Real World Insights", "track": "DATA SHARING AND COLLABORATION", "level": "BEGINNER", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES", "technologies": ["DATA MARKETPLACE", "DELTA SHARING"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": [], "speakers": ["Head of Revenue Strategy, Komodo Health, Inc."], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "/Head of Revenue Strategy"}
{"session_id": "how-hp-optimizing-3d-printing-supply-chain-using-delta-sharing", "title": "How HP Is Optimizing the 3D Printing Supply Chain Using Delta Sharing", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "MANUFACTURING", "technologies": ["AI/BI", "DELTA SHARING", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "ELT", "Scala"], "speakers": ["Principal Data Engineer, HP"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "HP’s 3D Print division empowers manufacturers with telemetry data to optimize operations and streamline maintenance. Using Delta Sharing, Unity Catalog and AI/BI dashboards, HP provides a secure, scalable solution for data sharing and analytics. Delta Sharing D2O enables seamless data access, even for customers not on Databricks. Apigee masks private URLs, and Unity Catalog enhances security by managing data assets. Predictive maintenance with Mosaic AI boosts uptime by identifying issues early and alerting support teams. Custom dashboards and sample code let customers run analytics using any supported client, while Apigee simplifies access by abstracting complexity. Insights from A/BI dashboards help HP refines data strategy, aligning solutions with customer needs despite the complexity of diverse technologies, fragmented systems and customer-specific requirements. This fosters trust, drives innovation,and strengthens HP as a trusted partner for scalable, secure data solutions. /Principal Data Engineer"}
{"session_id": "how-mparticle-easyjet-unlock-advanced-personalization-delta-sharing", "title": "How mParticle & EasyJet Unlock Advanced Personalization With Delta Sharing & Databricks Marketplace", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "TRAVEL AND HOSPITALITY", "technologies": ["DATABRICKS SQL", "DELTA SHARING"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Data Architecture", "ELT"], "speakers": ["Head of customer data, easyJet"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "This presentation highlights how EasyJet leverages Delta Sharing to enable secure and frictionless data sharing with mParticle. By utilizing Delta Sharing, EasyJet leverages mParticle’s customer data platform (CDP), available on Databricks Marketplace, without data duplication, enhancing audience segmentation and personalization strategies. The integration empowers EasyJet to streamline its data sharing workflows while maintaining robust governance and compliance, fostering advanced customer personalization and operational efficiency across platforms /Head of Data Architecture\neasyjet /Head of customer data"}
{"session_id": "inscape-smart-tv-data-unlocking-consumption-and-competitive", "title": "Inscape Smart TV Data: Unlocking Consumption and Competitive Intelligence", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "ENTERPRISE TECHNOLOGY, MEDIA AND ENTERTAINMENT", "technologies": ["DATA MARKETPLACE", "DELTA LAKE"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": [], "speakers": ["Director, Vizio Inscape"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "/Director"}
{"session_id": "intuits-privacy-safe-lending-marketplace-leveraging-databricks-clean", "title": "Intuit's Privacy-Safe Lending Marketplace: Leveraging Databricks Clean Rooms", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "FINANCIAL SERVICES", "technologies": ["DELTA SHARING", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["Staff Software Engineer, Intuit Inc."], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Intuit leverages Databricks Clean Rooms to create a secure, privacy-safe lending marketplace, enabling small business lending partners to perform analytics and deploy ML/AI workflows on sensitive data assets. This session explores the technical foundations of building isolated clean rooms across multiple partners and cloud providers, differentiating Databricks Clean Rooms from market alternatives. We'll demonstrate our automated approach to clean room lifecycle management using APIs, covering creation, collaborator onboarding, data asset sharing, workflow orchestration and activity auditing. The integration with Unity Catalog for managing clean room inputs and outputs will also be discussed. Attendees will gain insights into harnessing collaborative ML/AI potential, support various languages and workloads, and enable complex computations without compromising sensitive information in Clean Rooms. /Staff Software Engineer"}
{"session_id": "lets-elevate-open-source-model-data-sharing-and-collaboration-retail", "title": "Let’s Elevate: An Open Source Model for Data Sharing and Collaboration in Retail and Consumer Goods", "track": "DATA SHARING AND COLLABORATION", "level": "BEGINNER", "type": "BREAKOUT", "industry": "RETAIL AND CPG - FOOD", "technologies": ["DATA MARKETPLACE", "DELTA SHARING"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Data Integration"], "speakers": ["Director of Value Acceleration, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Retailers and suppliers face persistent financial and technical challenges to data sharing — including expensive proprietary platforms, complex data integration hurdles, fragmented governance and more — which currently restrict seamless data exchange primarily to their largest trading partners. In this session, we’ll provide an in-depth explanation of Elevate, an industry alliance focused on building open source standards for data sharing and collaboration to drive greater efficiency across the entire ecosystem. This session will highlight proposed standards for data sharing, data models, business cases on the ROI and potential areas of innovation to democratize data sharing, drastically reduce costs, simplify integration processes and foster transparent, trusted collaboration. Learn about the Elevate industry data-sharing initiative and how your company can participate and help guide standards to improve data sharing with your key partners. /Global VP | Consumer Industries GTM\nDatabricks /Director of Value Acceleration"}
{"session_id": "news-insights-unlock-actionable-outcomes-lsegs-machine-readable-news", "title": "From News to Insights: Unlock Actionable Outcomes With LSEG’s Machine Readable News and DeltaSharing", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "FINANCIAL SERVICES", "technologies": ["DELTA SHARING", "MOSAIC AI", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "ELT", "Real-time"], "speakers": ["Director, Data Distribution, LSEG"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "In today’s fast-paced business environment, access to comprehensive, credible, real-time and historical data in one place is essential for effective decision-making and risk management. LSEG’s Machine Readable News (MRN) solution transforms unstructured data into actionable insights, with ultra-low latency delivery and extensive historical news archives powered by AI and natural language processing (NLP). Leveraging Databricks Delta Sharing, businesses can seamlessly integrate this valuable data with their own internal datasets, additional LSEG data and third-party sources. This combination enables clients to optimize workflows, enhance risk models and make smarter, faster decisions across diverse use cases — from event-based trading to risk management. In this session, we’ll explore how Delta Sharing facilitates the integration of diverse, trustworthy data, unlocking new opportunities and driving smarter investment strategies. /Global Head of Cloud Partners\nLSEG /Director, Data Distribution"}
{"session_id": "no-trust-all-value-monetizing-analytics-databricks-clean-rooms", "title": "No-Trust, All Value: Monetizing Analytics With Databricks Clean Rooms", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "PROFESSIONAL SERVICES", "technologies": ["DATABRICKS WORKFLOWS", "DELTA SHARING", "UNITY CATALOG"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "ELT", "Scala"], "speakers": ["CTO, Koantek"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "In a world where data collaboration is essential but trust is scarce, Databricks Clean Rooms delivers a game-changing model: no data shared, all value gained. Discover how data providers can unlock new revenue streams by launching subscription-based analytics and “Built-on-Databricks” services that run on customer data — without exposing raw data or violating compliance. Clean Rooms integrates Unity Catalog’s governance, Delta Sharing’s secure exchange and serverless compute to enable true multi-party collaboration — without moving data. See how privacy-preserving models like fraud detection, clinical analytics and ad measurement become scalable, productizable and monetizable across industries. Walk away with a proven pattern to productize analytics, preserve compliance and turn trustless collaboration into recurring revenue. /CTO"}
{"session_id": "scaling-modern-mdm-databricks-delta-sharing-and-dun-bradstreet", "title": "Scaling Modern MDM With Databricks, Delta Sharing and Dun & Bradstreet", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "FINANCIAL SERVICES", "technologies": ["DATABRICKS SQL", "DELTA SHARING", "UNITY CATALOG"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": ["ELT", "Real-time", "Scala"], "speakers": ["GM, Partnerships & Alliances, Dun & Bradstreet"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Master Data Management (MDM) is the foundation of a successful enterprise data strategy — delivering consistency, accuracy and trust across all systems that depend on reliable data. But how can organizations integrate trusted third-party data to enhance their MDM frameworks? How can they ensure that this master data is securely and efficiently shared across internal platforms and external ecosystems? This session explores how Dun & Bradstreet’s pre-mastered data serves as a single source of truth for customers, suppliers and vendors — reducing duplication and driving alignment across enterprise systems. With Delta Sharing, organizations can natively ingest Dun & Bradstreet data into their Databricks environment and establish a scalable, interoperable MDM framework. Delta Sharing also enables secure, real-time distribution of master data across the enterprise ensuring that every system operates from a consistent and trusted foundation. /GM, Partnerships & Alliances"}
{"session_id": "securing-data-collaboration-deep-dive-security-frameworks-and-use-cases", "title": "Securing Data Collaboration: A Deep Dive Into Security, Frameworks, and Use Cases", "track": "DATA SHARING AND COLLABORATION", "level": "ADVANCED", "type": "DEEP DIVE", "industry": "ENTERPRISE TECHNOLOGY, RETAIL AND CPG - FOOD, FINANCIAL SERVICES", "technologies": ["DATA MARKETPLACE", "DELTA SHARING", "UNITY CATALOG"], "duration": "90 MIN", "experience": "IN PERSON", "areas_of_interest": ["ELT", "Scala"], "speakers": ["Specialist Solutions Architect, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "This session will focus on the security aspects of Databricks Delta Sharing, Databricks Cleanrooms and Databricks Marketplace, providing an exploration of how these solutions enable secure and scalable data collaboration while prioritizing privacy. Highlights: /Work hard, have fun, make money\nDatabricks /Principal Product Specialist\nDatabricks /Specialist Solutions Architect"}
{"session_id": "simplified-delta-sharing-network-security", "title": "Simplified Delta Sharing With Network Security", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES, RETAIL AND CPG - FOOD, FINANCIAL SERVICES", "technologies": ["DELTA SHARING", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "ELT", "Scala"], "speakers": ["Principal Engineer, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Delta Sharing enables cross-domain sharing of data assets for collaboration. A practical concern providers and recipients face in doing so is the need to manually configure network and storage firewalls. This is particularly challenging for large-scale providers and recipients with strict compliance requirements. In this talk, we will describe our solution to fully eliminate these complexities. This enhances user experience, scalability and security, facilitating seamless data collaboration across diverse environments and cloud platforms. /Senior Staff Product Manager\nDatabricks /Principal Engineer"}
{"session_id": "sponsored-aveva-aveva-and-databricks-it-ot-convergence-industrial", "title": "Sponsored by: AVEVA | AVEVA and Databricks IT-OT Convergence for Industrial Intelligence at Scale", "track": "DATA SHARING AND COLLABORATION", "level": "BEGINNER", "type": "BREAKOUT", "industry": "ENERGY AND UTILITIES, HEALTH AND LIFE SCIENCES, MANUFACTURING", "technologies": ["AI/BI", "DELTA LAKE", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Business Intelligence", "Data Science", "ELT", "Scala"], "speakers": [], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Industrial organizations are unlocking new possibilities through the partnership between AVEVA and Databricks. The seamless, no-code, zero-copy solution—powered by Delta Sharing and CONNECT—enables companies to combine IT and OT data effortlessly. By bridging the gap between operational and enterprise data, businesses can harness the power of AI, data science, and business intelligence at an unprecedented scale to drive innovation. In this session, explore real-world applications of this integration, including how industry leaders are using CONNECT and Databricks to boost efficiency, reduce costs, and advance sustainability—all without fragmented point solutions. You’ll also see a live demo of the integration, showcasing how secure, scalable access to trusted industrial data is enabling new levels of industrial intelligence across sectors like mining, manufacturing, power, and oil and gas."}
{"session_id": "sponsored-capgemini-unlocking-business-value-sap-business-data-cloud", "title": "Sponsored by: Capgemini | Unlocking Business Value With SAP Business Data Cloud and Databricks: Real-World Use Cases", "track": "DATA SHARING AND COLLABORATION", "level": "BEGINNER", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI"], "duration": "", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": [], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Discover how SAP Business Data Cloud and Databricks can transform your business by unifying SAP and non-SAP data for advanced analytics and AI. In this session, we’ll highlight Optimizing Cash Flow with AI with integrated diverse data sources and AI algorithms that enable accurate cash flow forecasting to help businesses identify trends, prevent bottlenecks, and improve liquidity. You’ll also learn about the importance of high-quality, well-governed data as the foundation for reliable AI models and actionable reporting. Key Takeaways: • How to integrate and leverage SAP and external data in Databricks • Using AI for predictive analytics and better decision-making • Building a trusted data foundation to drive business performance Leave this session with actionable strategies to optimize your data, enhance efficiency, and unlock new growth opportunities."}
{"session_id": "sponsored-insight-enterprises-unity-catalog-agent-assistant", "title": "Sponsored by: Insight Enterprises | Unity Catalog Agent Assistant", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["AI/BI", "DATABRICKS APPS", "UNITY CATALOG"], "duration": "", "experience": "IN PERSON", "areas_of_interest": ["SQL"], "speakers": [], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Insight will explore a multi-agent system built with LangGraph designed to alleviate the challenges faced by data analysts inundated with requests from business users. This innovative solution empowers users who lack SQL skills to easily access insights from specific Unity Catalog datasets. Discover how the Unity Catalog Agent Assistant streamlines data requests, enhances collaboration, and ultimately drives better decision-making across your organization."}
{"session_id": "tech-industry-session-building-collaborative-ecosystems-openness-and", "title": "Tech Industry Session: Building Collaborative Ecosystems With Openness and Portability", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["DATA MARKETPLACE", "DELTA SHARING", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Scala"], "speakers": ["SVP Platform Engineering, Health Catalyst"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Join us to discover how leading tech companies accelerate growth using open ecosystems and built-on solutions to foster collaboration, accelerate innovation and create scalable data products. This session will explore how organizations use Databricks to securely share data, integrate with partners and enable teams to build impactful applications powered by AI and analytics. Topics include: Hear real-world examples of how open ecosystems empower organizations to widen the aperture on collaboration, driving better business outcomes. Walk away with insights into how open data sharing and built-on solutions can help your teams innovate faster at scale. /CTO\nAddepar /Sr. Director Data Collaboration\nDatabricks /SVP Engineering\nTealium /SVP Platform Engineering"}
{"session_id": "unify-enterprise-data-databricks-zero-copy-data-sharing-sap-salesforce", "title": "Unify Enterprise Data in Databricks With Zero-Copy Data Sharing From SAP & Salesforce Data Cloud", "track": "DATA SHARING AND COLLABORATION", "level": "BEGINNER", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES, RETAIL AND CPG - FOOD, FINANCIAL SERVICES", "technologies": ["DELTA SHARING", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "ELT"], "speakers": ["Director, Product Management, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "How can enterprises securely share their SAP and Salesforce data with Databricks — without the cost and complexity of data duplication or movement? This session explores how Delta Sharing enables zero-copy, secure data access from SAP Business data cloud and Salesforce Data Cloud, making it easier to activate enterprise data for analytics and AI. We’ll walk through two powerful integrations: You’ll also learn implementation best practices to ensure security, governance and efficient workflows — so you can accelerate decision-making while staying compliant. Ideal for data leaders, architects and engineers looking to drive value from enterprise systems in Databricks. /Director, Product Management"}
{"session_id": "unlocking-future-dairy-farming-leveraging-data-marketplaces-lely", "title": "Unlocking the Future of Dairy Farming: Leveraging Data Marketplaces at Lely", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY, MANUFACTURING", "technologies": ["DATA MARKETPLACE", "DELTA SHARING", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "ELT"], "speakers": ["Senior Data Engineer, Lely"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Lely, a Dutch company specializing in dairy farming robotics, helps farmers with advanced solutions for milking, feeding and cleaning. This session explores Lely’s implementation of an Internal Data Marketplace, built around Databricks' Private Exchange Marketplace. The marketplace serves as a central hub for data teams and business users, offering seamless access to data, analytics and dashboards. Powered by Delta Sharing, it enables secure, private listing of data products across business domains, including notebooks, views, models and functions. This session covers the pros and cons of this approach, best practices for setting up a data marketplace and its impact on Lely’s operations. Real-world examples and insights will showcase the potential of integrating data-driven solutions into dairy farming. Join us to discover how data innovation drives the future of dairy farming through Lely’s experience. /Data Platform Engineer\nLely /Senior Data Engineer"}
{"session_id": "unlocking-industrial-intelligence-aveva-and-agnico-eagle", "title": "Unlocking Industrial Intelligence with AVEVA and Agnico Eagle", "track": "DATA SHARING AND COLLABORATION", "level": "BEGINNER", "type": "BREAKOUT", "industry": "MANUFACTURING", "technologies": ["AI/BI", "DELTA SHARING"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Data Quality", "ELT"], "speakers": ["VP, Digital Transformation, Agnico Eagle Mines Limited"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Industrial data is the foundation for operational excellence, but sharing and leveraging this data across systems presents significant challenges. Fragmented approaches create delays in decision-making, increase maintenance costs, and erode trust in data quality. This session explores how the partnership between AVEVA and Databricks addresses these issues through CONNECT, which integrates directly with Databricks via Delta Sharing. By accelerating time to value, eliminating data wrangling, ensuring high data quality, and reducing maintenance costs, this solution drives faster, more confident decision-making and greater user adoption. We will showcase how Agnico Eagle Mines—the world’s third-largest gold producer with 10 mines across Canada, Australia, Mexico, and Finland—is leveraging this capability to overcome data intelligence barriers at scale. With this solution, Agnico Eagle is making insights more accessible and actionable across its entire organization. /SVP, Partners and Commercial Strategy\nAVEVA /VP, Digital Transformation"}
{"session_id": "unlocking-power-retail-media-networks-how-data-changing-retail", "title": "Unlocking the Power of Retail Media Networks: How Data is Changing the Retail Promotions Landscape", "track": "DATA SHARING AND COLLABORATION", "level": "BEGINNER", "type": "BREAKOUT", "industry": "RETAIL AND CPG - FOOD", "technologies": ["AI/BI", "DLT"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Data Architecture", "Real-time"], "speakers": ["Head of Solutions Engineering, Hightouch"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Retail Media Networks (RMNs) are transforming how brands engage and connect with consumers throughout the omnichannel. In this session, Databricks and Hightouch will explore how data-driven advertising is reshaping retail promotions and enabling real-time activation of customer insights. Learn how unified data architectures and composable customer stacks are driving hyper-personalized, high-ROI campaigns. Whether you're a retailer monetizing first-party data or a brand optimizing ad spend, this session offers practical strategies and real-world examples to thrive in the evolving RMN landscape. /Partner Solutions, Consumer Industries\nDatabricks /Head of Solutions Engineering"}
{"session_id": "unlocking-tv-viewership-insights-privacy-compliant-data-sharing-clean", "title": "Unlocking TV Viewership Insights: Privacy-Compliant Data Sharing with Clean Rooms", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY, MEDIA AND ENTERTAINMENT", "technologies": ["DATABRICKS WORKFLOWS", "DELTA SHARING", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "SQL"], "speakers": ["Solution Architect, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Delivering TV viewership data while balancing customer needs and privacy compliance is a complex challenge. After evaluating multiple solutions, FreeWheel, a Comcast company, selected Databricks Clean Rooms for their ability to programmatically enforce k-anonymization constraints and differential privacy, enabling secure and flexible data exploration. Unlike other solutions that require rigid templates and manual approvals, Clean Rooms gives FreeWheel's customers the freedom to run custom SQL queries while automatically excluding non-compliant data. With Clean Rooms, FreeWheel has streamlined workflows, simplified data management and unlocked new opportunities to monetize its data. The solution supports diverse and complex workloads with high performance and security, making it ideal for current needs and adaptable to future use cases Join this session to learn how FreeWheel is leveraging Clean Rooms to revolutionize TV viewership data sharing — enabling secure collaboration, improving efficiency and driving innovation in data monetization. /Software Engineering Manager\nFreeWheel, A Comcast Company /Solution Architect"}
{"session_id": "using-clean-rooms-privacy-centric-data-collaboration", "title": "Using Clean Rooms for Privacy-Centric Data Collaboration", "track": "DATA SHARING AND COLLABORATION", "level": "BEGINNER", "type": "BREAKOUT", "industry": "MEDIA AND ENTERTAINMENT, RETAIL AND CPG - FOOD, FINANCIAL SERVICES", "technologies": ["DELTA SHARING"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics", "Data Privacy", "ELT"], "speakers": ["Staff Software Engineer, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Databricks Clean Rooms make privacy-safe collaboration possible for data, analytics, and AI — across clouds and platforms. Built on Delta Sharing, Clean Rooms enable organizations to securely share and analyze data together in a governed, isolated environment — without ever exposing raw data. In this session, you’ll learn how to get started with Databricks Clean Rooms and unlock advanced use cases including: Whether you're a data scientist, engineer or data leader, this session will equip you to drive high-value collaboration while maintaining full control over data privacy and governance. /Databricks /Staff Software Engineer"}
{"session_id": "welcome-lakehouse-dwh-transformation-ma-data-sharing", "title": "Welcome Lakehouse, from a DWH transformation to a M&A data sharing", "track": "DATA SHARING AND COLLABORATION", "level": "INTERMEDIATE", "type": "LIGHTNING TALK", "industry": "ENERGY AND UTILITIES, ENTERPRISE TECHNOLOGY", "technologies": ["DELTA SHARING"], "duration": "20 MIN", "experience": "IN PERSON", "areas_of_interest": [], "speakers": ["Solution Architect, dxc"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "/Solution Architect"}
{"session_id": "whats-new-data-sharing-and-collaboration-live-demos", "title": "What's New with Data Sharing and Collaboration with Live Demos", "track": "DATA SHARING AND COLLABORATION", "level": "BEGINNER", "type": "BREAKOUT", "industry": "HEALTH AND LIFE SCIENCES, RETAIL AND CPG - FOOD, FINANCIAL SERVICES", "technologies": ["DATA MARKETPLACE", "DELTA SHARING", "UNITY CATALOG"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": [], "speakers": ["Director of Product Marketing, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Databricks continues to redefine how organizations securely and openly collaborate on data. With new innovations like Clean Rooms for multi-party collaboration, Sharing for Lakehouse Federation, cross-platform view sharing and Databricks Apps in the Marketplace, teams can now share and access data more easily, cost-effectively and across platforms — whether or not they’re using Databricks. In this session, we’ll deliver live demos of key capabilities that power this transformation: Join us to see how these tools enable trusted data sharing, accelerate insights and drive innovation across your ecosystem. Bring your questions and walk away with practical ways to put these capabilities into action today. /Director, Engineering\nDatabricks /Director of Product Marketing"}
{"session_id": "whats-new-databricks-marketplace", "title": "What's New With Databricks Marketplace", "track": "DATA SHARING AND COLLABORATION", "level": "BEGINNER", "type": "BREAKOUT", "industry": "ENTERPRISE TECHNOLOGY", "technologies": ["DATA MARKETPLACE"], "duration": "40 MIN", "experience": "IN PERSON", "areas_of_interest": ["AI", "Analytics"], "speakers": ["Director of Product, Apps, Databricks"], "schedule": {"day": "", "room": "", "start_time": "", "end_time": ""}, "description": "Databricks Marketplace is the fastest-growing open marketplace for discovering, sharing, and monetizing data, AI models, notebooks, and applications — empowering organizations to accelerate analytics and AI innovation without vendor lock-in. In this session, we’ll showcase the latest enhancements that make Databricks Marketplace more powerful and accessible than ever. Join us for a live walkthrough of new features and capabilities, including: private exchange, partner connect, provider usage analytics, AI Assistant integration etc. Whether you are a data provider or a data consumer, learn how the latest Databricks Marketplace innovations can help you unlock new value from your data and AI investments. /Product Manager\nDatabricks /Director of Product, Apps"}
