{"id":"D25B1150","title":"AI and Genie: Analyzing Healthcare Improvement Opportunities","description":"<p>Improving healthcare impacts us all.<\/p><p> <\/p><p>We highlight how Premier Inc. took risk-adjusted patient data from more than 1,300 member hospitals across America, applying a natural language interface using AI\/BI Genie, allowing our users to discover new insights. The stakes are high, new insights surfaced represent potential care improvement and lives positively impacted. Using Genie and our AI-ready data in Unity Catalog, our team was able to stand up a Genie instance in three short days, bypassing costs and time of custom modeling and application development. Additionally, Genie allowed our internal teams to generate complex SQL, as much as 10 times faster than writing it by hand. As Genie and lakehouse apps continue to advance rapidly, we are excited to leverage these features by introducing Genie to as many as 20,000 users across hundreds of hospitals. This will support our members’ ongoing mission to enhance the care they provide to the communities they serve.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology, Health and Life Sciences"],"category":["AI\/BI, Databricks SQL, Unity Catalog"],"areas_of_interest":["Data Applications, Data Science, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Tim Riddle","company":"Premier Inc","job_title":"Senior Director, Analytics","bio":"Product executive and data scientist driving change through successful products, innovation, and the strategic use of data. I bring a unique combination of product management skills, deep technical and analytics expertise, and an ability to lead organizational change. I’ve guided the launch of more than a dozen analytics solutions, delivered hundreds of client projects to completion, mentored or managed more than one hundred analytics professionals.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Tim_RiddlePhoto_1746136374658001BOPI.jpg?h=55541bb6&itok=bKlg-jux","alt":"Tim Riddle"}},{"name":"Jay Sharma","company":"Premier Inc","job_title":"Software Architect","bio":"Jay Sharma is a Software Architect at Premier Inc. with over 18 years of experience in data analysis, visualization, and software development. He has developed analytics tools to help hospitals identify trends in patient care, such as Sepsis. <br \/>\n<br \/>\nJay has also worked with the Department of Health and Human Services to analyze data on various demographics and substance use, providing insights into women's health.<br \/>\n<br \/>\nJay holds a Bachelor's degree in Electronics from Shivaji University, India, and a Master's degree in Data Science from Eastern University, PA. <br \/>\n<br \/>\nHe is passionate about transforming healthcare through data analytics. Outside of work, Jay enjoys family time, barbequing, and golf.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/JaySharma_Headshot_1735857753550001A4Hs.jpg?h=a7e6d17b&itok=SWaYNJGC","alt":"Jay Sharma"}}],"day":"Tuesday","room":"South, Esplanade, Room 157","starts":"2025-06-10T16:10:00","ends":"2025-06-10T16:50:00","starts_pst":"2025-06-10T09:10:00","ends_pst":"2025-06-10T09:50:00","start_time":"4:10 pm","end_time":"4:50 pm","pst_start_time":"9:10 am","pst_end_time":"9:50 am","duration":"40","path":"\/session\/ai-and-genie-analyzing-healthcare-improvement-opportunities","alias":"\/data-ai-summit-2025\/session\/ai-and-genie-analyzing-healthcare-improvement-opportunities","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533727+00:00"}
{"id":"D25L3127DBX","title":"AI-Assisted BI: Everything You Need to Know","description":"<p>Explore how AI is transforming business intelligence and data analytics across the Databricks Platform. This session provides a comprehensive overview of AI-assisted capabilities — from auto-generating dashboards and visualizations to enabling conversational analytics with Genie. We’ll also cover AI-powered notebooks and SQL editors that accelerate code generation, streamline exploratory analysis and simplify workflows. Whether you’re a data engineer, analyst or BI developer, you’ll walk away ready to harness AI to drive faster, smarter decisions across your organization.<\/p>","track":"Analytics and BI","level":"Beginner","type":"Lightning Talk","industry":["Enterprise Technology"],"category":["AI\/BI, Databricks SQL"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Alexander Lichen","company":"Databricks","job_title":"Sr. Product Manager","bio":null,"image":{}},{"name":"Chung Wu","company":"Databricks","job_title":null,"bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/ai-assisted-bi-everything-you-need-know","alias":"\/data-ai-summit-2025\/session\/ai-assisted-bi-everything-you-need-know","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533741+00:00"}
{"id":"D25B3101","title":"AI-Powered Profits: Smarter Order and Inventory Management","description":"Join us for a powerful session on transforming supply chain and inventory management through AI-driven solutions. Xylem shares their successful journey from fragmented legacy systems to a unified Enterprise Data Platform, demonstrating how they integrated complex ERP data across four business segments to achieve breakthrough improvements in parts management and operational efficiency. Following Xylem's story, Databricks experts will showcase innovative solutions for optimizing supply chain operations and navigating tariff challenges, providing attendees with actionable strategies for their own digital transformation. This combined session offers both real-world implementation insights and hands-on solutions for organizations looking to enhance their supply chain intelligence and profitability.","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Manufacturing"],"category":["AI\/BI, Delta Sharing"],"areas_of_interest":["Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"David Rogers","company":"Databricks","job_title":"Solutions Architect","bio":"David is responsible for Databricks’ technical solutions within the manufacturing, transportation, and energy sectors ensuring value realization through the use of the Databricks Data Intelligence Platform. David has a distinguished track record of designing and delivering innovative data and AI solutions within industrial enterprises through roles at Booz Allen Hamilton, Sight Machine, and Boeing. He is a leading voice in emerging industrial technologies across production and supply chains, speaking at several major conferences.<br \/>\n<br \/>\nDavid holds a Master’s in Systems Engineering from the University of Virginia, and a Bachelor’s in Computer Engineering from Michigan State University.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/35638569880_67334199d9_o_1744391466343001z3iW.jpg?h=7f0f3dd7&itok=oUPN7apq","alt":"David Rogers"}},{"name":"Alaina Reasonover","company":"Xylem","job_title":"VP, Data and Enterprise Digital","bio":"Alaina is the Vice President of Data and Digital at Xylem.  She has extensive experience IT leadership, specifically in developing and driving data and digital strategies and roadmaps.   She has a passion for delivering data and digital solutions to drive business value.  She is a graduate of Texas A&M University and currently resides in Tampa, Florida.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/ai-powered-profits-smarter-order-and-inventory-management","alias":"\/data-ai-summit-2025\/session\/ai-powered-profits-smarter-order-and-inventory-management","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533756+00:00"}
{"id":"D25B1255","title":"AI\/BI Dashboards and AI\/BI Genie: Dashboards and Last-Mile Analytics Made Simple","description":"<p>Databricks announced two new features in 2024: AI\/BI Dashboards and AI\/BI Genie. Dashboards is a redesigned dashboarding experience for your regular reporting needs, while Genie provides a natural language experience for your last-mile analytics. In this session, Databricks Solutions Architect and content creator Youssef Mrini will present alongside Databricks MVP and content creator Josue A. Bogran on how you can get the most value from these tools for your organization. <\/p><p> <\/p><p>Content covered includes:<\/p><ul>\t<li>Setup necessary, including Unity Catalog, permissions and compute<\/li>\t<li>Building out a dashboard with AI\/BI Dashboards<\/li>\t<li>Creating and training an AI\/BI Genie workspace to reliably deliver answers<\/li>\t<li>When to use Dashboards, Genie, and when to use other tools such as PBI, Tableau, Sigma, ChatGPT, etc.<\/li><\/ul><p> <\/p><p>Fluff-free, full of practical tips, and geared to help you deliver immediate impact with these new Databricks capabilities.<\/p>","track":"Analytics and BI","level":"Beginner","type":"Breakout","industry":["Health and Life Sciences, Professional Services, Retail and CPG - Food"],"category":["AI\/BI, Databricks SQL, Unity Catalog"],"areas_of_interest":["Data Intelligence, Generative AI (LLMs), Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Youssef Mrini","company":"Databricks","job_title":"Solutions Architect","bio":"Youssef Mrini is part of the pre-sales team in the EMEA Region at Databricks and helps customers to adopt the databricks technologies. Youssef is an ex-data engineer. He holds a degree in big Data and have been working on various areas for the last couple of years","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/1718289391991_1743752881415001nBgn.png?h=fbf7a813&itok=M-CaXQ5a","alt":"Youssef Mrini"}},{"name":"Josue Bogran","company":"JosueBogran.com & zeb.co","job_title":"VP of Data + AI Architecture","bio":"Tech is worthless without positive, impactful business outcomes.<br \/>\n<br \/>\nI’ve worked in finance, supply chain, and healthcare. In every scenario, technology only mattered when it delivered real business outcomes.<br \/>\n<br \/>\nToday, I reverse-engineer business goals into the right technology to reach them, even if that means using Excel. I do this in a few ways:<br \/>\n1. Publishing no-fluff content on data platforms, architecture, and occasionally, satire.<br \/>\n2. Leading Data + AI Architecture as VP at zeb.co, an outcome-driven consulting firm working across Databricks, AWS, and beyond.<br \/>\n3. Advising Sigma and Lumel on building products that drive real business value.<br \/>\n<br \/>\nLike my approach to business & tech? Follow along:<br \/>\n1) in\/JosueBogran<br \/>\n1) YouTube.com\/@JosueBogranChannel","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Josue%2520PNG_1746118826759001Eqcs.png?h=fbf7a813&itok=WJ5hvVV7","alt":"Josue Bogran"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/aibi-dashboards-and-aibi-genie-dashboards-and-last-mile-analytics-made","alias":"\/data-ai-summit-2025\/session\/aibi-dashboards-and-aibi-genie-dashboards-and-last-mile-analytics-made","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533762+00:00"}
{"id":"D25B2356","title":"AI\/BI Driving Speed to Value in Supply Chain","description":"<p>Conagra is a global food manufacturer with $12.2B in revenue, 18K+ employees, 45+ plants in US, Canada and Mexico. Conagra's Supply Chain organization is heavily focused on delivering results in productivity, waste reduction, inventory rationalization, safety and customer service levels. By migrating the Supply Chain reporting suite to Databricks over the past 2 years, Conagra's Supply Chain Analytics & Data Science team has been able to deliver new AI solutions which complement traditional BI platforms and lay the foundation for additional AI\/ML applications in the future.<\/p><p> <\/p><p>With Databricks Genie integrated within traditional BI reports, Conagra Supply Chain users can now go from insight to action faster and with fewer clicks, enabling speed to value in a complex Supply Chain. The Databricks platform also allows the team to curate data products to be consumed by traditional BI applications today as well as the ability to rapidly scale for the AI\/ML applications of tomorrow.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Retail and CPG - Food"],"category":["AI\/BI, Databricks Workflows, Unity Catalog"],"areas_of_interest":["Data Intelligence, Developer Experience, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Heather Cooley","company":"Conagra Brands","job_title":"Head of SC Adv Analytics & Data Science","bio":"Heather Cooley is a distinguished expert in digital strategy, product management and analytics with over two decades of experience spanning sixteen different industries. Throughout her career, Heather has contributed to numerous high-impact digital transformation initiatives.  She started her journey at PWC and later co-founded multiple analytics consulting firms.  Currently, she is the Head of Supply Chain Advanced Analytics and Data Science at Conagra Brands, overseeing digital enablement capabilities.  Heather advocates for inclusive behaviors and serves as a mentor through the Executives’ Club of Chicago.   She holds a BS in Management Information Systems from the University of Illinois at Urbana-Champaign and resides in Chicago.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Heather_Cooley_1744059361147001RHZW.png?h=a7e6d17b&itok=oE-QavfX","alt":"Heather Cooley"}},{"name":"Adrian McClure","company":"Conagra Brands","job_title":"Data Science Manager","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/aibi-driving-speed-value-supply-chain","alias":"\/data-ai-summit-2025\/session\/aibi-driving-speed-value-supply-chain","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533765+00:00"}
{"id":"D25B3124DBX","title":"AI\/BI Genie: A Look Under the Hood of Everyone's Friendly, Neighborhood GenAI Product","description":"<p>Go beyond the user interface and explore the cutting-edge technology driving AI\/BI Genie. This session breaks down the AI\/BI Genie architecture, showcasing how LLMs, retrieval-augmented generation (RAG) and finely tuned knowledge bases work together to deliver fast, accurate responses. We’ll also explore how AI agents orchestrate workflows, optimize query performance and continuously refine their understanding. Ideal for those who want to geek out about the tech stack behind Genie, this session offers a rare look at the magic under the hood.<\/p>","track":"Analytics and BI","level":"Advanced","type":"Breakout","industry":["Enterprise Technology"],"category":["AI\/BI, Databricks SQL"],"areas_of_interest":["Databricks Experience (DBX), Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Alnur Ali","company":"Databricks","job_title":"Software Engineer","bio":null,"image":{}},{"name":"Amir Hormati","company":"databricks","job_title":"swe","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/aibi-genie-look-under-hood-everyones-friendly-neighborhood-genai","alias":"\/data-ai-summit-2025\/session\/aibi-genie-look-under-hood-everyones-friendly-neighborhood-genai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533775+00:00"}
{"id":"D25L2507","title":"Analyst Roadmap to Databricks: From SQL to End-to-End BI","description":"<p>Analysts often begin their Databricks journey by running familiar SQL queries in the SQL Editor, but that’s just the start. In this session, I’ll share the roadmap I followed to expand beyond ad-hoc querying into SQL Editor\/notebook-driven development to scheduled data pipelines producing interactive dashboards — all powered by Databricks SQL and Unity Catalog. You’ll learn how to organize tables with primary-key\/foreign-key relationships along with creating table and column comments to form the semantic model, utilizing DBSQL features like RELY constraints. I’ll also show how parameterized dashboards can be set up to empower self-service analytics and feed into Genie Spaces. Attendees will walk away with best practices for starting out with building a robust BI platform on Databricks, including tips for table design and metadata enrichment. Whether you’re a data analyst or BI developer, this talk will help you unlock powerful, AI-enhanced analytics workflows.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Lightning Talk","industry":["Retail and CPG - Food"],"category":["AI\/BI, Databricks SQL, Unity Catalog"],"areas_of_interest":["Customer Data Platform, Data Intelligence, SQL"],"delivery":["In Person"],"speakers":[{"name":"Jake Duckers","company":"Spencer Gifts","job_title":"Senior Business Analyst","bio":"Senior Business Analyst, Spencer Gifts | Databricks MVP<br \/>\n<br \/>\nAs a certified Databricks Professional ML Engineer and Data Analyst, I design and deploy end‑to‑end analytical pipelines that power AI\/BI dashboards. Over the past year, I’ve built solutions that deliver new granular insights and speed up decision‑making across the organization. In my session, I’ll share practical tips, best practices, and real‑world takeaways from working with Databricks at Spencer Gifts.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/DAIS%2520headshot_1745081215212001pIpY.PNG?h=794c6362&itok=ritOoEue","alt":"Jake Duckers"}}],"day":"Tuesday","room":"Theater 6","starts":"2025-06-10T19:20:00","ends":"2025-06-10T19:40:00","starts_pst":"2025-06-10T12:20:00","ends_pst":"2025-06-10T12:40:00","start_time":"7:20 pm","end_time":"7:40 pm","pst_start_time":"12:20 pm","pst_end_time":"12:40 pm","duration":"20","path":"\/session\/analyst-roadmap-databricks-sql-end-end-bi","alias":"\/data-ai-summit-2025\/session\/analyst-roadmap-databricks-sql-end-end-bi","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533782+00:00"}
{"id":"D25B2832","title":"Bridging BI Tools: Deep Dive Into AI\/BI Dashboards for Power BI Practitioners","description":"<p>In the rapidly-evolving field of data analytics, (AI\/BI) dashboards and Power BI stand out as two formidable approaches, each offering unique strengths and catering to specific use cases. Power BI has earned its reputation for delivering user-friendly, highly customisable visualisations and reports for data analysis. On the other hand, AI\/BI dashboards have gained good traction due to their seamless integration with the Databricks platform, making them an attractive option for data practitioners.<\/p><p> <\/p><p>This session will provide a comparison of these two tools, highlighting their respective features, strengths and potential limitations. Understanding the nuances between these tools is crucial for organizations aiming to make informed decisions about their data analytics strategy. This session will equip participants with the knowledge needed to select the most appropriate tool or combination of tools to meet their data analysis requirements and drive data-informed decision-making processes.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Health and Life Sciences, Retail and CPG - Food"],"category":["AI\/BI, Databricks SQL, Unity Catalog"],"areas_of_interest":["Data Intelligence, SQL, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Wasim Ahmad","company":"Databricks","job_title":"Senior Solutions Architect","bio":null,"image":{}},{"name":"Marius-Cristian Panga","company":"Databricks","job_title":"Snr. Solutions Architect","bio":"Solutions Architect at Databricks with considerable experience in business intelligence, data warehousing, and data engineering. Deeply committed to exploring the potential of data and technology to tackle real-world issues.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/bridging-bi-tools-deep-dive-aibi-dashboards-power-bi-practitioners","alias":"\/data-ai-summit-2025\/session\/bridging-bi-tools-deep-dive-aibi-dashboards-power-bi-practitioners","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533863+00:00"}
{"id":"D25B2572","title":"Building Dashboards as a Production-Grade Data Product","description":"<p>At Zillow, we have accelerated the volume and quality of our dashboards by leveraging a modern SDLC with version control and CI\/CD. In the past three months, we have released 32 production-grade dashboards and shared them securely across the organization while cutting error rates in half over that span. In this session, we will provide an overview of how we utilize Databricks asset bundles and GitLab CI\/CD to create performant dashboards that can be confidently used for mission-critical operations. As a concrete example, we'll then explore how Zillow's Data Platform team used this approach to automate our on-call support analysis, leveraging our dashboard development strategy alongside Databricks LLM offerings to create a comprehensive view that provides actionable performance metrics alongside AI-generated insights and action items from the hundreds of requests that make up our support workload.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["AI\/BI, Databricks SQL, Databricks Workflows"],"areas_of_interest":["Collaboration, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Caleb Priester","company":"Zillow","job_title":"Senior Software Development Engineer","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/building-dashboards-production-grade-data-product","alias":"\/data-ai-summit-2025\/session\/building-dashboards-production-grade-data-product","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533904+00:00"}
{"id":"D25B1734","title":"Caring for Our Data: How Chick-fil-A Enables Data-Driven Decision Making with Databricks","description":"<p>Chick-fil-A’s adoption of Databricks has been rewarding, providing us with a modern, scalable, efficient data platform that meets our evolving needs. With lakehouse, Chick-fil-A can unlock new insights, drive business success and continue “Winning Hearts Every Day.” Our top priority is ensuring our customers have an exceptional experience. We have unrivaled discipline in store operations and guest interaction, but our data systems were lagging. Owner\/operators were spending too much time sitting in front of screens getting data to manage their stores. That data was often slow and untrusted. This is why we’re enabling AI that enables them to ask questions to get accurate responses, allowing them to spend more time in store working with team members\/delighting customers. Databricks also provided BI performance improvement that has addressed major challenges to store operators, helping them to make better decisions with sales forecasting, labor optimizations and inventory management.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Retail and CPG - Food"],"category":["Apache Spark, AI\/BI, Databricks SQL"],"areas_of_interest":["Data Intelligence, SQL, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Aaron Reese","company":"Chick-fil-A, Inc","job_title":"Enterprise Architect","bio":null,"image":{}},{"name":"Elizabeth Williams","company":"Chick-fil-A","job_title":"Data architect","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/caring-our-data-how-chick-fil-enables-data-driven-decision-making","alias":"\/data-ai-summit-2025\/session\/caring-our-data-how-chick-fil-enables-data-driven-decision-making","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533951+00:00"}
{"id":"D25B3069","title":"ClickHouse and Databricks: Building a Strong Integration With Your Lakehouse","description":"<p>ClickHouse is a C++ based, column-oriented database built for real-time analytics. While it has its own internal storage format, the rise of open lakehouse architectures has created a growing need for seamless interoperability. In response, we have developed integrations with your favorite lakehouse ecosystem to enhance compatibility, performance and governance.<\/p><p> <\/p><p>From integrating with Unity Catalog to embedding the Delta Kernel into ClickHouse, this session will explore the key design considerations behind these integrations, their benefits to the community, the lessons learned and future opportunities for improved compatibility and seamless integration.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["Delta Lake, Unity Catalog"],"areas_of_interest":["Data Intelligence, Open Source"],"delivery":["In Person"],"speakers":[{"name":"Melvyn Peignon","company":"ClickHouse","job_title":"Principal Product Manager","bio":"Melvyn Peignon is a Principal Product Manager at ClickHouse, driving the development of its core database. With years of experience in analytics databases, distributed systems, and information retrieval, he shapes the roadmap for integrating ClickHouse with technologies like Delta Lake and Databricks to enhance real-time and near-real-time analytics","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/image1_1743133911606001ivba.jpg?h=9f900053&itok=ZYQdm80v","alt":"Melvyn Peignon"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"60","path":"\/session\/clickhouse-and-databricks-building-strong-integration-your-lakehouse","alias":"\/data-ai-summit-2025\/session\/clickhouse-and-databricks-building-strong-integration-your-lakehouse","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533960+00:00"}
{"id":"D25B3129DBX","title":"Deliver Data Where It’s Needed: Scale AI\/BI Dashboards for Enterprise Reporting","description":"Get the most out of your AI\/BI Dashboards by scaling them across your entire organization. This session covers best practices for automating report distribution, embedding dashboards in external applications, and ensuring secure access across all surfaces. You'll walk away with practical strategies for delivering insights to the right people at the right time—empowering decision-makers at every level with the data they need to drive impactful outcomes.","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["AI\/BI, Databricks SQL"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Patrick Yang","company":"Databricks","job_title":"Staff Software Engineer","bio":"Computer Whisperer at Databricks, working on all things Databricks SQL","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/headshot%2520%25281%2529_1745527488963001nmGe.png?h=7b90b2bc&itok=Pbq73Mqb","alt":"Patrick Yang"}},{"name":"Eason Gao","company":"Databricks","job_title":"Product Manager","bio":"Eason is a Product Manager at Databricks who loves turning complex data into easy-to-understand and interactive dashboard. He's passionate about making data make sense for everyone. When he's not at work, you can find him up early watching Formula 1 races or standing in line at the best ramen shop in town.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/deliver-data-where-its-needed-scale-aibi-dashboards-enterprise","alias":"\/data-ai-summit-2025\/session\/deliver-data-where-its-needed-scale-aibi-dashboards-enterprise","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534122+00:00"}
{"id":"D25L3125DBX","title":"Driving Trusted Insights With AI\/BI and Unity Catalog Metric Views","description":"<p>Deliver trusted, high-performance insights by incorporating Unity Catalog metric views and business semantics into your AI\/BI workflows. This session dives into the architecture and best practices for defining reusable metrics, implementing governance and enhancing query performance in AI\/BI Dashboards and Genie. Learn how to manage business semantics effectively to ensure data consistency while empowering business users with governed, self-service analytics. Ideal for teams looking to streamline analytics at scale, this session provides practical strategies for driving data accuracy and governance.<\/p>","track":"Analytics and BI","level":"Beginner","type":"Lightning Talk","industry":["Enterprise Technology"],"category":["AI\/BI, Databricks SQL, Unity Catalog"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Fuat Can Efeoglu","company":"Databricks","job_title":"Sr. Staff Product Manager","bio":null,"image":{}},{"name":"Justin Talbot","company":"Databricks","job_title":null,"bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/driving-trusted-insights-aibi-and-unity-catalog-metric-views","alias":"\/data-ai-summit-2025\/session\/driving-trusted-insights-aibi-and-unity-catalog-metric-views","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534198+00:00"}
{"id":"D25B1718","title":"Easy Ways to Optimize Your Databricks Costs","description":"<p>In this session, we will explore effective strategies for optimizing costs on the Databricks platform, a leading solution for handling large-scale data workloads. Databricks, known for its open and unified approach, offers several tools and methodologies to ensure users can maximize their return on investment (ROI) while managing expenses efficiently.<\/p><p> <\/p><p>Key points:<\/p><ul>\t<li>Understanding usage with AI\/BI tools<\/li>\t<li>Organizing costs with tagging<\/li>\t<li>Setting up budgets<\/li>\t<li>Leveraging System Tables<\/li><\/ul><p> <\/p><p>By the end of this session, you will have a comprehensive understanding of how to leverage Databricks' built-in tools for cost optimization, ensuring that their data and AI projects not only deliver value but do so in a cost-effective manner. This session is ideal for data engineers, financial analysts, and decision-makers looking to enhance their organization’s efficiency and financial performance through strategic cost management on Databricks.<\/p>","track":"Analytics and BI","level":"Beginner","type":"Breakout","industry":["Energy and Utilities, Enterprise Technology, Financial Services"],"category":["Delta Lake, AI\/BI, Databricks SQL"],"areas_of_interest":["Catalogs, Data Intelligence, Getting started with Databricks"],"delivery":["In Person"],"speakers":[{"name":"Youssef Mrini","company":"Databricks","job_title":"Solutions Architect","bio":"Youssef Mrini is part of the pre-sales team in the EMEA Region at Databricks and helps customers to adopt the databricks technologies. Youssef is an ex-data engineer. He holds a degree in big Data and have been working on various areas for the last couple of years","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/1718289391991_1743752881415001nBgn.png?h=fbf7a813&itok=M-CaXQ5a","alt":"Youssef Mrini"}},{"name":"Yassine Essawabi","company":"Databricks","job_title":"Senior Resident Solutions Architect","bio":"Yassine is a Specialist Solutions Architect at Databricks, where he helps customers to be successful in designing, building and deploying their Data and AI use cases in production at scale for on-premise and cloud deployments using different technologies. His engagements with customers covers various domains including Machine learning, Automation, Data engineering and Architecture review. He is a certified Solutions Architect on Azure and AWS.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/1570742367357_1745038834820001G3Sv.png?h=fbf7a813&itok=88kOp_ND","alt":"Yassine Essawabi"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/easy-ways-optimize-your-databricks-costs","alias":"\/data-ai-summit-2025\/session\/easy-ways-optimize-your-databricks-costs","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534208+00:00"}
{"id":"D25B1232","title":"Empowering Business Users With Databricks — Integrating AI\/BI Genie With Microsoft Teams","description":"<p>In this session, we'll explore how Rooms To Go enhances organizational collaboration by integrating AI\/BI Genie with Microsoft Teams. Genie enables warehouse employees and members of the sales team to interact with data using natural language, simplifying data exploration and analysis. By connecting Genie to Microsoft Teams, we bring real-time data insights directly to a user’s phone. We'll provide a comprehensive overview on setting up this integration as well as a demo of how the team uses it daily. Attendees will gain practical knowledge to implement this integration, empowering their teams to access and interact with data seamlessly within Microsoft Teams.<\/p>","track":"Analytics and BI","level":"Advanced","type":"Breakout","industry":["Energy and Utilities, Retail and CPG - Food, Travel and Hospitality"],"category":["AI\/BI"],"areas_of_interest":["AI Agents, Data Applications, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Nathan Sundararajan","company":"Rooms To Go","job_title":"Manager Data Engineering & Integration","bio":"Nathan Sundararajan is seasoned Data Professional with more than 15+ years of experience. Currently he is leading team of Data Engineers and Architects at Rooms To Go a Furniture Retail Company based out of Tampa, FL. ","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/picture_1743729933946001k5Hx.png?h=4de69ae3&itok=6JKndwaw","alt":"Nathan Sundararajan"}},{"name":"Ryan Bates","company":"Databricks","job_title":"Solutions Architect","bio":"With over 12 years of experience in business intelligence and data engineering, Ryan is a seasoned data professional passionate about helping organizations unlock the full potential of their data. As a Solutions Architect at Databricks, he partners with leading retail customers to tackle complex technical challenges and drive innovation across their data and AI initiatives. Based in Austin, TX, Ryan brings a deep understanding of modern data architectures and a practical, hands-on approach to delivering scalable solutions that create real business impact.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/RyanBatesHeadshot_1744815011376001lBLd.png?h=93fa4828&itok=F1bn56ap","alt":"Ryan Bates"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/empowering-business-users-databricks-integrating-aibi-genie-microsoft","alias":"\/data-ai-summit-2025\/session\/empowering-business-users-databricks-integrating-aibi-genie-microsoft","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534222+00:00"}
{"id":"D25B2489","title":"Getting Data AI Ready: Testimonial of Good Governance Practices Constructing Accurate Genie Spaces","description":"<p>Genie Rooms have played an integral role in democratizing important datasets like Cell Tower and Lease Information. However, in order to ensure that this exciting new release from Databricks was configured as optimally as possible from development to deployment, we needed additional scaffolding around governance. In this talk we will describe the four main components we used in conjunction with the Genie Room to build a successful product and will provide generalizable lessons to help others get the most out of this object. At the core are a declarative, metadata approach to creating UC tables deployed on a robust framework. Second, a platform that efficiently crowdsourced targeted feedback from different user groups. Third, a tool that balances the LLM’s creativity with human wisdom. And finally, a platform that enforces our principle of separating Storage from Compute to manage access to the room at a fine-grained level and enables a whole host of interesting use-cases.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Energy and Utilities"],"category":["AI\/BI, Databricks SQL, Unity Catalog"],"areas_of_interest":["Data Intelligence, Generative AI (LLMs), SQL"],"delivery":["In Person"],"speakers":[{"name":"Arvindram Krishnamoorthy","company":"T-Mobile","job_title":"Principal Architect, ML Solutions","bio":"I’m currently a Principal Architect in the Finance Procurement & Supply Chain Organization at T-Mobile. In my role, I design and implement innovative technology strategies and oversee the end-to-end lifecycle of large-scale ML models produced by the AI Center of Excellence. Collaborating with senior architects and stakeholders, I define the technical strategy to achieve vital organizational goals. Often, these initiatives cross different, large domains. I'm also super passionate about mentoring junior ML engineers. Currently, I've filed two patents, one was awarded, one pending, and I may be working on a couple more ;) I have two younger siblings and outside of work, I enjoy reading, fitness, whittling -- although I'm still a beginner!","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/SquareHeadshot_1744313278758001xQvX.jpg?h=6379e596&itok=5y_yGXeL","alt":"Arvindram Krishnamoorthy"}},{"name":"Brian Schober","company":"T-Mobile","job_title":"Sr Business Intelligence Mgr","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/getting-data-ai-ready-testimonial-good-governance-practices","alias":"\/data-ai-summit-2025\/session\/getting-data-ai-ready-testimonial-good-governance-practices","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534405+00:00"}
{"id":"D25B2968","title":"How Feastables Partners With Engine to Leverage Advanced Data Models and AI for Smarter BI","description":"<p>Feastables, founded by YouTube sensation MrBeast, partnered with Engine to build a modern, AI-enabled BI ecosystem that transforms complex, disparate data into actionable insights, driving smarter decision-making across the organization. In this session, learn how Engine, a Built-On Databricks Partner, brought expertise combined with strategic partnerships that enabled Feastables to rapidly stand up a secure, modern data estate to unify complex internal and external data sources into a single, permissioned analytics platform. Feastables unlocked the power of cross-functional collaboration by democratizing data access throughout their enterprise and seamlessly integrating financial, retailer, supply chain, syndicated, merchandising and e-commerce data. Discover how a scalable analytics framework combined with advanced AI models and tools empower teams with Smarter BI across sales, marketing, supply chain, finance and executive leadership to enable real-time decision-making at scale.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Retail and CPG - Food"],"category":["Databricks SQL, Databricks Workflows, DLT"],"areas_of_interest":["Customer Data Platform, SQL, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Daniel Palmer","company":"Engine","job_title":"SVP of Data Science","bio":"Daniel Palmer, Senior Vice President of Data Science at Engine, is a patented innovator in the field of Data Science making significant contributions to the industry designed specifically for Retail\/CPG. Daniel has a rich history of providing Category Management expertise, with 10 years of experience including time spent at Coca-Cola Company and at software analytics solution providers. At Engine, Daniel leads a team dedicated to delivering prescriptive analytics that empower CPG retailers and suppliers to make data-driven decisions that drive growth and efficiency.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Daniel%2520Palmer%2520-%2520Engine%2520%25281%2529_1739395554829001JZic.png?h=fbf7a813&itok=1hXxKudu","alt":"Daniel Palmer"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/how-feastables-partners-engine-leverage-advanced-data-models-and-ai","alias":"\/data-ai-summit-2025\/session\/how-feastables-partners-engine-leverage-advanced-data-models-and-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534477+00:00"}
{"id":"D25B3025","title":"How to Get the Most Out of Your BI Tools on Databricks","description":"<p>Unlock the full potential of your BI tools with Databricks. This session explores how features like Photon, Databricks SQL, Liquid Clustering, AI\/BI Genie and Publish to Power BI enhance performance, scalability and user experience. Learn how Databricks accelerates query performance, optimizes data layouts and integrates seamlessly with BI tools. Gain actionable insights and best practices to improve analytics efficiency, reduce latency and drive better decision-making. Whether migrating from a data warehouse or optimizing an existing setup, this talk provides the strategies to elevate your BI capabilities.<\/p>","track":"Analytics and BI","level":"Beginner","type":"Breakout","industry":["Enterprise Technology, Professional Services"],"category":["AI\/BI, Databricks SQL, Unity Catalog"],"areas_of_interest":["Data Intelligence, SQL, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Kyle Hale","company":"Databricks","job_title":"DBSQL Product Specialist","bio":"Kyle Hale’s journey into data and analytics began at age 8 when he created his first database to analyze baseball statistics, and hasn’t stopped yet. He’s a 20 year veteran of the data warehousing and BI space, having worn every hat from report development, modeling, and performance tuning to architecture, strategy, and governance. Having been a trusted advisor to well over 1,000 organizations big and small: Kyle has seen things.His proudest moment is being recognized by his peers at Databricks as a Data and Analytics SME - game knows game.When he’s not secretly plotting like all good BI professionals to kill Excel once and for all, he enjoys crafting synth pop soundtracks to imaginary movies, solving chess puzzles, and roaming the countryside with his wife and 4 kids in search of cool museums and awesome fried chicken. He is also an avid collector of dad jokes.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/how-get-most-out-your-bi-tools-databricks","alias":"\/data-ai-summit-2025\/session\/how-get-most-out-your-bi-tools-databricks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534520+00:00"}
{"id":"D25B3130DBX","title":"How We Turned 200+ Business Users Into Analysts With AI\/BI Genie","description":"<p>AI\/BI Genie has transformed self-service analytics for the Databricks Marketing team. This user-friendly conversational AI tool empowers marketers to perform advanced data analysis using natural language — no SQL required. By reducing reliance on data teams, Genie increases productivity and enables faster, data-driven decisions across the organization. But realizing Genie’s full potential takes more than just turning it on.<\/p><p>In this session, we’ll share the end-to-end journey of implementing Genie for over 200 marketing users, including lessons learned, best practices and the real business impact of this Databricks-on-Databricks solution. Learn how Genie democratizes data access, enhances insight generation and streamlines decision-making at scale.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["AI\/BI, Databricks SQL"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Thomas Russell","company":"Databricks","job_title":"Sr. Marketing Analytics Manager","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/how-we-turned-200-business-users-analysts-aibi-genie","alias":"\/data-ai-summit-2025\/session\/how-we-turned-200-business-users-analysts-aibi-genie","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534536+00:00"}
{"id":"D25B2798","title":"IQVIA's Analytics for Patient Support Services: Transforming Scalability, Performance and Governance","description":"<p>This presentation will explore the transformation of IQVIA's decade-old patient support platform through the implementation of Databricks Data Intelligence Platform. Facing scalability challenges, performance bottlenecks and rising costs, the existing platform required significant redesign to handle growing data volumes and complex analytics. Key issues included static metrics limiting workflow optimization, fragmented data governance and heightened compliance and security demands. By partnering with Customertimes (a Databricks Partner) and adopting Databricks' centralized, scalable analytics solution with enhanced self-service capabilities, IQVIA achieved improved query performance, cost efficiency and robust governance, ensuring operational effectiveness and regulatory compliance in an increasingly complex environment.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Health and Life Sciences"],"category":["AI\/BI, Databricks SQL, Unity Catalog"],"areas_of_interest":["Data Intelligence, Data Science, Security & Compliance"],"delivery":["In Person"],"speakers":[{"name":"Sudha Ragothaman","company":"IQVIA","job_title":"Director, Data and Analytics","bio":"Accomplished data executive with over 20 years of experience in the analytics space.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/ProfilePic_1745942872543001mIqH.jpg?h=f2ad6c22&itok=Iv45pm-n","alt":"Sudha Ragothaman"}},{"name":"Dmytro Kobryn","company":"Customertimes","job_title":"Head of Data Practice","bio":"With nearly 20 years of experience in IT consulting, I have worked extensively across industries including Healthcare and Life Sciences (HLS), Consumer Packaged Goods (CPG), Manufacturing, and Financial Services. From the outset of my career, my focus has been on data-driven solutions — evolving from early Data Warehouse (DWH) concepts to today’s modern data mesh architectures and decision intelligence frameworks. Even after more than a decade of serving in consulting roles, I continue to learn and deepen my expertise in the ever-evolving world of data every day.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/DSCF6198_1745616695310001kEJA.JPG?h=e306595d&itok=4k6l0DSt","alt":"Dmytro Kobryn"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/iqvias-analytics-patient-support-services-transforming-scalability","alias":"\/data-ai-summit-2025\/session\/iqvias-analytics-patient-support-services-transforming-scalability","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534618+00:00"}
{"id":"D25B3120DBX","title":"Latest Innovations in AI\/BI Dashboards and Genie","description":"<p>Discover how the latest innovations in Databricks AI\/BI Dashboards and Genie are transforming self-service analytics. This session offers a high-level tour of new capabilities that empower business users to ask questions in natural language, generate insights faster and make smarter decisions. Whether you're a long-time Databricks user or just exploring what's possible with AI\/BI, you'll walk away with a clear understanding of how these tools are evolving — and how to leverage them for greater business impact.<\/p>","track":"Analytics and BI","level":"Beginner","type":"Breakout","industry":["Enterprise Technology"],"category":["AI\/BI, Databricks SQL"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Miranda Luna","company":"Databricks","job_title":"Product Management","bio":"Miranda on AI\/BI. She resides in Seattle where outside of work she can usually be found skiing or golfing.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/MirandaHeadshot_1744750150186001NtQc.jpg?h=70cf5f7b&itok=nkHGxV6m","alt":"Miranda Luna"}},{"name":"Chao Cai","company":"Databricks","job_title":"Sr Eng Director","bio":"Chao is the engineering lead for AI\/BI at Databricks, focusing on helping everyone in businesses around the world benefit from the power of data + AI, regardless of their level of technical expertise. These efforts include using the best of GenAI to create amazing natural language BI experiences like Genie, as well as delightful and performant reporting, dashboarding, and analysis solutions, all backed by world-class visualizations and the entire Databricks Data Intelligence Platform.<br \/>\n<br \/>\nPrior to Databricks, Chao led a number of efforts at Google ranging from marketing analytics and attribution capabilities across Google Ads and Google Analytics, Google Tag Manager, SMB Ads, and shopping\/retail advertiser experiences.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Chao_Cai_1744985313301001ia8o.PNG?h=7c2707b9&itok=KDKoDZeG","alt":"Chao Cai"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/latest-innovations-aibi-dashboards-and-genie","alias":"\/data-ai-summit-2025\/session\/latest-innovations-aibi-dashboards-and-genie","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534671+00:00"}
{"id":"D25B2238","title":"Measuring User Adoption and KPIs for Data Products Using Databricks System Tables","description":"<p>In this session, attendees will learn how to leverage Databricks' system tables to measure user adoption and track key performance indicators (KPIs) for data products. The session will focus on how organizations can use system tables to analyze user behavior, assess engagement with data products and identify usage trends that can inform product development. By measuring KPIs such as user retention, frequency of use and data queries, organizations can optimize their data products for better performance and ROI.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Health and Life Sciences"],"category":["Data Marketplace, Databricks SQL, Unity Catalog"],"areas_of_interest":["Customer Data Platform, Data Intelligence, SQL"],"delivery":["In Person"],"speakers":[{"name":"Grant Stubblefield","company":"Kythera Labs","job_title":"Director of Product","bio":"Grant Stubblefield is the Director of Product at Kythera Labs, where he leads the development of cutting-edge healthcare data solutions that transform raw Real-World Data (RWD) into actionable Real-World Evidence (RWE). With a career spanning healthcare analytics, cloud data technologies, and automation, Grant has helped providers, payers, and life sciences organizations unlock the full potential of their data to drive better patient outcomes, operational efficiency, and commercial success.<br \/>\n<br \/>\nAn avid advocate for repeatable, scalable solutions, Grant brings a pragmatic, results-driven approach to every initiative. Outside of work, he’s a lifelong musician, marathon runner, and passionate explorer of synthesizers and modular music technology.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Grant%2520Stubblefield%2520Headshots%2520101724_1746128423842001IWPB.jpg?h=7d81c922&itok=WTbOGCFx","alt":"Grant Stubblefield"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/measuring-user-adoption-and-kpis-data-products-using-databricks-system","alias":"\/data-ai-summit-2025\/session\/measuring-user-adoption-and-kpis-data-products-using-databricks-system","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534773+00:00"}
{"id":"D25B1846","title":"Optimizing Smart Meter IIoT Data in Databricks for At-Scale Interactive Electrical Load Analytics","description":"<p>Octave is a Plotly Dash application used daily by about 1,000 Hydro-Québec technicians and engineers to analyze smart meter load and voltage data from 4.5M meters across the province. As adoption grew, Octave’s back end was migrated to Databricks to address increasingly massive scale (>1T data points), governance and security requirements. This talk will summarize how Databricks was optimized to support performant at-scale interactive Dash application experiences while in parallel managing complex back-end ETL processes. The talk will outline optimizations targeted to further optimize query latency and user concurrency, along with plans to increase data update frequency. Non-technology related success factors to be reviewed will include the value of: subject matter expertise, operational autonomy, code quality for long-term maintainability and proactive vendor technical support.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Energy and Utilities"],"category":["Apache Spark, AI\/BI, Databricks SQL"],"areas_of_interest":["Collaboration, Developer Experience, ETL"],"delivery":["In Person"],"speakers":[{"name":"David Gibbon","company":"Plotly","job_title":"Senior Director - Strategic Partnerships","bio":"Dave Gibbon is Senior Director of Strategic Partnerships at Plotly.  Equipped with a mix of technical, analytical, and communication skills, he brings over 25 years of international experience in enterprise technology software sales and business development, with a strong track record for solutions focused on engineering & scientific workflows.  Dave stewards Plotly's joint go-to-market strategy with Databricks, with a combined value proposition focused on enabling organizations to operationalize production-grade data applications for at-scale interactive analytics workflows. Curating a list of over 1,000 Dash apps, Dave is passionate about engaging with joint Databricks+Plotly customers to understand their wealth of use cases.<br \/>\n","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/dave_gibbon_1745989233201001r5CJ.jpg?h=a78d7299&itok=NgMBVR_K","alt":"David Gibbon"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/optimizing-smart-meter-iiot-data-databricks-scale-interactive","alias":"\/data-ai-summit-2025\/session\/optimizing-smart-meter-iiot-data-databricks-scale-interactive","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534852+00:00"}
{"id":"D25B2403","title":"Power BI and Databricks: Practical Best Practices","description":"<p>Power BI has long been the dominant BI tool in the market. In this session, we'll discuss how to get the most out of PowerBI and Databricks, beginning with high-level architecture and moving down into detailed how-to guides for troubleshooting common failure points. At the end, you'll receive a cheat-sheet which summarizes those best practices into an easy-to-reference format.<\/p>","track":"Analytics and BI","level":"Beginner","type":"Breakout","industry":["Manufacturing, Professional Services, Financial Services"],"category":["AI\/BI, Databricks SQL, Unity Catalog"],"areas_of_interest":["Data Intelligence, SQL"],"delivery":["In Person"],"speakers":[{"name":"Hobbs Hobbs","company":"Databricks","job_title":"Sr. Solution Architect","bio":"Hobbs is a Databricks Solution Architect with a decade of experience in the BI and Data Warehousing space. Before coming to Databricks, he was a Power BI Architect, consulting for Fortune 500 companies through Valorem Reply. Hobbs has a Master's degree in public speaking and speaks regularly on various conference circuits. Outside of work, he volunteers as a part-time teacher of Rhetoric at a local school, has a beautiful wife and six children, enjoys 3d printing and Dungeons & Dragons, and loves to travel.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/image_1745543725581001xQVe.png?h=3b294181&itok=0syHw0QU","alt":"Hobbs Hobbs"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/power-bi-and-databricks-practical-best-practices","alias":"\/data-ai-summit-2025\/session\/power-bi-and-databricks-practical-best-practices","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534897+00:00"}
{"id":"D25B2053","title":"Real-Time Market Insights — Powering Optiver’s Live Trading Dashboard with Databricks Apps and Dash","description":"<p>In the fast-paced world of trading, real-time insights are critical for making informed decisions. This presentation explores how Optiver, a leading high-frequency trading firm, harnesses Databricks apps to power its live trading dashboards. The technology enables traders to analyze market data, detect patterns and respond instantly. In this talk, we will showcase how our system leverages Databricks’ scalable infrastructures such as Structured Streaming to efficiently handle vast streams of financial data while ensuring low-latency performance. In addition, we will show how the integration of Databricks apps with Dash has empowered traders to rapidly develop and deploy custom dashboards, minimizing dependency on developers. Attendees will gain insights into our architecture, data processing techniques and lessons learned in integrating Databricks apps with Dash in order to drive rapid, data-driven trading decisions.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Financial Services"],"category":["Apache Spark, Databricks SQL, Databricks Apps"],"areas_of_interest":["Data Applications, Data Intelligence, Streaming pipelines"],"delivery":["In Person"],"speakers":[{"name":"Huy Nguyen","company":"Optiver","job_title":"Data Engineer","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/real-time-market-insights-powering-optivers-live-trading-dashboard","alias":"\/data-ai-summit-2025\/session\/real-time-market-insights-powering-optivers-live-trading-dashboard","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534935+00:00"}
{"id":"D25B2838","title":"Retail Genie: No-Code AI Apps for Empowering BI Users to be Self-Sufficient","description":"<p>Explore how Databricks AI\/BI Genie revolutionizes retail analytics, empowering business users to become self-reliant data explorers. <\/p><p> <\/p><p>This session highlights no-code AI apps that create a conversational interface for retail data analysis. Genie spaces harness NLP and generative AI to convert business questions into actionable insights, bypassing complex SQL queries. We'll showcase retail teams effortlessly analyzing sales trends, inventory and customer behavior through Genie's intuitive interface. Witness real-world examples of AI\/BI Genie's adaptive learning, enhancing accuracy and relevance over time. Learn how this technology democratizes data access while maintaining governance via Unity Catalog integration. Discover Retail Genie's impact on decision-making, accelerating insights and cultivating a data-driven retail culture. Join us to see the future of accessible, intelligent retail analytics in action.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Manufacturing, Retail and CPG - Food"],"category":["AI\/BI, Databricks SQL, Unity Catalog"],"areas_of_interest":["Data Intelligence, SQL, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Siddhesh Pore","company":"Databricks","job_title":"Sr. Solutions Architect","bio":"Siddhesh is an exceptionally proficient leader and architect, boasting over 12 years of experience with a specialization in Data Engineering and data architecture across both cloud and non-cloud platforms. He has played a pivotal role in assisting diverse clientele in constructing data solutions, ranging from identifying and ingesting data to establishing self-service layers on curated data sets. Presently, he serves as a Solutions Architect for the Retail sector at Databricks, where he is instrumental in aiding prominent retail entities in crafting data solutions and formulating strategies on the innovative Databricks Data Intelligence platform","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Sid-headshot_1744161996302001ypW0.png?h=1dc8742f&itok=rTgKOqJn","alt":"Siddhesh Pore"}},{"name":"Harish Rajagopalan","company":"Databricks","job_title":"Solutions Architect","bio":"Harish Rajagopalan is an accomplished Solutions Architect with over 17 years of experience in cloud computing, analytics, and AI\/ML. Currently at Databricks, he specializes in designing transformative solutions for retail strategic accounts, leveraging the Lakehouse architecture to unify data engineering, machine learning, and analytics workflows. Previously, Harish played a pivotal role at AWS in guiding enterprises through large-scale cloud migrations and architecting resilient solutions. ","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/headshot-1_1744292692809001laMX.jpg?h=3899b4ed&itok=fHTXmNUB","alt":"Harish Rajagopalan"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/retail-genie-no-code-ai-apps-empowering-bi-users-be-self-sufficient","alias":"\/data-ai-summit-2025\/session\/retail-genie-no-code-ai-apps-empowering-bi-users-be-self-sufficient","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534986+00:00"}
{"id":"D25B3122DBX","title":"Scaling AI\/BI Genie: Best Practices for Curating and Managing Production Spaces","description":"<p>Unlock Genie's full potential with best practices for curating, deploying and monitoring Genie spaces at scale. This session offers a deep dive into the latest enhancements and provides practical guidance on designing high-quality spaces, streamlining deployment workflows and implementing robust monitoring to ensure accuracy and performance in production. Ideal for teams aiming to scale conversational analytics, you’ll leave with actionable strategies to keep your Genie spaces efficient, reliable and aligned with business outcomes.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["AI\/BI, Databricks SQL"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Shah Amini","company":"Databricks","job_title":"Software Engineering Manager","bio":null,"image":{}},{"name":"Hanlin Sun","company":"Databricks","job_title":"Product Manager","bio":"Product Manager working on Self-Serve Business Analytics!","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/scaling-aibi-genie-best-practices-curating-and-managing-production","alias":"\/data-ai-summit-2025\/session\/scaling-aibi-genie-best-practices-curating-and-managing-production","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535043+00:00"}
{"id":"D25B1898","title":"Scaling Trust in BI: How Bolt Manages Thousands of Metrics Across Databricks, dbt, and Looker","description":"<p>Managing metrics across teams can feel like everyone’s speaking a different language, which often leads to loss of trust in numbers. Based on a real-world use case, we’ll show you how to establish a governed source of truth for metrics that works at scale and builds a solid foundation for AI integration. You’ll explore how Bolt.eu’s data team governs consistent metrics for different data users and leverages Euno’s automations to navigate the overlap between Looker and dbt. We’ll cover best practices for deciding where your metrics belong and how to optimize engineering and maintenance workflows across Databricks, dbt and Looker. For curious analytics engineers, we’ll dive into thinking in dimensions & measures vs. tables & columns and determining when pre-aggregations make sense. The goal is to help you contribute to a self-serve experience with consistent metric definitions, so business teams and AI agents can access the right data at the right time without endless back-and-forth.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Energy and Utilities, Enterprise Technology, Retail and CPG - Food"],"category":["AI\/BI, Databricks SQL, Databricks Workflows"],"areas_of_interest":["Catalogs, ETL, Streaming pipelines"],"delivery":["In Person"],"speakers":[{"name":"Sarah Levy","company":"Euno","job_title":"Co-Founder & CEO","bio":"Sarah Levy is the Co-founder & CEO of Euno, an active metadata management platform built for BI and AI success. With over 25 years of experience, Sarah has driven teams and startups in cybersecurity, healthcare, and finance to extraordinary growth by leveraging data and AI in transformative ways. Her expertise in navigating the complexities of data at scale-up companies has positioned her as a leader in balancing robust data governance with the freedom of analytics. Together with her Euno-tastic team, Sarah’s mission is clear: to untangle the toughest knots for data teams, no matter how fast your company scales.<br \/>\n","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/sarah_1744704561286001f1SB.png?h=fbe83f66&itok=9ZhC9TfW","alt":"Sarah Levy"}},{"name":"Silja Märdla","company":"Bolt","job_title":"Staff Analytics Engineer","bio":"Silja Märdla is a Staff Analytics Engineer at Bolt, the European super-app that offers shared mobility services like ride-hailing, rentals and delivery to more than 200 million customers in 50+ countries. Over different positions as a hands on data practitioner or a manager, she has seen her fair share of data mesh and data mess. It is now her mission to figure out scalable and sustainable data practices for the hundreds of data users in Bolt. Being able to find and reuse high quality data products is what helps a data team and the company beat the competition. She is passionate about knowledge sharing, aspiring to push the whole data community forward, into a less messy future.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Silja_Mardla_1745392944577001erx3.PNG?h=cd2a7045&itok=cIItj6Ks","alt":"Silja Märdla"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/scaling-trust-bi-how-bolt-manages-thousands-metrics-across-databricks","alias":"\/data-ai-summit-2025\/session\/scaling-trust-bi-how-bolt-manages-thousands-metrics-across-databricks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535110+00:00"}
{"id":"D25B3123DBX","title":"Securely Deploying AI\/BI to All Users in Your Enterprise","description":"<p>Bringing AI\/BI to every business user starts with getting security, access and governance right. In this session, we’ll walk through the latest best practices for configuring Databricks accounts, setting up workspaces, and managing authentication protocols to enable secure and scalable onboarding. Whether you're supporting a small team or an entire enterprise, you'll gain practical insights to protect your data while ensuring seamless and governed access to AI\/BI tools.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["AI\/BI, Databricks SQL"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Austin Green","company":"Databricks","job_title":"Staff Software Engineer","bio":null,"image":{}},{"name":"Keegan Dubbs","company":"Databricks","job_title":"Staff Product Manager","bio":"Keegan Dubbs is a Product Manager focused on Identity Lifecycle at Databricks, where she helps shape secure and scalable user experiences. Her favorite part of the job is collecting customer feedback - she loves hearing real-world insights that directly inform the product roadmap and drive meaningful improvements. Outside of work, Keegan can often be found skiing in the mountains or daydreaming about her future golden retriever. She's passionate about building user-centric products and believes the best ideas come from listening closely to the people who use them every day.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Image%2520from%2520iOS_1745617051961001wVVb.png?h=03c5da6b&itok=uHsJwaez","alt":"Keegan Dubbs"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/securely-deploying-aibi-all-users-your-enterprise","alias":"\/data-ai-summit-2025\/session\/securely-deploying-aibi-all-users-your-enterprise","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535127+00:00"}
{"id":"D25B1175","title":"Shifting Left — Setting up Your GenAI Ecosystem to Work for Business Analysts","description":"<p>At Data and AI in 2022, Databricks pioneered the term to shift left in how AI workloads would enable less data science driven people to create their own apps. In 2025, we take a look at how Experian is doing on that journey. This session highlights Databricks services that assist with the shift left paradigm for Generative AI, including how AI\/BI Genie helps with Generative analytics, and how Agent Studio helps with synthetic generation of test cases to validate model performance.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology, Professional Services, Financial Services"],"category":["AI\/BI, Mosaic AI, Unity Catalog"],"areas_of_interest":["AI Agents, Catalogs"],"delivery":["In Person"],"speakers":[{"name":"James Lin","company":"Experian","job_title":"Head of AI\/ML Innovation","bio":"James Lin is the Head of AI\/ML Innovation at Experian where he is working on bringing Generative AI research to production. Previously James helped to pioneer Experian's predictive ML migration to the cloud as well as one of the ML Ops solutions within the company. In some past lifetimes, James helped to launch the first commercial Voice over IP product in the US and holds over 10 patents in a diverse set of fields from software to semiconductor. James holds both a Masters in Computer Science and a Master of Business Administration.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/shifting-left-setting-your-genai-ecosystem-work-business-analysts","alias":"\/data-ai-summit-2025\/session\/shifting-left-setting-your-genai-ecosystem-work-business-analysts","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535184+00:00"}
{"id":"D25B3313SPO","title":"Sponsored by: Firebolt | 10ms Queries on Iceberg: Turbocharging Your Lakehouse for Interactive Experiences with Firebolt","description":"<p>Open table formats such as Apache Iceberg or Delta Lake have transformed the data landscape. For the first time, we’re seeing a real open storage ecosystem emerging across database vendors. So far, open table formats have found little adoption powering low-latency, high-concurrency analytics use-cases. Data stored in open formats often gets transformed and ingested into closed systems for serving. The reason for this is simple: most modern query engines don’t properly support these workloads. In this talk we take a look under the hood of Firebolt and dive into the work we’re doing to support low-latency and high concurrency on Iceberg: caching of data and metadata, adaptive object storage reads, subresult reuse, and multi-dimensional scaling. After this session, you will know how you can build low-latency data applications on top of Iceberg. You’ll also have a deep understanding of what it takes for modern high-performance query engines to do well on these workloads.<\/p>","track":"Analytics and BI","level":"Advanced","type":"Breakout","industry":["Enterprise Technology, Retail and CPG - Food, Financial Services"],"category":["Apache Iceberg, Unity Catalog"],"areas_of_interest":["Data Applications, Partner Innovation Showcase, SQL"],"delivery":["In Person"],"speakers":[],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/sponsored-firebolt-10ms-queries-iceberg-turbocharging-your-lakehouse","alias":"\/data-ai-summit-2025\/session\/sponsored-firebolt-10ms-queries-iceberg-turbocharging-your-lakehouse","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535302+00:00"}
{"id":"D25L2852","title":"Streamline Your BI Infrastructure With Databricks AI\/BI and Save Millions on Traditional BI Tools","description":"<p>Earlier this year, we finished migration of all dashboards from a traditional BI system to Databricks AI\/BI ecosystem, resulting in annual savings of approximately $900,000. We also unlocked the below advantages:<\/p><ol>\t<li> Data security, integrity and safety<\/li>\t<li> Cost savings<\/li>\t<li> Single source of truth<\/li>\t<li> Real-time data<\/li>\t<li> Genie space<\/li><\/ol><p> We will speak about our journey and how you can migrate your dashboards from traditional BI to AI\/BI. Having listed the advantages above, we will also speak of some challenges faced.<\/p><p> <\/p><p>Migration steps:<\/p><ol>\t<li> Analytical scope of dashboard inventory<\/li>\t<li> Feature mapping: From traditional BI to AI\/BI<\/li>\t<li> Building bronze, silver and gold tables<\/li>\t<li> Building dashboards<\/li><\/ol><p> Migration shenanigans:<\/p><ol>\t<li> Hypercare phase<\/li>\t<li> Change management <\/li>\t<li> KT documents<\/li>\t<li> Demo sessions<\/li>\t<li> Deprecation of licenses and dashboards on traditional BI tools<\/li><\/ol><p> We look forward to sharing these lessons learned and insights with you to help you streamline your BI infrastructure and unlock the full potential of Databricks AI\/BI.<\/p>","track":"Analytics and BI","level":"Beginner","type":"Lightning Talk","industry":["Enterprise Technology, Manufacturing, Financial Services"],"category":["AI\/BI, Databricks SQL"],"areas_of_interest":["Getting started with Databricks, SQL"],"delivery":["In Person"],"speakers":[{"name":"Arpit Agrawal","company":"Databricks","job_title":"Business Intelligence Senior Analyst","bio":"Arpit is a Senior Business Intelligence Analyst at Databricks, bringing nearly a decade of experience in analytics and business intelligence. With a strong passion for data, problem-solving, and delivering actionable insights, Arpit is dedicated to creating meaningful value for end users and is always eager to collaborate with others in the field. If you're attending DAIS 2025, don't hesitate to connect—Arpit welcomes the opportunity to meet new people and exchange ideas.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/WhatsApp%2520Image%25202025-04-21%2520at%25207.06.41%2520PM_1745243103615001WYOk.png?h=1817e876&itok=TsbJz7fO","alt":"Arpit Agrawal"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/streamline-your-bi-infrastructure-databricks-aibi-and-save-millions","alias":"\/data-ai-summit-2025\/session\/streamline-your-bi-infrastructure-databricks-aibi-and-save-millions","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535358+00:00"}
{"id":"D25B2900","title":"Supercharge Your Enterprise BI: A Practitioner’s Guide for Migrating to AI\/BI","description":"<p>Are you striving to build a data-driven culture while managing costs and reducing reporting latency? Are your BI operations bogged down by complex data movements rather than delivering insights? Databricks IT faced these challenges in 2024 and embarked on an ambitious journey to make Databricks AI\/BI our enterprise-wide reporting platform. In just two quarters, we migrated 2,000 dashboards from a traditional BI tool — without disrupting business operations.<\/p><p> <\/p><p>We’ll share how we executed this large-scale transition cost-effectively, ensuring seamless change management and empowering non-technical users to leverage AI\/BI. You’ll gain insights into:<\/p><ul>\t<li>Key migration strategies that minimized disruption and optimized efficiency<\/li>\t<li>Best practices for user adoption and training to drive self-service analytics<\/li>\t<li>Measuring success with clear adoption metrics and business impact<\/li><\/ul><p> <\/p><p>Join us to learn how your organization can achieve the same transformation with AI-powered enterprise reporting.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology, Professional Services"],"category":["AI\/BI, Databricks SQL"],"areas_of_interest":["Migrations, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Romit Jadhwani","company":"Databricks","job_title":"Sr. Director, Data","bio":"Romit Jadhwani heads the Data Engineering, Analytics and Integrations team at Databricks. For close to two decades, he and his teams have been wrangling data to get the most value out of it across various industries. Prior to Databricks, he had a long stint at Pinterest and Google. He loves to meet new people and make new connections so if you see him, don't hesitate to say hi!","image":{}},{"name":"Aman Gupta","company":"Databricks","job_title":"Senior Engineering Manager","bio":"Aman is a Senior Engineering Manager at Databricks, leading the India development center and managing teams in Data Engineering, Analytics, and AI. With over 15 years of experience, he’s passionate about data and its ability to drive meaningful business outcomes.<br \/>\n<br \/>\nAman is a strong advocate for data democratization and building a culture where data drives decisions. Before joining Databricks, he worked with both large enterprises and startups, designing data strategies tailored to diverse organizational needs.<br \/>\n<br \/>\nAman will be at DAIS 2025, excited to share his expertise, discuss the future of data and AI, and connect with peers. If you’re attending, don’t hesitate to say hello—he’s always happy to meet new people!","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Aman%2520gupta%2520headshot%2520cropped_1744172959137001eRv4.JPG?h=b5046132&itok=_jX8KVPQ","alt":"Aman Gupta"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/supercharge-your-enterprise-bi-practitioners-guide-migrating-aibi","alias":"\/data-ai-summit-2025\/session\/supercharge-your-enterprise-bi-practitioners-guide-migrating-aibi","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535368+00:00"}
{"id":"D25B3128DBX","title":"Take it to the Limit: Art of the Possible in AI\/BI","description":"<p>Think you know everything AI\/BI can do? Think again. This session explores the art of the possible with Databricks AI\/BI Dashboards and Genie, going beyond traditional analytics to unleash the full power of the lakehouse. From incorporating AI into dashboards to handling large-scale data with ease to delivering insights seamlessly to end users — we’ll showcase creative approaches that unlock insights and real business outcomes. Perfect for adventurous data professionals looking to push limits and think outside the box.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["AI\/BI, Databricks SQL"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Noah Sommerfeld","company":"Databricks","job_title":"Delivery Solution Architect","bio":null,"image":{}},{"name":"Adam Levine","company":"Databricks","job_title":"Staff Software Engineer","bio":"Adam is a Staff Software Engineer at Databricks who has worked on both dashboards and Genie within the AI\/BI product line.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/DAIS_headshot_1745248396884001a9bm.png?h=34ee39be&itok=QwKLpFbg","alt":"Adam Levine"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/take-it-limit-art-possible-aibi","alias":"\/data-ai-summit-2025\/session\/take-it-limit-art-possible-aibi","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535379+00:00"}
{"id":"D25B3092","title":"Tech Industry Session: Optimizing Costs and Controls to Democratize Data and AI","description":"<p>Join us for this session focused on how leading tech companies are enabling data intelligence across their organizations while maintaining cost efficiency and governance. Hear the successes and the challenges when Databricks empowers thousands of users—from engineers to business teams—by providing scalable tools for AI, BI and analytics.<\/p><p> <\/p><p>Topics include:<\/p><ul>\t<li>Combining AI\/BI and Lakehouse Apps to streamline workflows and accelerate insights<\/li>\t<li>Implementing systems tables, tagging and governance frameworks for granular control<\/li>\t<li>Democratizing data access while optimizing costs for large-scale analytical workloads<\/li><\/ul><p> <\/p><p>Hear from customers and Databricks experts, followed by a customer panel featuring industry leaders. Gain insights into how Databricks helps tech innovators scale their platforms while maintaining operational excellence.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["AI\/BI, Databricks SQL, Databricks Apps"],"areas_of_interest":["Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Miranda Luna","company":"Databricks","job_title":"Product Management","bio":"Miranda on AI\/BI. She resides in Seattle where outside of work she can usually be found skiing or golfing.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/MirandaHeadshot_1744750150186001NtQc.jpg?h=70cf5f7b&itok=nkHGxV6m","alt":"Miranda Luna"}},{"name":"Vivek Srivastava","company":"OT Technology, LLC","job_title":"SVP Product and Engineering","bio":null,"image":{}},{"name":"Venkat Sivasubramanian","company":"Rivian Volkwagen Group Technologies","job_title":null,"bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/tech-industry-session-optimizing-costs-and-controls-democratize-data","alias":"\/data-ai-summit-2025\/session\/tech-industry-session-optimizing-costs-and-controls-democratize-data","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535398+00:00"}
{"id":"D25B1114","title":"Transforming HP’s Print ELT Reporting with GenIT: Real-Time Insights Tool Powered by Databricks AI","description":"<p>Timely and actionable insights are critical for staying competitive in today’s fast-paced environment. At HP Print, manual reporting for executive leadership (ELT) has been labor-intensive, hindering agility and productivity. To address this, we developed the Generative Insights Tool (GenIT) using Databricks Genie and Mosaic AI to create a real-time insights engine automating SQL generation, data visualization, and narrative creation. GenIT delivers instant insights, enabling faster decisions, greater productivity, and improved consistency while empowering leaders to respond to printer trends. With automated querying, AI-powered narratives, and a chatbot, GenIT reduces inefficiencies and ensures quality data and insights. Our roadmap integrates multi-modal data, enhances chatbot functionality, and scales globally. This initiative shows how HP Print leverages GenAI to improve decision-making, efficiency, and agility, and we will showcase this transformation at the Databricks AI Summit.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["AI\/BI, Databricks SQL, Mosaic AI"],"areas_of_interest":["Data Applications, Data Intelligence, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Weiwei Hu","company":"HP","job_title":"Director, Big Data & Strategic Insights","bio":"Weiwei Hu, Director of Big Data & Strategic Insights at HP, drives AI-led transformation by aligning big data strategy with business priorities. She leads a global team and built Generative Insights Tool (GenIT), a real-time insights engine powered by Databricks AI, that automates critical reporting and accelerates decision-making for HP’s Print business. Her work integrates advanced AI\/ML to improve forecasting accuracy, power printer recommendation engines, and uncover business opportunities. Through the Insights Academy, she champions AI adoption and upskilling, enabling cross-functional teams to deliver actionable insights and solutions at scale. Her leadership ensures AI delivers measurable business impact, agility, and customer value.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/IMG_8012_1744336061574001O87R.png?h=a7ffc51c&itok=DAERWsb9","alt":"Weiwei Hu"}}],"day":"Tuesday","room":"South, Esplanade, Room 156","starts":"2025-06-10T15:00:00","ends":"2025-06-10T15:40:00","starts_pst":"2025-06-10T08:00:00","ends_pst":"2025-06-10T08:40:00","start_time":"3:00 pm","end_time":"3:40 pm","pst_start_time":"8:00 am","pst_end_time":"8:40 am","duration":"40","path":"\/session\/transforming-hps-print-elt-reporting-genit-real-time-insights-tool","alias":"\/data-ai-summit-2025\/session\/transforming-hps-print-elt-reporting-genit-real-time-insights-tool","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535521+00:00"}
{"id":"D25B2325","title":"Trillions of Data Records, Zero Bottlenecks for Investor Decision-Making","description":"<p>In finance, every second counts. That’s why the Data team at J. Goldman & Co. needed to transform trillions of real-time market data records into a single, actionable insight — instantly, and without waiting on development resources.<\/p><p> <\/p><p>By modernizing their internal data platform with a scalable architecture, they built a streamlined, web-native alternative data interface that puts live market data directly in the hands of investment teams. With Databricks’ computational power and Unity Catalog’s secure governance, they eliminated bottlenecks and achieved the fastest time-to-market for critical investor decisions possible.<\/p><p> <\/p><p>Learn how J. Goldman & Co. Innovates with Databricks and Sigma to:<\/p><ul>\t<li>Ensure live, scalable data access across trillions of records in a flexible UI<\/li>\t<li>Empower non-technical teams with true self-service data exploration<\/li><\/ul>","track":"Analytics and BI","level":"Beginner","type":"Breakout","industry":["Financial Services"],"category":["Apache Spark, Databricks SQL, Unity Catalog"],"areas_of_interest":["Customer Data Platform, Data Science, SQL"],"delivery":["In Person"],"speakers":[{"name":"Carlos Capellan","company":"J. Goldman & Co., L.P.","job_title":"CTO","bio":"Carlos Capellan is Chief Technology Officer at J. Goldman & Co., L.P. where he is charged with overseeing the Firm’s considerable technology needs. This includes partnering with senior investment and operations professionals in aligning the Firm’s technological capabilities with its strategic vision. A former U.S. Army officer, Carlos graduated from the Johns Hopkins University with a B.A. in International Studies. He also holds an M.B.A. from NYU Stern and a Master of Information and Data Science from University of California, Berkeley.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Carlos%2520Headshot_1744122626637001H96z.jpg?h=29f2c4fa&itok=VqVnsud8","alt":"Carlos Capellan"}},{"name":"Ryan Sullivan","company":"J Goldman","job_title":"Head of Data","bio":"Head of Data, J. Goldman & Co., L.P.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/trillions-data-records-zero-bottlenecks-investor-decision-making","alias":"\/data-ai-summit-2025\/session\/trillions-data-records-zero-bottlenecks-investor-decision-making","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535632+00:00"}
{"id":"D25B3126DBX","title":"Turn Genie Into an Agent Using Conversation APIs","description":"<p>Transform your AI\/BI Genie into a text-to-SQL powerhouse using the Genie Conversation APIs. This session explores how Genie functions as an intelligent agent, translating natural language queries into SQL to accelerate insights and enhance self-service analytics. You'll learn practical techniques for configuring agents, optimizing queries and handling errors — ensuring Genie delivers accurate, relevant responses in real time. A must-attend for teams looking to level up their AI\/BI capabilities and deliver smarter analytics experiences.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["AI\/BI, Databricks SQL"],"areas_of_interest":["AI Agents, Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Hanlin Sun","company":"Databricks","job_title":"Product Manager","bio":"Product Manager working on Self-Serve Business Analytics!","image":{}},{"name":"Siddharth Murching","company":null,"job_title":"Software Engineer","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/turn-genie-agent-using-conversation-apis","alias":"\/data-ai-summit-2025\/session\/turn-genie-agent-using-conversation-apis","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535636+00:00"}
{"id":"D25B2523","title":"Unified Advanced Analytics: Integrating Power BI and Databricks Genie for Real-time Insights","description":"<p>In today’s data-driven landscape, business users expect seamless, interactive analytics without having to switch between different environments. This presentation explores our web application that unifies a Power BI dashboard with Databricks Genie, allowing users to query and visualize insights from the same dataset within a single, cohesive interface. We will compare two integration strategies: one that leverages a traditional webpage enhanced by an Azure bot to incorporate Genie’s capabilities, and another that utilizes Databricks Apps to deliver a smoother, native experience. We use the Genie API to build this solution.<\/p><p> <\/p><p>Attendees will learn the architecture behind these solutions, key design considerations and challenges encountered during implementation. Join us to see live demos of both approaches, and discover best practices for delivering an all-in-one, interactive analytics experience.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology, Manufacturing, Financial Services"],"category":["AI\/BI, LakeFlow, Databricks Apps"],"areas_of_interest":["Data Applications, Data Intelligence, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Edelweiss Kammermann","company":"IT Convergence","job_title":"Associate VP of AI & Machine Learning","bio":"Edelweiss Kammermann is a specialist in Data Analytics, AI, and Machine Learning with over 25 years of experience in consulting, project management, and team leadership. <br \/>\nFor the past ten years, she has been building and managing global Analytics, AI, and ML teams for U.S. companies. As a subject matter expert, she provides clients with analysis, recommendations, and guidance regarding their Analytics, AI, and ML ecosystems and roadmaps. <br \/>\nEdelweiss is also a recognized international speaker, frequently presenting in English, Spanish, and Portuguese on topics related to Analytics, AI, ML, and cloud-based technologies. <br \/>\nCurrently, she serves as Associate Vice President of AI & Machine Learning at IT Convergence.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Image%252015-4-25%2520at%252010.51%25E2%2580%25AFPM_1744774326109001Hwy5.JPG?h=fe83497e&itok=lzz3EFhz","alt":"Edelweiss Kammermann"}},{"name":"Justin Ward","company":"TurnPoint Services","job_title":"Senior Mgr of Analytics & Data Science","bio":"Justin Ward is the Senior Manager of Analytics & Data Science at TurnPoint Services. With extensive experience in data science, he has a proven track record of delivering impactful solutions in high-pressure environments. Previously, he held roles as Lead Data Scientist & Architect and Data Scientist at TurnPoint, where he developed advanced forecasting models and customer behavior analyses. He has also contributed to significant data lake and warehouse strategies for a $1.5B private equity firm and led demand forecasting at Advance Auto Parts. Known for his critical thinking and adaptability, he excels in leveraging big data to drive business intelligence and improve organizational outcomes.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Ward%2520Headshot_1746036407630001EdyT.jpg?h=2378085a&itok=qHTmbeiQ","alt":"Justin Ward"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/unified-advanced-analytics-integrating-power-bi-and-databricks-genie","alias":"\/data-ai-summit-2025\/session\/unified-advanced-analytics-integrating-power-bi-and-databricks-genie","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535639+00:00"}
{"id":"D25B1499","title":"Unifying GTM Analytics: The Strategic Shift to Native Analytics and AI\/BI Dashboards at Databricks","description":"<p>The GTM team at Databricks recently launched the GTM Analytics Hub—a native AI\/BI platform designed to centralize reporting, streamline insights, and deliver personalized dashboards based on user roles and business needs.<\/p><p> <\/p><p>Databricks Apps also played a crucial role in this integration by embedding AI\/BI Dashboards directly into internal tools and applications, streamlining access to insights without disrupting workflows. This seamless embedding capability allows users to interact with dashboards within their existing platforms, enhancing productivity and collaboration. Furthermore, AI\/BI Dashboards leverage Databricks' unified data and governance framework.<\/p><p> <\/p><p>Join us to learn how we’re using Databricks to build for Databricks—transforming GTM analytics with AI\/BI Dashboards, and what it takes to drive scalable, user-centric analytics adoption across the business.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology, Media and Entertainment, Financial Services"],"category":["AI\/BI, LakeFlow, Unity Catalog"],"areas_of_interest":["Data Applications, Data Intelligence, Marketing"],"delivery":["In Person"],"speakers":[{"name":"Abhinav Bhatnagar","company":"Databricks","job_title":"Sr. Manager, GTM Analytics","bio":"I am a technical leader specializing in building data science and AI capabilities that drive business value. At Databricks, I lead teams to deliver scalable, enterprise-grade Data & AI solutions, fostering innovation, mentorship, and inclusivity.  I excel at aligning technical vision with business goals to deliver impactful results.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Headshot_1746043069003001CtqD.png?h=93fa4828&itok=kiFbkPAY","alt":"Abhinav Bhatnagar"}},{"name":"David Gojo","company":"Databricks","job_title":"Director, GTM Analytics and Governance","bio":"Leading the GTM Analytics and Data Governance team at Databricks, I focus on leveraging data analytics, data engineering and large language models to improve our go-to-market performance and customer engagement. Previously, I led a data science team in tech, where I developed skills in AI, predictive modeling, and creating sales assistants powered by generative AI.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/headshot_1744159882483001CyOE.png?h=fbf7a813&itok=vtPz2Bd6","alt":"David Gojo"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/unifying-gtm-analytics-strategic-shift-native-analytics-and-aibi","alias":"\/data-ai-summit-2025\/session\/unifying-gtm-analytics-strategic-shift-native-analytics-and-aibi","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535662+00:00"}
{"id":"D25B2453","title":"Using Databricks to Power News Sentiment, a Capital IQ Pro Application","description":"The News Sentiment application enhances the discoverability of news content through our flagship platform, Capital IQ Pro. We processed news articles for 10,000+ public companies through entity recognition, along with a series of proprietary financial sentiment models to assess whether the news was positive or negative, as well as its significance and relevance to the company. We built a database containing over 1.5 million signals and operationalized the end-to-end ETL as a daily Workflow on Databricks. The development process included model training and selection. We utilized training data from our internal financial analysts to train Google’s T5-Flan to create our proprietary sentiment model and two additional models. Our models are deployed on Databricks Model-Serving as serverless endpoints that can be queried on-demand. The last phase of the project was to develop a UI, in which we utilized Databricks serverless SQL warehouses to surface this data in real-time.","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Professional Services, Financial Services"],"category":["AI\/BI, Databricks Workflows, Unity Catalog"],"areas_of_interest":["Data Applications, ETL, Machine Learning"],"delivery":["In Person"],"speakers":[{"name":"Debbie Connolly","company":"S&P Global","job_title":"Data Scientist","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/using-databricks-power-news-sentiment-capital-iq-pro-application","alias":"\/data-ai-summit-2025\/session\/using-databricks-power-news-sentiment-capital-iq-pro-application","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535751+00:00"}
{"id":"D25B3121DBX","title":"What's New and What's Next: Building Impactful AI\/BI Dashboards","description":"<p>Ready to take your AI\/BI dashboards to the next level? This session dives into the latest capabilities in Databricks AI\/BI Dashboards and how to maximize impact across your organization. Learn how data authors can tailor visualizations for different audiences, optimize performance and seamlessly integrate with Genie for a unified analytics experience. We’ll also share practical tips on how business users and data teams can better collaborate — ensuring insights are accessible, actionable and aligned to business goals.<\/p>","track":"Analytics and BI","level":"Beginner","type":"Breakout","industry":["Enterprise Technology"],"category":["AI\/BI, Databricks SQL"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Rory Jacobs","company":"Databricks","job_title":"Sr. Manager, Engineering","bio":"Leading the Lakeview effort at Databricks, focusing on helping businesses around the world solve hard problems and make better decisions using data and AI with as little effort as possible. Problem spaces include building world-class visualizations as well as reporting, dashboarding, and analysis experiences. Ultimately we want everyone in every business in the world to be able to benefit from the power of data!","image":{}},{"name":"Eason Gao","company":"Databricks","job_title":"Product Manager","bio":"Eason is a Product Manager at Databricks who loves turning complex data into easy-to-understand and interactive dashboard. He's passionate about making data make sense for everyone. When he's not at work, you can find him up early watching Formula 1 races or standing in line at the best ramen shop in town.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/whats-new-and-whats-next-building-impactful-aibi-dashboards","alias":"\/data-ai-summit-2025\/session\/whats-new-and-whats-next-building-impactful-aibi-dashboards","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535778+00:00"}
{"id":"D25B3131DBX","title":"What’s New with Databricks Assistant: From Exploration to Production","description":"<p>Databricks Assistant helps you get from initial exploration all the way to production faster and easier than ever. In this session, we'll show you how Assistant simplifies and accelerates common workflows, boosting your productivity across notebooks and the SQL editor. You'll get practical tips, see end-to-end examples in action, and hear about the latest capabilities we're excited about. We'll also discuss how we're continually improving Assistant to make your development experience faster, more contextual and more customizable. Join us to discover how to get the most out of Databricks Assistant and empower your team to build better and faster.<\/p>","track":"Analytics and BI","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["AI\/BI, Databricks SQL"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Samantha Banchik","company":"Databricks","job_title":"Product Manager","bio":"Samantha Banchik is a Product Manager at Databricks, focusing on DatabricksIQ and Databricks Assistant. She holds a Bachelor's degree in Computer Science from the University of California, Berkeley. Samantha brings a strong background in software engineering and product management, with previous roles in developer tooling, cloud security, and autonomous vehicles.","image":{}},{"name":"Gal Oshri","company":"Databricks","job_title":"Sr. Staff Product Manager","bio":"Gal has been building AI products for the past decade. At Databricks, he works on the Databricks Assistant, helping make it a useful tool for all users across the platform. Previously, he worked on machine learning products at AWS (SageMaker Training), Google (TensorFlow), and Microsoft (ML.NET), contributing to tools used by developers and data scientists around the world.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Gal_Oshri_1744925248677001mqVS.jpg?h=a153c742&itok=0989Vteg","alt":"Gal Oshri"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/whats-new-databricks-assistant-exploration-production","alias":"\/data-ai-summit-2025\/session\/whats-new-databricks-assistant-exploration-production","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535801+00:00"}
{"id":"D25L1441","title":"You Mean I Can Talk to My Data? Reimagining How KPMG Engages Data Using AI|BI Genie","description":"<p>“I don’t want to spend time filtering through another dashboard — I just need an answer now.”<\/p><p> <\/p><p>We’ve all experienced the frustration of wading through dashboards, yearning for immediate answers. Traditional reports and visualizations, though essential, often complicate the process for decision-makers. The digital enterprise demands a shift towards conversational, natural language interactions with data.<\/p><p> <\/p><p>At KPMG, AI|BI Genie is reimagining our approach by allowing users to inquire about data just as they would consult a knowledgeable colleague, obtaining precise and actionable insights instantly. Discover how KPMG’s Contract to Cash team leverages AI|BI Genie to enhance data engagement, drive insights and foster business growth.<\/p><p> <\/p><p>Join us to see AI|BI Genie in action and learn how you can transform your data interaction paradigm.<\/p>","track":"Analytics and BI","level":"Beginner","type":"Lightning Talk","industry":["Professional Services, Retail and CPG - Food, Financial Services"],"category":["AI\/BI, DLT, Unity Catalog"],"areas_of_interest":["Catalogs, Data Intelligence, Getting started with Databricks"],"delivery":["In Person"],"speakers":[{"name":"Dennis Tally","company":"KPMG LLP (HQ)","job_title":"Managing Director","bio":"Dennis is Managing Director, Enterprise Data Services (EDS) at KPMG US responsible for data strategy, architecture, and innovation. He provides direction and guidance over the data supply chain, data solution architecture, and enterprise information model. He initiated data and analytics cloud transformation shortly after joining the KPMG in 2020 and is unlocking value through data enabling governed data and analytic capabilities needed to ensure trusted growth of the firm. ","image":{}}],"day":"Tuesday","room":"Theater 5","starts":"2025-06-10T18:30:00","ends":"2025-06-10T18:50:00","starts_pst":"2025-06-10T11:30:00","ends_pst":"2025-06-10T11:50:00","start_time":"6:30 pm","end_time":"6:50 pm","pst_start_time":"11:30 am","pst_end_time":"11:50 am","duration":"20","path":"\/session\/you-mean-i-can-talk-my-data-reimagining-how-kpmg-engages-data-using","alias":"\/data-ai-summit-2025\/session\/you-mean-i-can-talk-my-data-reimagining-how-kpmg-engages-data-using","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535818+00:00"}
{"id":"D25B2077","title":"Your Wish is AI Command — Get to Grips With Databricks Genie","description":"<p>Picture the scene — you're exploring a deep, dark cave looking for insights to unearth when, in a burst of smoke, Genie appears and offers you not three but unlimited data wishes. This isn't a folk tale, it's the growing wave of Generative BI that is going to be a part of analytics platforms.<\/p><p> <\/p><p>Databricks Genie is a tool powered by a SQL-writing LLM that redefines how we interact with data. We'll look at the basics of creating a new Genie room, scoping its data tables and asking questions. We'll help it out with some complex pre-defined questions and ensure it has the best chance of success. We'll give the tool a personality, set some behavioural guidelines and prepare some hidden easter eggs for our users to discover.<\/p><p> <\/p><p>Generative BI is going to be a fundamental part of the analytics toolset used across businesses. If you're using Databricks, you should be aware of Genie, if you're not, you should be planning your Generative BI Roadmap, and this session will answer your wishes.<\/p>","track":"Analytics and BI","level":"Beginner","type":"Breakout","industry":["Enterprise Technology, Retail and CPG - Food, Financial Services"],"category":["AI\/BI, Databricks SQL"],"areas_of_interest":["Generative AI (LLMs), Open Source, SQL, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Simon Whiteley","company":"Advancing Analytics","job_title":"CTO","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/your-wish-ai-command-get-grips-databricks-genie","alias":"\/data-ai-summit-2025\/session\/your-wish-ai-command-get-grips-databricks-genie","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535822+00:00"}
