{"id":"D25B3083","title":"Accelerating Growth in Capital Markets: Data-Driven Strategies for Success","description":"<p>Growth in capital markets thrives on innovation, agility and real-time insights. This session highlights how leading firms use Databricks’ Data Intelligence Platform to uncover opportunities, optimize trading strategies and deliver personalized client experiences.<\/p><p> <\/p><p>Learn how advanced analytics and AI help organizations expand their reach, improve decision-making and unlock new revenue streams. Industry leaders share how unified data platforms break down silos, deepen insights and drive success in a fast-changing market.<\/p><p> <\/p><p>Key takeaways:<\/p><ul>\t<li>Predictive analytics and machine learning strategies for growth<\/li>\t<li>Real-world examples of optimized trading and enhanced client engagement<\/li>\t<li>Tools to innovate while ensuring operational efficiency<\/li><\/ul><p> <\/p><p>Discover how data intelligence empowers capital markets firms to thrive in today’s competitive landscape!<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Financial Services"],"category":["Data Marketplace, AI\/BI, Delta Sharing"],"areas_of_interest":["Data Intelligence, Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Antoine Amend","company":"Databricks","job_title":"Financial Services Industry Director","bio":null,"image":{}},{"name":"Jimmy Kozlow","company":"Northern Trust","job_title":"CDO - Wealth Management","bio":null,"image":{}},{"name":"Raul Chavarria","company":"B3 - Bolsa, Brasil e Balcão","job_title":"Software Engineering Manager","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/accelerating-growth-capital-markets-data-driven-strategies-success","alias":"\/data-ai-summit-2025\/session\/accelerating-growth-capital-markets-data-driven-strategies-success","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533688+00:00"}
{"id":"D25B2945","title":"AI in Motion: Build a Roadmap for Impact in Just 30 Minutes\n","description":"<p>This high-velocity workshop is designed for data and AI leaders seeking to rapidly develop a comprehensive AI strategy tailored to their organization's needs. In just 30 minutes, participants will engage in a focused, interactive session that delivers actionable insights and a strategic framework for AI implementation.<\/p><p> <\/p><p>Key components of the workshop include: <\/p><ul>\t<li>Rapid assessment: Quickly evaluate your organization's AI readiness and potential impact areas<\/li>\t<li>Strategic alignment: Align AI initiatives with core business objectives and value creation opportunities<\/li>\t<li>Resource optimization: Identify critical resources, skills and technologies required for successful AI adoption<\/li>\t<li>Risk mitigation: Address key challenges and ethical considerations in AI deployment<\/li>\t<li>Priority areas: Where to focus first to get the best start<\/li><\/ul><p> <\/p><p>By the end of this intensive session, you will have the foundation of a robust AI strategy and guidance on roadmap execution.<\/p>","track":"Data Strategy","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology, Professional Services"],"category":["AI\/BI, Mosaic AI, Unity Catalog"],"areas_of_interest":["AI Agents, Generative AI (LLMs), ML\/LLMOps"],"delivery":["In Person"],"speakers":[{"name":"Lexy Kassan","company":"Databricks","job_title":"Lead Data & AI Strategist","bio":"Lexy Kassan is a Lead Data and AI Strategist at Databricks, overseeing and guiding customer organizations through holistic transformation programmes built on industry trends and best practices. As an Ethicist, Lexy coaches companies on implementing responsible AI and works with public affairs to shape Databricks’ messaging to regulators and lobbyists. Outside of work, Lexy mentors for multiple initiatives supporting underrepresented groups in STEM. She is also the Founder and Host of the Data Science Ethics Podcast in which she delves into the responsibilities and societal ramifications of applying AI across both private and public sectors.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/ai-motion-build-roadmap-impact-just-30-minutes","alias":"\/data-ai-summit-2025\/session\/ai-motion-build-roadmap-impact-just-30-minutes","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533730+00:00"}
{"id":"D25B1385","title":"Beyond Chatbots: Building Autonomous Insurance Applications With Agentic AI Framework","description":"<p>The insurance industry is at the crossroads of digital transformation, facing challenges from market competition and customer expectations. While conventional ML applications have historically provided capabilities in this domain, the emergence of Agentic AI frameworks presents a revolutionary opportunity to build truly autonomous insurance applications.<\/p><p> <\/p><p>We will address issues related to data governance and quality while discussing how to monitor\/evaluate fine-tune models. We'll demonstrate the application of the agentic framework in the insurance context and how these autonomous agents can work collaboratively to handle complex insurance workflows — from submission intake and risk evaluation to expedited quote generation.<\/p><p> <\/p><p>This session demonstrates how to architect intelligent insurance solutions using Databricks Mosaic AI agentic core components including Unity Catalog, Playground, model evaluation\/guardrails, privacy filters, AI functions and AI\/BI Genie.<\/p>","track":"Data Strategy","level":"Intermediate","type":"Breakout","industry":["Financial Services"],"category":["MLFlow, Mosaic AI, Unity Catalog"],"areas_of_interest":["AI Agents, Data Applications, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Amit kumar Jha","company":"Databricks","job_title":"Sr. Delivery Solutions Architect","bio":null,"image":{}},{"name":"Love Bajpai","company":"Travelers","job_title":"VP, Software Engineering","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/beyond-chatbots-building-autonomous-insurance-applications-agentic-ai","alias":"\/data-ai-summit-2025\/session\/beyond-chatbots-building-autonomous-insurance-applications-agentic-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533830+00:00"}
{"id":"D25B2980","title":"Build Your Data and AI Culture","description":"<p>Many studies have indicated that having a strong Data & AI culture helps our businesses be more successful. This can lead to better business performance, becoming more profitable and being more competitive compared to your peer companies as well as attaining and retaining top talent. What does it mean to have a Data & AI culture? It’s the ability for an organization to make data-driven decisions. It means using insights to improve your business results and using data ultimately allows you to enable AI. It tends to be the people that get in the way of having and sustaining an effective Data & AI culture. Do you have people already in your teams that can help you build your Data & AI culture? Can you attract and retain that talent to your organization? Can you help integrate that great talent into your organization to promote a Data & AI culture? It’s also ensuring that you fundamentally change the way you\/your teams\/organizations work.<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Education, Enterprise Technology, Financial Services"],"category":["AI\/BI"],"areas_of_interest":["Collaboration, Getting started with Databricks, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Kathryn Kearney","company":"Databricks","job_title":"Sr.Director Customer Enablement","bio":"Kathryn has been in the Education space of the fast paced Tech industry for 12+ years. Across content and certification portfolio management and development, operations, GTM and offerings, and PMO, her experience is extensive. She has been responsible for helping some of the world's most infamous and fast paced technology companies create and improve the learner experiences.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Headshot%25202023_1745271198644001Ebtc.png?h=3ae8a274&itok=vamoy5jJ","alt":"Kathryn Kearney"}},{"name":"Melanie Botha","company":"Databricks","job_title":"Director, Learning & Enablement APJ","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/build-your-data-and-ai-culture","alias":"\/data-ai-summit-2025\/session\/build-your-data-and-ai-culture","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533883+00:00"}
{"id":"D25L3356","title":"Building Your Talent Pipeline With the Databricks University Alliance","description":"<p>The Databricks University Alliance represents more than 1,000 universities across the globe. Join us to see how you can leverage this network of faculty and students to broaden your talent pipeline to students learning with the latest tools in data and AI from Databricks.<\/p>","track":"Data Strategy","level":"Beginner","type":"Lightning Talk","industry":["Education"],"category":["Apache Spark"],"areas_of_interest":["Collaboration"],"delivery":["In Person"],"speakers":[{"name":"Craig Cumberland","company":null,"job_title":"Program Manager","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/building-your-talent-pipeline-databricks-university-alliance","alias":"\/data-ai-summit-2025\/session\/building-your-talent-pipeline-databricks-university-alliance","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533940+00:00"}
{"id":"D25B2381","title":"Data Drives Dairy: Royal FrieslandCampina's Data-Centric Transformation With Databricks","description":"<ul>\t<li>Key Message: FrieslandCampina aims to be the top performer in dairy by combining 150 years of craftsmanship with data, analytics and AI to address shifting consumer preferences, complex supply chains and mandatory sustainability.<\/li>\t<li>Data & AI-centric vision<\/li>\t<li>Deep Dive: Backbone of data-centric FrieslandCampina\t<ul>\t\t<li>Technology — Fully leverage our global Data Platform on Databricks for high-impact use cases and AI-driven decision-making.<\/li>\t\t<li>Organization — Mature hub & spoke model and data democratization with a data lakehouse approach. Future: Citizen engineers and inner sourcing.<\/li>\t\t<li>Governance & Responsible AI — Unified governance model with Databricks Unity Catalog. Establishing trust in AI & data. Future: Responsible AI as an enabler for success, guiding scalability and innovation.<\/li>\t<\/ul>\t<\/li>\t<li>Closing: Data & AI is the future of FrieslandCampina. Transformation requires courage, leadership, and a shared vision. Every data leader plays a role in this revolution. \"What role will YOU play?\"<\/li><\/ul>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Retail and CPG - Food"],"category":["AI\/BI, Unity Catalog"],"areas_of_interest":["Data Science, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Mayank Srivastava","company":"Royal FrieslandCampina (RFC)","job_title":"DIRECTOR OF DATA\/CDO","bio":"As a Technology leader specializing in Data & Advanced Analytics and Enterprise Integration, I am passionate about unlocking business potential through innovative technology solutions. In my role as Global Director of Architecture and Engineering at FrieslandCampina, I lead a talented team of architects, engineers, and data scientists in designing and implementing a state-of-the-art Data and Analytics platform that delivers business value through BI, AI, and GenAI use cases, seamlessly integrated into our ecosystem. I am also responsible for our Enterprise Integration platform, overseeing the development and management of APIs and integration interfaces that connect the most critical applications across the organization. My focus is on enhancing operational efficiency and ensuring reliable data flow, which is essential for supporting business objectives and driving innovation.","image":{}},{"name":"Joelle van der Bijl","company":"Royal FrieslandCampina (RFC)","job_title":"Chief Data & Analytics Officer","bio":"Joëlle is the Chief Data & Analytics Officer at FrieslandCampina and is passionate about making data approachable and impactful. With 14 years of experience in the FMCG industry, she blends finance, technology, and business transformation to achieve the best results. Joëlle believes data is the key to moving FrieslandCampina forward, from grass to glass. Her goal is simple: to use data and AI to make better decisions every day.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/1a%2520A%2520WEB_1743775852614001oTSx.jpg?h=9f3f68a1&itok=L6Ll5aCP","alt":"Joelle van der Bijl"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/data-drives-dairy-royal-frieslandcampinas-data-centric-transformation","alias":"\/data-ai-summit-2025\/session\/data-drives-dairy-royal-frieslandcampinas-data-centric-transformation","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534020+00:00"}
{"id":"D25B1989","title":"Databricks AI Factory Transforming Seven West Media","description":"<p>The implementation of the Databricks AI Factory enabled Seven West Media to transform its business by accelerating the launch of AI-driven use cases, fostering innovation and reducing time to market. By leveraging a unified data and AI platform, the company achieved better ROI through optimized workflows, improved operational efficiency and scalable machine learning models. The AI Factory empowered data teams to experiment faster, unlocking deeper audience insights that enhanced engagement and content personalization. This transformation positioned Seven West Media as a leader in AI-driven media, driving measurable business impact and future-proofing its data strategy.<\/p>","track":"Data Strategy","level":"Intermediate","type":"Breakout","industry":["Media and Entertainment"],"category":["Delta Lake, MLFlow, Unity Catalog"],"areas_of_interest":["Data Science, Machine Learning, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Andrew Brain","company":"Seven West Media","job_title":"Director, Data & Growth","bio":"Andrew Brain is Director of Audience Intelligence & Growth at Seven West Media, where he leads innovation through the AI Factory and 7REDiQ. The AI Factory, developed with Databricks, drives generative AI and machine learning across the business, making real-time insights accessible through natural language tools. He also leads 7REDiQ, Seven’s advanced audience intelligence platform that provides deep data insights and predicts audience behavior with up to 95% accuracy. Andrew is a board member of IAB Australia and a mentor in the media and data sectors, playing a key role in shaping the future of AI-driven media and marketing in Sydney, Australia.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Screenshot%25202025-04-11%2520100747_1745370433101001A64a.png?h=b4e301e9&itok=a9COtorB","alt":"Andrew Brain"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/databricks-ai-factory-transforming-seven-west-media","alias":"\/data-ai-summit-2025\/session\/databricks-ai-factory-transforming-seven-west-media","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534067+00:00"}
{"id":"D25B3286DBX","title":"Databricks Apps: Turning Data and AI Into Practical, User-Friendly Applications","description":"<p>In this session, we present an overview of the GA release of Databricks Apps, the new app hosting platform that integrates all the Databricks services necessary to build production-ready data and AI applications. With Apps, data and developer teams can build new interfaces into the data intelligence platform, further democratizing the transformative power of data and AI across the organization. We'll cover common use cases, including RAG chat apps, interactive visualizations and custom workflow builders, as well as look at several best practices and design patterns when building apps. Finally, we'll look ahead with the vision, strategy and roadmap for the year ahead.<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Enterprise Technology, Professional Services"],"category":["Databricks Apps"],"areas_of_interest":["Data Applications, Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Justin DeBrabant","company":null,"job_title":"Director of Product, Apps","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/databricks-apps-turning-data-and-ai-practical-user-friendly","alias":"\/data-ai-summit-2025\/session\/databricks-apps-turning-data-and-ai-practical-user-friendly","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534071+00:00"}
{"id":"D25B1823","title":"Databricks on Databricks: Powering Marketing Insights with Lakehouse","description":"<p>This presentation outlines the evolution of our marketing data strategy, focusing on how we’ve built a strong foundation using the Databricks Lakehouse. We will explore key advancements across data ingestion, strategy, and insights, highlighting the transition from legacy systems to a more scalable and intelligent infrastructure. Through real-world applications, we will showcase how unified Customer 360 insights drive personalization, predictive analytics enhance campaign effectiveness, and GenAI optimizes content creation and marketing execution. Looking ahead, we will demonstrate the next phase of our CDP, the shift toward an end-user-first analytics model powered by AIBI, Genie and Matik, and the growing importance of clean rooms for secure data collaboration. This is just the beginning, and we are poised to unlock even greater capabilities in the future.<\/p>","track":"Data Strategy","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["AI\/BI, LakeFlow, Unity Catalog"],"areas_of_interest":["Customer Data Platform, Data Intelligence, Thought Leadership, Marketing"],"delivery":["In Person"],"speakers":[{"name":"Elizabeth Dobbs","company":"Databricks","job_title":"Sr. Dir, Marketing Tech + Growth","bio":null,"image":{}},{"name":"Anoop Muraleedharan","company":"Databricks","job_title":"Sr Director Marketing Analytics","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/databricks-databricks-powering-marketing-insights-lakehouse","alias":"\/data-ai-summit-2025\/session\/databricks-databricks-powering-marketing-insights-lakehouse","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534095+00:00"}
{"id":"D25B3057","title":"Democratizing Data in a Regulated Industry: Best Practices and Outcomes With J.P. Morgan Payments","description":"<p>Join our 2024 Databricks Disruptor award winners for a session on how they leveraged the Databricks and AWS platforms to build an internal technology marketplace in the highly regulated banking industry empowering end-users to innovate and own their data sets while maintaining strict compliance. In this talk, leaders from the J.P. Morgan Payments Data team share how they’ve done it — from keeping customer needs at the center of all decision-making to promoting a culture of experimentation. They’ll also expand upon how J.P. Morgan Payments products team now leverages the data platform they’ve built to create customer products including Cash Flow Intelligence.<\/p>","track":"Data Strategy","level":"Intermediate","type":"Breakout","industry":["Financial Services"],"category":["Databricks SQL, Unity Catalog"],"areas_of_interest":["Data Intelligence"],"delivery":["In Person"],"speakers":[{"name":"Narayan Raj","company":"J.P.Morgan","job_title":"Chief Data Officer - JP Morgan Payments","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/democratizing-data-regulated-industry-best-practices-and-outcomes-jp","alias":"\/data-ai-summit-2025\/session\/democratizing-data-regulated-industry-best-practices-and-outcomes-jp","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534157+00:00"}
{"id":"D25B1792","title":"Developing the Dreamers of Data + AI’s Future: How 84.51˚ builds upskilling to accelerate adoption","description":"<p>“Once an idea has taken hold of the brain it's almost impossible to eradicate. An idea that is fully formed — fully understood — that sticks, right in there somewhere.”<\/p><p> <\/p><p>The Data Scientists and Engineers at 84.51˚  utilize the Databricks Lakehouse for a wide array of tasks, including data exploration, analysis, machine learning operations, orchestration, automated deployments and collaboration. <\/p><p> <\/p><p>In this talk, 84.51˚’s Data Science Learning Lead, Michael Carrico, will share their approach to upskilling a diverse workforce to support the company’s strategic initiatives. This approach includes creating tailored learning experiences for a variety of personas using content curated in partnership with Databricks’ educational offerings. Then he will demonstrate how he puts his 11 years of data science and engineering experience to work by using the Databricks Lakehouse not just as a subject, but also as a tool to create impactful training experiences and a learning culture at 84.51˚.<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Retail and CPG - Food"],"category":["Apache Spark, AI\/BI, Unity Catalog"],"areas_of_interest":["Collaboration, Data Science, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Michael Carrico","company":"84.51°","job_title":"Data Science L&D Director","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/developing-dreamers-data-ais-future-how-8451-builds-upskilling","alias":"\/data-ai-summit-2025\/session\/developing-dreamers-data-ais-future-how-8451-builds-upskilling","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534180+00:00"}
{"id":"D25B1941","title":"Driving Databricks Platform With Revenue Intelligence ROI","description":"<p>Demonstrating a real ROI is key to driving executive and stakeholder buy-in for major technology changes. At Veeam, we aligned our Databricks Platform change with projects to increase sales pipeline and improve customer retention. By delivering targeted improvements on those critical business metrics, we created positive ROI in short order while at the same time setting the foundation for long term Databricks Platform success. This session targets data and business leaders looking to understand how they can turn their infrastructure change into a business revenue driver.<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Enterprise Technology"],"category":["AI\/BI, LakeFlow, Unity Catalog"],"areas_of_interest":["Data Intelligence, Getting started with Databricks, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Joel Fuernsinn","company":"Veeam","job_title":"Senior Director, Data Management","bio":"Joel Fuernsinn is the Sr. Director of Data Management at Veeam, the world leader in data backup and resilience. With over two decades of industry experience in software and consulting, his expertise is in building and scaling enterprise data capabilities for both data teams and infrastructure. At Veeam, his work drives data strategy to mature overall data capabilities in Data Engineering, ML, and AI, and leverages those capabilities to grow Veeam’s business. ","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Joel_Fuernsinn_1744572115482001BD68.png?h=f5652cad&itok=eSp7Neh6","alt":"Joel Fuernsinn"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/driving-databricks-platform-revenue-intelligence-roi","alias":"\/data-ai-summit-2025\/session\/driving-databricks-platform-revenue-intelligence-roi","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534193+00:00"}
{"id":"D25B1635","title":"Dusting off the Cobwebs — Moving off a 26-year-old Heritage Platform to Databricks [Teradata]","description":"<p>Join us to hear about how National Australia Bank (NAB) successfully completed a significant milestone in its data strategy by decommissioning its 26-year-old Teradata environment and migrating to a new strategic data platform called 'Ada'. This transition marks a pivotal shift from legacy systems to a modern, cloud-based data and AI platform powered by Databricks.<\/p><p> <\/p><p>The migration process, which spanned two years, involved ingesting 16 data sources, transferring 456 use cases, and collaborating with hundreds of users across 12 business units.<\/p><p> <\/p><p>This strategic move positions NAB to leverage the full potential of cloud-native data analytics, enabling more agile and data-driven decision-making across the organization. The successful migration to Ada represents a significant step forward in NAB's ongoing efforts to modernize its data infrastructure and capitalize on emerging technologies in the rapidly evolving financial services landscape<\/p>","track":"Data Strategy","level":"Intermediate","type":"Breakout","industry":["Financial Services"],"category":["Databricks SQL, DLT, Unity Catalog"],"areas_of_interest":["ETL, Migrations, Streaming pipelines"],"delivery":["In Person"],"speakers":[{"name":"Joanna Gurry","company":"NAB","job_title":"Data Platforms Executive","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/dusting-cobwebs-moving-26-year-old-heritage-platform-databricks","alias":"\/data-ai-summit-2025\/session\/dusting-cobwebs-moving-26-year-old-heritage-platform-databricks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534204+00:00"}
{"id":"D25B2765","title":"Evolving Data Insights With Privacy at Mastercard","description":"<p>Mastercard is a global technology company whose role is anchored in trust. It supports 3.4 billion cards and over 143 billion transactions annually. To address customers’ increasing data volume and complex privacy needs, Mastercard has developed a novel service atop Databricks’ Clean Rooms and broader Data Intelligence Platform. This service combines several Databricks components with Mastercard’s IP, providing an evolved method for data-driven insights and value-added services while ensuring a unique standalone turnkey service.<\/p><p> <\/p><p>The result is a secure environment where multiple parties can collaborate on sensitive data without directly accessing each other’s information. After this session, attendees will understand how Mastercard used its expertise in privacy-enhancing technologies to create collaboration tools powered by Databricks’ Clean Rooms, AI\/BI, Apps, Unity Catalog, Workflows and DatabricksIQ — as well as how to take advantage of this new privacy-enhancing service directly. <\/p>","track":"Data Strategy","level":"Intermediate","type":"Breakout","industry":["Health and Life Sciences, Public Sector, Financial Services"],"category":["Delta Sharing, Unity Catalog, Databricks Apps"],"areas_of_interest":["Collaboration, Thought Leadership, Security & Compliance"],"delivery":["In Person"],"speakers":[{"name":"Spencer Cook","company":"Databricks","job_title":"Lead Solutions Architect","bio":"Spencer Cook, M.S., is a Data Professional with experience delivering end-to-end analytics solutions in the cloud to iconic brands. Since 2021, Spencer has been a Financial Services Solutions Architect at Databricks focused on revolutionizing the industry with Lakehouse Architecture. Spencer lives in Chicago with 2 cats named Bruce and LeBron. ","image":{}},{"name":"John Derrico","company":"Mastercard","job_title":"VP Data Strategy","bio":"John is responsible for the enterprise data strategy for alternative data and ensuring responsible data innovation at Mastercard through privacy enhancing technologies to create the next generation of products and solutions.  He has delivered data products for startups and fortune 500 clients in clinical, retail, financial and payments industries. John is a Six Sigma Black belt and a certified snowboard instructor based out of Stratton VT.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/evolving-data-insights-privacy-mastercard","alias":"\/data-ai-summit-2025\/session\/evolving-data-insights-privacy-mastercard","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534278+00:00"}
{"id":"D25B3085","title":"Financial Services Industry Forum: Shifting to Financial Intelligence","description":"<p>Join the 60-minute kickoff session at the Financial Services Forum to explore how data and AI transform finance. Featuring keynotes from top innovators in banking, capital markets, and insurance and exciting announcements from Databricks, this event offers invaluable insights.<\/p><p>What to expect:<\/p><ul>\t<li>Business imperatives: Learn how institutions drive growth, reduce risk and boost efficiency with data intelligence<\/li>\t<li>Transformative vision: See how Databricks enhances fraud prevention, automates processes and personalizes experiences<\/li>\t<li>Cutting-edge insights: Discover the latest trends in data-driven finance<\/li>\t<li>Customer success stories: Hear how global leaders leverage data and AI for a competitive edge<\/li><\/ul><p> <\/p><p>Connect with C-suite executives and industry pioneers shaping financial services. Leave with actionable strategies to drive growth, ensure compliance and transform your organization through intelligence-driven decisions!<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Financial Services"],"category":["Data Marketplace, AI\/BI, Mosaic AI"],"areas_of_interest":["AI Agents, Thought Leadership, Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Junta Nakai","company":"Databricks","job_title":"Financial Services, Cyber, Public Sector","bio":"Junta Nakai is the VP, Global Head of Financial Services and Sustainability at Databricks. In his capacity, he is responsible for driving the world wide adoption of the Lakehouse Platform across Capital Markets, Banking\/Payments, Insurers and Data Providers as well as the advancement of Sustainability Use-Cases across all verticals. Prior to joining Databricks, Junta spent 14 years at Goldman Sachs, in various leadership roles in the Equities Division.","image":{}},{"name":"Neema Raphael","company":"Goldman Sachs","job_title":"Partner, Chief Data Officer, Head of Data Engineering","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"60","path":"\/session\/financial-services-industry-forum-shifting-financial-intelligence","alias":"\/data-ai-summit-2025\/session\/financial-services-industry-forum-shifting-financial-intelligence","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534293+00:00"}
{"id":"D25L2080","title":"From Overwhelmed to Empowered: How SAP is Democratizing Data & AI with Databricks to Solve Problems","description":"From Overwhelmed to Empowered - How SAP is Democratizing Data & AI to Solve Real Business Problems with Databricks: Scaling the adoption of Data & AI within enterprises is critical for driving transformative business outcomes. Learn how the SAP Experience Garage, SAP’s largest internal enablement and innovation driver, is turning all employees into data enthusiast through the integration of Databricks technologies. The SAP Experience Garage platform brings together colleagues with various levels of data knowledge and skills in one seamless space. Here, they can explore and use tangible datasets and data science\/AI tooling from Databricks, enablement capabilities, and collaborative features to tackle real business-related challenges and create prototypes that find their way into SAP’s ecosystem.","track":"Data Strategy","level":"Beginner","type":"Lightning Talk","industry":["Education, Enterprise Technology"],"category":["Delta Lake, MLFlow, Unity Catalog"],"areas_of_interest":["Collaboration, Getting started with Databricks, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Sabrina Childress","company":"SAP SE","job_title":"Technology & Innovation Manager","bio":"Born and raised in Heidelberg, Germany, Sabrina Childress joined SAP in 2016 while completing her Media and Communication Studies degree at the University of Mannheim. After 8+ years of driving global brand enablement programs in Marketing, she transitioned into Technology and Innovation, where she helps scale employee-led innovation through a gamified technology platform and community - the SAP Experience Garage. In her role, Sabrina empowers colleagues and partners to apply emerging technologies like data and AI to solve real business challenges. She is also a recurring lecturer at MIT Sloan, where she co-leads an annual Design Thinking Hackathon to tackle real-world problems in collaboration with students, academia, and industry experts.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Business_Chest%2520Up_1745256832465001Gkwq.jpg?h=753a135a&itok=cVkfCPSb","alt":"Sabrina Childress"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/overwhelmed-empowered-how-sap-democratizing-data-ai-databricks-solve","alias":"\/data-ai-summit-2025\/session\/overwhelmed-empowered-how-sap-democratizing-data-ai-databricks-solve","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534337+00:00"}
{"id":"D25B3086","title":"From Prediction to Prevention: Transforming Risk Management in Insurance\t\t\t\t","description":"Protecting insurers against emerging threats is critical. This session reveals how leading companies use Databricks’ Data Intelligence Platform to transform risk management, enhance fraud detection, and ensure compliance. Learn how advanced analytics, AI, and machine learning process vast data in real time to identify risks and mitigate threats. Industry leaders will share strategies for building resilient operations that protect against financial losses and reputational harm.Key takeaways:AI-powered fraud prevention using anomaly detection and predictive analyticsReal-time risk assessment models integrating IoT, behavioral, and external dataStrategies for robust compliance and governance with operational efficiencyDiscover how data intelligence is revolutionizing insurance risk management and safeguarding the industry’s future.","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Financial Services"],"category":["AI\/BI, Unity Catalog"],"areas_of_interest":["Data Intelligence, Thought Leadership, Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Marcela Granados","company":"Databricks","job_title":"Global Head of Insurance  ProServ","bio":"Marcela is Databricks Global Head of Insurance. She has more than 17 years of experience working in the insurance industry in Commercial, Personal lines, Life & Annuities in all areas across the insurance value chain (Claims, Underwriting, Pricing, Marketing and Actuarial Science). She sets the strategy for the way Databricks engages with its 224 insurance customers. This includes speaking at both Databricks and external conferences, influencing our product roadmap and solution accelerators and running Executive Briefings with senior stakeholders in Databricks customers and prospects.","image":{}},{"name":"Michael Ban","company":"Nationwide","job_title":"AVP, P&C Actuarial Data and Technology","bio":"Michael Ban is the AVP of P&C Finance and Actuarial Data & Technology. In this role, he is responsible for driving the data and technology strategy across the P&C Finance community. He partners closely with our data and technology partners as we modernize our infrastructure and develop consistent approaches across teams. He also works closely with all of our finance and actuarial groups, including management reporting, pricing, reserving, catastrophe management, and our risk and capital teams, to identify opportunities and build solutions.  <br \/>\n<br \/>\n","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/MB%2520Headshot_1745955411661001EHGd.jpg?h=5c2a3040&itok=3eDUxLcR","alt":"Michael Ban"}},{"name":"David Berglund","company":"Travelers","job_title":"Head of Data & Analytics","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/prediction-prevention-transforming-risk-management-insurance","alias":"\/data-ai-summit-2025\/session\/prediction-prevention-transforming-risk-management-insurance","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534341+00:00"}
{"id":"D25B3243","title":"How Ad Tech Runs on Databricks","description":"Discover how leading ad tech and mar tech organizations including The Trade Desk, Integral Ad Science and Adobe leverage Databricks to power the advertising and marketing ecosystem.","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Media and Entertainment"],"category":["AI\/BI, Mosaic AI, Unity Catalog"],"areas_of_interest":["Thought Leadership, Marketing, Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Noah Levine","company":"Databricks","job_title":"Global Head, Media & Entertainment GTM","bio":"Noah Levine is the Global Head of Media & Entertainment Go To Market at Databricks, leading solution development and engagement for top media organizations. Previously, he was VP of Data Strategy & Advanced Advertising at Warner Bros. Discovery, launching a first-party data platform and data interoperability initiatives. As Chief Revenue Officer at 605, Noah managed sales, marketing, product, services, and strategy. At Fox Networks Group, he launched their first audience advertising product suite and helped form OpenAP, a consortium focused on audience advertising. Earlier in his career, he worked at Adobe, Google, and DoubleClick, starting in 2000. Noah holds a Bachelor of Science in Computer Science from Northwestern University.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/how-ad-tech-runs-databricks","alias":"\/data-ai-summit-2025\/session\/how-ad-tech-runs-databricks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534450+00:00"}
{"id":"D25B3244","title":"How Adobe Extracts Value From Cata With Agentic AI-Powered Data and Analytics Engineering Workbench","description":"<p>Discover how an AI-first, agentic solution is redefining the Data Development and Delivery Lifecycle (DDLC). This next-generation engineering workbench equips data engineers, analysts and practitioners with intelligent automation, context-aware guidance and collaborative capabilities to accelerate and streamline every stage of the data lifecycle — from business use case definition to actionable insights. By embedding agentic AI across the workflow, the platform significantly enhances development speed, quality and delivery efficiency, enabling organizations to realize data and analytics outcomes faster and with greater confidence.<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Media and Entertainment"],"category":["MLFlow, Databricks SQL, Mosaic AI"],"areas_of_interest":["Thought Leadership, Marketing, Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Noah Levine","company":"Databricks","job_title":"Global Head, Media & Entertainment GTM","bio":"Noah Levine is the Global Head of Media & Entertainment Go To Market at Databricks, leading solution development and engagement for top media organizations. Previously, he was VP of Data Strategy & Advanced Advertising at Warner Bros. Discovery, launching a first-party data platform and data interoperability initiatives. As Chief Revenue Officer at 605, Noah managed sales, marketing, product, services, and strategy. At Fox Networks Group, he launched their first audience advertising product suite and helped form OpenAP, a consortium focused on audience advertising. Earlier in his career, he worked at Adobe, Google, and DoubleClick, starting in 2000. Noah holds a Bachelor of Science in Computer Science from Northwestern University.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/how-adobe-extracts-value-cata-agentic-ai-powered-data-and-analytics","alias":"\/data-ai-summit-2025\/session\/how-adobe-extracts-value-cata-agentic-ai-powered-data-and-analytics","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534453+00:00"}
{"id":"D25B1533","title":"How Should Enterprises Tackle AI, Agents and Data Cloud With Databricks?","description":"<p>In this session we will cover how enterprises can build and buy solutions for AI, Agents and Data Coud. Databricks provides a data cloud platform and foundational layer. Companies have good established choices for public or hybrid cloud for compute, GPU, network, storage, and microservices. We will discuss Gen AI platform and Agents OS platform as next foundational layers on top of Data Cloud to support third-party AI apps or internally-developed AI apps. Users and organizations need Killer AI & Agent apps to realize the promise and vision of AI and ROI.<\/p>","track":"Data Strategy","level":"Intermediate","type":"Breakout","industry":["Health and Life Sciences"],"category":["AI\/BI, Mosaic AI, Unity Catalog"],"areas_of_interest":["AI Agents, Customer Data Platform, Data Intelligence"],"delivery":["In Person"],"speakers":[{"name":"Murali Vridhachalam","company":"Gilead Sciences","job_title":"VP & Head of Cloud, Data, and Analytics","bio":"Mr. Murali Vridhachalam is the Vice President and Head of Cloud, Data, & Analytics in the IT organization at Gilead. In his current role, Murali is responsible for the Enterprise Cloud Platform, Data & AI platform, Data Governance, AI Governance automation, R&D Data & Analytics, Pharmaceutical Development & Manufacturing (PDM) Data & Analytics, Commercial Data & Analytics, IT Strategy, and Enterprise Architecture. He harnesses the convergence of Cloud, Data, and Analytics to drive business value. With over 25 years of experience in IT,  Murali has a proven track record of leadership and innovation. Prior to joining Gilead in 2021, he was a technical executive at IBM.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Murali_Headshot_1745448889564001madx.png?h=c25c70c9&itok=_ZLnuEUe","alt":"Murali Vridhachalam"}},{"name":"Muddu Sudhakar","company":"Aisera","job_title":"Founder & Investor","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/how-should-enterprises-tackle-ai-agents-and-data-cloud-databricks","alias":"\/data-ai-summit-2025\/session\/how-should-enterprises-tackle-ai-agents-and-data-cloud-databricks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534509+00:00"}
{"id":"D25B2338","title":"Integrating AI With Data: A Unified Strategy for Business","description":"<p>In the modern business landscape, AI and data strategies can no longer operate in isolation. To drive meaningful outcomes, organizations must align these critical components within a unified framework tied to overarching business objectives. This presentation explores the necessity of integrating AI and data strategies, emphasizing the importance of high-quality data, scalable architectures and robust governance. <\/p><p> <\/p><p>Attendees will learn three essential steps that need to be taken: <\/p><ul>\t<li>Recognize that AI requires the right data to succeed<\/li>\t<li>Prioritize data quality and architecture<\/li>\t<li>Establish strong governance practices<\/li><\/ul><p> <\/p><p>Additionally, the talk will highlight the cultural shift required to bridge IT and business silos, fostering roles that combine technical and business expertise. We’ll dive into specific practical steps that can be taken to ensure an organization has a cohesive and blended AI and data strategy, using specific case examples.<\/p>","track":"Data Strategy","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology, Financial Services"],"category":["AI\/BI"],"areas_of_interest":["Data Applications, Data Science, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"David Crolene","company":"EXL","job_title":"Vice President of Data, Analytics & AI","bio":"David leads transformative initiatives that redefine client value across various industries. With over 25 years of experience, David has deep expertise in leveraging data, analytics and AI to drive business results. <br \/>\nBefore joining EXL, David served as Partner and Vice President of Delivery at Datasource Consulting. He also led significant data warehouse projects at Sony Electronics, Pfizer, and Teradata as a Senior Solution Architect.<br \/>\n<br \/>\nDavid began his career in consulting roles at Infowise Solutions and MicroStrategy, where he developed enterprise Data Warehouse and Business Intelligence solutions. His early experience includes cost analysis and financial reconciliation for government programs at Management Consulting & Research, Inc.<br \/>\n<br \/>\nDavid holds an MS in Systems Management from USC and a BS in Mechanical Engineering from UC Santa Barbara. He is a published author, patent holder, and holds certifications in Teradata, Informatica, and AI business strategy.<br \/>\n<br \/>\n","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Dave-Crolene-Headshot-EXL_1738615401356001eeFi.jpg?h=7fb9a623&itok=woyKu4_H","alt":"David Crolene"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/integrating-ai-data-unified-strategy-business","alias":"\/data-ai-summit-2025\/session\/integrating-ai-data-unified-strategy-business","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534582+00:00"}
{"id":"D25B2823","title":"Learning from Goldman Sachs' Legend Lakehouse for Data Governance","description":"<p>Data is the backbone of modern decision-making, but centralizing it is only the tip of the iceberg. Entitlements, secure sharing and just-in-time availability are critical challenges to any large-scale platform. Join Goldman Sachs as we reveal how our Legend Lakehouse, coupled with Databricks, overcomes these hurdles to deliver high-quality, governed data at scale. By leveraging an open table format (Apache Iceberg) and open catalog format (Unity Catalog), we ensure platform interoperability and vendor neutrality. Databricks Unity Catalog then provides a robust entitlement system that aligns with our data contracts, ensuring consistent access control across producer and consumer workspaces. Finally, Legend functions, integrating with Databricks User Defined Functions (UDF), offer real-time data enrichment and secure transformations without exposing raw datasets. Discover how these components unite to streamline analytics, bolster governance and power innovation.<\/p>","track":"Data Strategy","level":"Intermediate","type":"Breakout","industry":["Financial Services"],"category":["Apache Spark, Apache Iceberg, Unity Catalog"],"areas_of_interest":["Catalogs, Open Source, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Tim Smith","company":"Goldman Sachs","job_title":"Managing Director","bio":"Tim is global head of the Data Design and Curation team within Data Engineering in Goldman Sachs.<br \/>\n<br \/>\nPreviously, Tim was global head of the Equities Data Platform team. Prior to that, he worked in the Equities Strat team in the Securities Division from 2003 to 2015, including managing the Equities Volatility and Synthetic Products Group Strat teams.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/tim-smith_1738878812557001rVr0.jpg?h=dd4e7f41&itok=h8XhHBcm","alt":"Tim Smith"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/learning-goldman-sachs-legend-lakehouse-data-governance","alias":"\/data-ai-summit-2025\/session\/learning-goldman-sachs-legend-lakehouse-data-governance","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534682+00:00"}
{"id":"D25B3242","title":"Media and Advertising Industry Forum","description":"<p>Join us at the Media & Advertising Forum to explore how data and AI are transforming media and advertising from content to creative and identity to outcomes. Featuring innovators from leading agencies, platforms, streamers and ad tech — plus exciting announcements from Databricks — this session delivers must-have insights for industry leaders and change agents.<\/p><p> <\/p><p>What to expect:<\/p><ul>\t<li>Business imperatives: Learn how media and advertising organizations navigate and grow through secular change leveraging Data + AI. Databricks leaders and customers will share how data intelligence is powering the next wave of innovation<\/li>\t<li>Future trends in Media & Advertising: Learn how data + AI will continue to shape the future of monetization, real-time personalization and intelligent storytelling<\/li>\t<li>Customer success stories: Discover how top media and advertising companies are using data intelligence to unlock new creative potential, increase agility and grow revenue<\/li><\/ul>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Media and Entertainment"],"category":["AI\/BI, Databricks SQL, Mosaic AI"],"areas_of_interest":["Thought Leadership, Marketing, Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Noah Levine","company":"Databricks","job_title":"Global Head, Media & Entertainment GTM","bio":"Noah Levine is the Global Head of Media & Entertainment Go To Market at Databricks, leading solution development and engagement for top media organizations. Previously, he was VP of Data Strategy & Advanced Advertising at Warner Bros. Discovery, launching a first-party data platform and data interoperability initiatives. As Chief Revenue Officer at 605, Noah managed sales, marketing, product, services, and strategy. At Fox Networks Group, he launched their first audience advertising product suite and helped form OpenAP, a consortium focused on audience advertising. Earlier in his career, he worked at Adobe, Google, and DoubleClick, starting in 2000. Noah holds a Bachelor of Science in Computer Science from Northwestern University.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"60","path":"\/session\/media-and-advertising-industry-forum","alias":"\/data-ai-summit-2025\/session\/media-and-advertising-industry-forum","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534776+00:00"}
{"id":"D25B3096","title":"Meeting Global Electricity Demands: The Strategic Role of Nuclear and Hydro","description":"<p>Join us for a groundbreaking session featuring two pioneers at the forefront of AI and data innovation in the energy sector: Westinghouse Electric Company and Hydro-Quebec. In the first segment, we'll explore AI's crucial role in enhancing safety, efficiency and compliance in nuclear operations through technologies like HiVE and Bertha, focusing on the unique reliability and credibility requirements of the regulated nuclear industry. Following this, Hydro-Quebec will demonstrate how they're tackling growing energy demands through innovative hierarchical forecasting systems that process terabytes of IoT sensor data across multiple levels. Their bottom-up approach leverages distributed computing paradigms and MLOps principles to train models on millions of time series datasets, ensuring grid efficiency and resilience.<\/p><p> <\/p><p>Together, these presentations showcase how AI and advanced data systems are transforming critical infrastructure management across the energy sector.<\/p>","track":"Data Strategy","level":"Intermediate","type":"Breakout","industry":["Energy and Utilities"],"category":["AI\/BI, Unity Catalog"],"areas_of_interest":["Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Lou Martinez Sancho","company":"Westinghouse Electric Company","job_title":"CTO, EVP R&D and Innovation","bio":null,"image":{}},{"name":"Julien Witty","company":"Hydro Quebec","job_title":"ML Engineer","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/meeting-global-electricity-demands-strategic-role-nuclear-and-hydro","alias":"\/data-ai-summit-2025\/session\/meeting-global-electricity-demands-strategic-role-nuclear-and-hydro","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534781+00:00"}
{"id":"D25B3253","title":"Public Sector Industry Forum","description":"<p>Join the 60-minute kickoff session at the Public Sector Forum for an opportunity to to accelerate innovation into your enterprise through governance, compliance and GenAI. Featuring keynotes from data-driven agency leaders and providing a future-looking journey from Databricks, this event offers invaluable insights.<\/p><p> <\/p><p>Understand the outcomes of Data and AI powering transformation across common areas of government and beyond:<\/p><ul>\t<li>Improving constituent experience<\/li>\t<li>Reducing cost and enhancing services<\/li>\t<li>Identifying fraud, waste and abuse<\/li>\t<li>Achieving scale and security<\/li><\/ul><p> <\/p><p>You will not want to miss this exclusive opportunity to own your data and eliminate government silos. Discover the Data + AI Company with deep compliance experience and widespread adoption.<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Education, Public Sector"],"category":["Delta Lake, Mosaic AI, Unity Catalog"],"areas_of_interest":["Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Mike Daniels","company":"Databricks","job_title":"VP and GM, Public Sector","bio":"Innovative and accomplished technology executive with a proven track record of success in managing, directing and contributing to large and small organizations. My objective is to make a significant impact for my company and my team.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/MikeDaniels-2019-5_1744989397156001oZ6x.jpg?h=468ef699&itok=XorrqGZN","alt":"Mike Daniels"}},{"name":"Todd Schroeder","company":"Databricks","job_title":"VP, Federal Government","bio":"Strategic Vision: Forward-looking strategic mindset with ability to define clear vision and then translate technology strategy into action.<br \/>\n Innovative Leadership: Dynamic, collaborative leader that inspires and energizes technical teams. Adept at infusing new talent and cultivating internal IT teams committed to excellence and integrity. Can foster environments of innovation and ingenuity by blending control with creative freedom.<br \/>\nCommunications: Aptitude for driving stakeholder engagement through active listening, clear communications, and focus on gaining business perspective and probing for better way to deliver solutions.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/ToddSchroeder-3-e_1745004239869001BQmw.jpg?h=4b07008b&itok=tozoxM0C","alt":"Todd Schroeder"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/public-sector-industry-forum","alias":"\/data-ai-summit-2025\/session\/public-sector-industry-forum","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534911+00:00"}
{"id":"D25B3240","title":"Real World Use Cases in Games for Data and AI","description":"<p>In this breakout session two game developers will be sharing how they tackled challenging use cases for their studios with Databricks. They’ll provide best practices, mental models and technology trade-offs that they explored as they built out their solutions to critical games use cases. Join us and learn more from your peers about what’s working and what isn’t, as they seek to build player-centric experiences.<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Media and Entertainment"],"category":["AI\/BI, Databricks SQL, Mosaic AI"],"areas_of_interest":["Thought Leadership, Industry Experience, Gaming"],"delivery":["In Person"],"speakers":[{"name":"Huntting Buckley","company":"Databricks","job_title":"Global Games GTM Leader","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/real-world-use-cases-games-data-and-ai","alias":"\/data-ai-summit-2025\/session\/real-world-use-cases-games-data-and-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534922+00:00"}
{"id":"D25B3405","title":"Reduce Risk While You Improve Services and Operations","description":"<p>Supporting the scale of Public Sector data and the need to protect sensitive information is essential to public sector organizations.<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Education, Public Sector"],"category":["Databricks Workflows, Databricks Apps"],"areas_of_interest":["Data Intelligence, Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Mike Daniels","company":"Databricks","job_title":"VP and GM, Public Sector","bio":"Innovative and accomplished technology executive with a proven track record of success in managing, directing and contributing to large and small organizations. My objective is to make a significant impact for my company and my team.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/MikeDaniels-2019-5_1744989397156001oZ6x.jpg?h=468ef699&itok=XorrqGZN","alt":"Mike Daniels"}},{"name":"Todd Schroeder","company":"Databricks","job_title":"VP, Federal Government","bio":"Strategic Vision: Forward-looking strategic mindset with ability to define clear vision and then translate technology strategy into action.<br \/>\n Innovative Leadership: Dynamic, collaborative leader that inspires and energizes technical teams. Adept at infusing new talent and cultivating internal IT teams committed to excellence and integrity. Can foster environments of innovation and ingenuity by blending control with creative freedom.<br \/>\nCommunications: Aptitude for driving stakeholder engagement through active listening, clear communications, and focus on gaining business perspective and probing for better way to deliver solutions.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/ToddSchroeder-3-e_1745004239869001BQmw.jpg?h=4b07008b&itok=tozoxM0C","alt":"Todd Schroeder"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/reduce-risk-while-you-improve-services-and-operations","alias":"\/data-ai-summit-2025\/session\/reduce-risk-while-you-improve-services-and-operations","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534952+00:00"}
{"id":"D25B3407","title":"Reinvent Government in an Data Intelligence Era ","description":"<p>To dramatically transform the way citizen services are delivered, organizations must bring all data together — streaming, structured and unstructured — in a secure and governed platform.<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Education, Public Sector"],"category":["Databricks Workflows"],"areas_of_interest":["Data Intelligence, Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Mike Daniels","company":"Databricks","job_title":"VP and GM, Public Sector","bio":"Innovative and accomplished technology executive with a proven track record of success in managing, directing and contributing to large and small organizations. My objective is to make a significant impact for my company and my team.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/MikeDaniels-2019-5_1744989397156001oZ6x.jpg?h=468ef699&itok=XorrqGZN","alt":"Mike Daniels"}},{"name":"Todd Schroeder","company":"Databricks","job_title":"VP, Federal Government","bio":"Strategic Vision: Forward-looking strategic mindset with ability to define clear vision and then translate technology strategy into action.<br \/>\n Innovative Leadership: Dynamic, collaborative leader that inspires and energizes technical teams. Adept at infusing new talent and cultivating internal IT teams committed to excellence and integrity. Can foster environments of innovation and ingenuity by blending control with creative freedom.<br \/>\nCommunications: Aptitude for driving stakeholder engagement through active listening, clear communications, and focus on gaining business perspective and probing for better way to deliver solutions.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/ToddSchroeder-3-e_1745004239869001BQmw.jpg?h=4b07008b&itok=tozoxM0C","alt":"Todd Schroeder"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/reinvent-government-data-intelligence-era","alias":"\/data-ai-summit-2025\/session\/reinvent-government-data-intelligence-era","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534965+00:00"}
{"id":"D25B3110","title":"​​Retail & Consumer Goods Forum: How AI is Transforming How Brands Connect With Consumers","description":"<p>Consumer industries are being transformed by AI as physical and digital experiences converge. In this flagship session for retail, travel, restaurants and consumer goods attendees at Data + AI Summit, Databricks and a panel of industry leaders will explore how real-time data and machine learning are enabling brands to gain deeper consumer insights, personalize interactions and move closer to true 1:1 marketing.<\/p><p> <\/p><p>From AI agents shopping on behalf of consumers to consumer-centric supply chains, discover how the most innovative companies will use AI to reshape customer relationships and drive growth in an increasingly connected world.<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Retail and CPG - Food"],"category":["AI\/BI, Delta Sharing, Databricks Apps"],"areas_of_interest":["Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Francesco Laera","company":"Valentino","job_title":"Global Head of Brand Intelligence, Data & Analytics","bio":null,"image":{}},{"name":"Rob Saker","company":"Databricks","job_title":"Global VP | Consumer Industries GTM","bio":null,"image":{}},{"name":"Sam Sawyer","company":"Databricks","job_title":"Head of Consumer Industries Marketing","bio":"Sam Sawyer leads Industry Marketing at Databricks for Consumer Industries. Her focus is on crafting a compelling and relevant message for today’s savvy technology buyers, developing relationships across the organization to bring the product to life for each industry, and building customer champions whenever she can. Through her career, undergraduate education at UC Berkeley and an MBA from Chicago Booth, she has always thrived on challenges that test her creativity, business-mindset and leadership skills.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/0_1744402930092001xulB.jpg?h=fbf7a813&itok=AAObOgD9","alt":"Sam Sawyer"}},{"name":"Amlan Maitra","company":"PepsiCo","job_title":"SVP, Head of Enterprise Data","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"60","path":"\/session\/retail-consumer-goods-forum-how-ai-transforming-how-brands-connect","alias":"\/data-ai-summit-2025\/session\/retail-consumer-goods-forum-how-ai-transforming-how-brands-connect","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534982+00:00"}
{"id":"D25L2871","title":"Revolutionizing Counterparty Credit Risk (SACCR) – How Morgan Stanley Scaled With Databricks","description":"<p>Learn how Morgan Stanley scaled one of their most significant regulatory calculators (SACCR) by leveraging Databricks for horizontal and vertical scaling. Discover how we harnessed Databricks to improve performance, improve calculation accuracy, regulatory compliance and more.<\/p>","track":"Data Strategy","level":"Intermediate","type":"Lightning Talk","industry":["Financial Services"],"category":["Apache Spark, Delta Lake, Databricks Workflows"],"areas_of_interest":["Customer Data Platform, Data Ingestion, ETL"],"delivery":["In Person"],"speakers":[{"name":"Alistair MacDonald","company":"Morgan Stanley","job_title":"Executive Director","bio":"Alistair Macdonald is an Executive Director at Morgan Stanley, where he leads strategic initiatives and technology delivery across global financial platforms. <br \/>\n<br \/>\nWith over 15 years of experience in software engineering and enterprise architecture, Alistair has built and scaled mission-critical systems that power some of the firm’s most complex finance functions.<br \/>\n<br \/>\nAlistair has specialized in distributed computing, microservices architecture, and the modernization of legacy systems—bridging deep technical expertise with business impact. He’s passionate about building high-performing engineering teams and fostering a culture of continuous improvement, innovation, and resilience at scale.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/IMG_4279_1744676390096001dV9C.jpg?h=e87d529f&itok=n9aF8d1H","alt":"Alistair MacDonald"}},{"name":"Naeem Rehman","company":"Databricks","job_title":"Sr. Solutions Architect","bio":"Naeem is a Senior Solutions Architect at Databricks with 18 years in the financial industry. <br \/>\nAs a former Databricks customer, he brings a unique perspective to helping institutions scale with data and AI. He has modernized analytics platforms, implemented robust data governance, and delivered practical, outcome-driven solutions. <br \/>\nAt Databricks, Naeem partners with banks, insurers, and asset managers to design secure, scalable solutions using the lakehouse architecture.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Naeem%2520Profile%2520Pic%2520HQ_Resume_1744235192911001WtBq.jpg?h=1383ba63&itok=skeUSyO-","alt":"Naeem Rehman"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/revolutionizing-counterparty-credit-risk-saccr-how-morgan-stanley","alias":"\/data-ai-summit-2025\/session\/revolutionizing-counterparty-credit-risk-saccr-how-morgan-stanley","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534996+00:00"}
{"id":"D25B1067","title":"Revolutionizing Cybersecurity: SCB's Journey to a Self-Managed SIEM","description":"<p>Join us to explore how Standard Chartered Bank's (SCB) groundbreaking strategy is reshaping the future of the cybersecurity landscape by replacing traditional SIEM with a cutting-edge Databricks solution, achieving remarkable business outcomes:<\/p><ul>\t<li>68% cost reduction<\/li>\t<li>98% improvement in query resolution time — 380 sec to 8 sec<\/li>\t<li>Significant enhancements in threat detection and response metrics<\/li>\t<li>Substantial increase in ML-driven use cases<\/li><\/ul><p> <\/p><p>This talk unveils SCB's journey to a distributed, multi-cloud lakehouse architecture that unlocks unprecedented performance and commercial optimization. Explore why a unified data and AI platform is becoming the cornerstone of next-generation, self-managed SIEM solutions for forward-thinking organizations in this era of AI-powered banking transformation.<\/p>","track":"Data Strategy","level":"Intermediate","type":"Breakout","industry":["Financial Services"],"category":["Delta Lake, MLFlow, Unity Catalog"],"areas_of_interest":["Cybersecurity, Data Intelligence"],"delivery":["In Person"],"speakers":[{"name":"Lavy Stokhamer","company":"Standard Chartered Bank","job_title":"Global Head, Cybersecurity Operations","bio":"Lavy Stokhamer is a global cybersecurity executive, board advisor, and risk strategist with extensive experience in cyber defense, regulatory governance, and business resilience. lead the cybersecurity across 53 markets, ensuring resilience against nation-state threats, cybercriminal organizations, and emerging risks.<br \/>\n<br \/>\nPreviously, Lavy led the Israel’s National Cyber Emergency Response Team (CERT), overseeing national cyber defense, crisis management, and global threat intelligence. <br \/>\n<br \/>\nLavy holds a Bachelor’s degree in IT & Business and executive certifications from Harvard, Columbia, ISTARI, and Tel Aviv University’s. He is a certified corporate director and recognized authority in cyber risk governance and resilience strategies.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Lavy_Stokhamer.jpg_1744809846556001a0rF.JPG?h=9850cf84&itok=ZVDQKJNH","alt":"Lavy Stokhamer"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/revolutionizing-cybersecurity-scbs-journey-self-managed-siem","alias":"\/data-ai-summit-2025\/session\/revolutionizing-cybersecurity-scbs-journey-self-managed-siem","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535000+00:00"}
{"id":"D25B1781","title":"Revolutionizing Data Insights and the Buyer Experience at GM Financial with Cloud Data Modernization","description":"<p>Deloitte and GM (General Motors) Financial have collaborated to design and implement a cutting-edge cloud analytics platform, leveraging Databricks. In this session, we will explore how we overcame challenges including dispersed and limited data capabilities, high-cost hardware and outdated software, with a strategic and comprehensive approach. With the help of Deloitte and Databricks, we were able to develop a unified Customer360 view, integrate advanced AI-driven analytics, and establish robust data governance and cyber security measures. Attendees will gain valuable insights into the benefits realized, such as cost savings, enhanced customer experiences, and broad employee upskilling opportunities. Unlock the impact of cloud data modernization and advanced analytics in the automotive finance industry and beyond with Deloitte and Databricks. <\/p>","track":"Data Strategy","level":"Intermediate","type":"Breakout","industry":["Retail and CPG - Food, Financial Services"],"category":["Mosaic AI, Unity Catalog"],"areas_of_interest":["Customer Data Platform, Data Intelligence, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Rick Whitford","company":"Deloitte Consulting, LLP","job_title":"Principal","bio":"Rick is the Automotive Sector AI and Data practice leader at Deloitte. He leads teams that create cutting-edge technology solutions to solve business problems and enable new markets by leveraging emerging technologies, such as machine learning, natural language processing, and generative AI. Rick has more than 20 years of experience in advanced data visualization and reporting, as well as in analytics platform development, enterprise architecture, and software development. His expertise involves integrating large volumes of structured and unstructured data sets to gain meaningful and actionable business insights and implementing enterprise-wide Business Intelligence solutions. ","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Rick%2520Whitford%2520Headshot_1745373445820001IDpe.jpg?h=7e2c02fb&itok=dDLxCBM0","alt":"Rick Whitford"}},{"name":"Latha Subramanian","company":"GM Financial","job_title":"Head Senior VP, Data Analytics","bio":"Experienced Leader specialized with 28+ years of specialization in AI\/ML, Data, Analytics and Reporting domains in several industry verticals ranging from Healthcare, P&C and specialty Insurance, Financial Services, banking ,multi-media publishing, technology, high tech industry, auto financing. Distinguished speaker at various CDO\/CDAO summits and recognized by CDO Magazine.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Latha%2520Subramanian_1738357204840001XcF9_1745617859157001pnhM.jpg?h=f2d33511&itok=pE_oWQK6","alt":"Latha Subramanian"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/revolutionizing-data-insights-and-buyer-experience-gm-financial-cloud","alias":"\/data-ai-summit-2025\/session\/revolutionizing-data-insights-and-buyer-experience-gm-financial-cloud","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535004+00:00"}
{"id":"D25B3081","title":"Scaling Success: How Banks are Unlocking Growth With Data and AI","description":"<p>Growth in banking isn’t just about keeping pace—it’s about setting the pace. This session explores how leading banks leverage Databricks’ Data Intelligence Platform to uncover new revenue opportunities, deepen customer relationships, and expand market reach.<\/p><p> <\/p><p>Hear from industry leaders who have transformed their growth strategies by harnessing the power of advanced analytics and machine learning. Learn how personalized customer experiences, predictive insights and unified data platforms are driving innovation and helping banks scale faster than ever.<\/p><p> <\/p><p>Key takeaways:<\/p><ul>\t<li>Proven strategies for identifying untapped growth opportunities using data-driven approaches<\/li>\t<li>Real-world examples of banks creating personalized customer journeys that boost retention and loyalty<\/li>\t<li>Tools and techniques to accelerate innovation while maintaining operational efficiency<\/li><\/ul><p> <\/p><p>Join us in discovering how data intelligence is redefining growth in banking and thriving throughout uncertainty.<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Financial Services"],"category":["Data Marketplace, AI\/BI, Mosaic AI"],"areas_of_interest":["Thought Leadership, Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Ricardo Portilla","company":"Databricks","job_title":"Field CTO","bio":"Ricardo has 12+ years of experience with Financial Services customers bringing use cases to production. He has designed and consulted on solutions architecture with dozens of customers from Capital Markets to Banking and Wealth Management. His previous work was at FINRA where he moved FINRA mission-critical workloads from on-prem warehouses to the cloud and established a machine learning practice for financial fraud","image":{}},{"name":"Junta Nakai","company":"Databricks","job_title":"Financial Services, Cyber, Public Sector","bio":"Junta Nakai is the VP, Global Head of Financial Services and Sustainability at Databricks. In his capacity, he is responsible for driving the world wide adoption of the Lakehouse Platform across Capital Markets, Banking\/Payments, Insurers and Data Providers as well as the advancement of Sustainability Use-Cases across all verticals. Prior to joining Databricks, Junta spent 14 years at Goldman Sachs, in various leadership roles in the Equities Division.","image":{}},{"name":"Tony Qui","company":"E&Y","job_title":null,"bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/scaling-success-how-banks-are-unlocking-growth-data-and-ai","alias":"\/data-ai-summit-2025\/session\/scaling-success-how-banks-are-unlocking-growth-data-and-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535105+00:00"}
{"id":"D25B3082","title":"Securing the Future: How Banks are Reducing Risk With Data and AI","description":"Today, executives are focused on managing regulatory scrutiny and emerging threats. Banks worldwide are leveraging the Databricks Data Intelligence Platform to enhance fraud prevention, ensure compliance and protect sensitive data while improving operational efficiency.This session will highlight how leading banks are implementing AI-driven risk management to identify vulnerabilities, streamline governance and enhance resilience. By utilizing unified data platforms, these institutions can effectively tackle threats and foster trust without hindering growth.Key takeaways:\t<li>Fraud detection: Best practices for using machine learning to combat fraud<\/li>\t<li>Regulatory compliance: Insights on navigating complex regulations<\/li>\t<li>Secure operations: Strategies for scalable operations that protect assets and support growth<\/li>Join us to see how data intelligence is reshaping the banking industry and enabling success in uncertain times!","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Financial Services"],"category":["Mosaic AI, Unity Catalog"],"areas_of_interest":["Data Intelligence, Thought Leadership, Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Cyril Cymbler","company":"Databricks","job_title":"Head of Global Banking & EMEA FINSERV","bio":null,"image":{}},{"name":"Nitin Kulkarni","company":"Nationwide Building SOCIETY","job_title":"CIO","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/securing-future-how-banks-are-reducing-risk-data-and-ai","alias":"\/data-ai-summit-2025\/session\/securing-future-how-banks-are-reducing-risk-data-and-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535146+00:00"}
{"id":"D25B2082","title":"Simon + Denny - Unfiltered & Unscripted","description":"<p>Two industry veterans have been debating data architecture, tearing apart trends and tinkering with tech for decades and they’re bringing the conversation live — and you’re in control.<\/p><p> <\/p><p>Got a burning question about lake structures or internal performance? Worried about AI taking over the world? Want straight-talking opinions on the latest hype? Need real-world advice from the people who the experts get advice from? Want to get the juicy behind-the-scenes gossip about any announcements and shockwaves from the Keynotes? This is your chance to have your questions answered!<\/p><p> <\/p><p>Submit your questions ahead of time or bring them on the day — no topic is off-limits (though there's always a risk of side quests into coffee, sci-fi, or the quirks of English weather).<\/p><p> <\/p><p>Come for the insights, stay for the chaos.<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Enterprise Technology, Media and Entertainment, Financial Services"],"category":["Apache Spark, Delta Lake, Mosaic AI"],"areas_of_interest":["Generative AI (LLMs), Getting started with Databricks, Open Source"],"delivery":["In Person"],"speakers":[{"name":"Simon Whiteley","company":"Advancing Analytics","job_title":"CTO","bio":null,"image":{}},{"name":"Denny Lee","company":"Databricks","job_title":"PM Director, Developer Relations","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/simon-denny-unfiltered-unscripted","alias":"\/data-ai-summit-2025\/session\/simon-denny-unfiltered-unscripted","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535190+00:00"}
{"id":"D25L3115SPO","title":"Sponsored by: AWS | Buy with AWS","description":"<p>AWS Marketplace is transforming how enterprises worldwide find, buy, deploy, and govern software, data, and professional services. Easily find and deploy the software, data, and services that you need from over 5,000+ Sellers with fast procurement and flexible pricing and terms. AWS Marketplace enables seamless integration with AWS services as well as consolidated AWS billing, centralized governance, and simplified vendor management. AWS delivers the solutions you need, when and where you need them including Buy with AWS direct on AWS Partner websites. Learn more about how AWS Marketplace is driving value for customers and AWS Partners.<\/p>","track":"Data Strategy","level":"Beginner","type":"Lightning Talk","industry":["Enterprise Technology"],"category":["Data Marketplace, Mosaic AI"],"areas_of_interest":["Data Applications, Migrations"],"delivery":["In Person"],"speakers":[],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/sponsored-aws-buy-aws","alias":"\/data-ai-summit-2025\/session\/sponsored-aws-buy-aws","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535264+00:00"}
{"id":"D25L3348SPO","title":"Sponsored by: Deloitte | Accelerating Biopharmaceutical Breakthroughs with an Innovative Enterprise Data Strategy","description":"<p>In the rapidly evolving life sciences and healthcare industry, leveraging data-as-a-product is crucial for driving innovation and achieving business objectives. Join us to explore how Deloitte is revolutionizing data strategy solutions by overcoming challenges such as data silos, poor data quality, and lack of real-time insights with the Databricks Data Intelligence Platform. Learn how effective data governance, seamless data integration, and scalable architectures support personalized medicine, regulatory compliance, and operational efficiency. This session will highlight how these strategies enable biopharma companies to transform data into actionable insights, accelerate breakthroughs and enhance life sciences outcomes.<\/p>","track":"Data Strategy","level":"Beginner","type":"Lightning Talk","industry":["Health and Life Sciences"],"category":["Unity Catalog"],"areas_of_interest":["Data Intelligence, Partner Innovation Showcase"],"delivery":["In Person"],"speakers":[],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/sponsored-deloitte-accelerating-biopharmaceutical-breakthroughs","alias":"\/data-ai-summit-2025\/session\/sponsored-deloitte-accelerating-biopharmaceutical-breakthroughs","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535290+00:00"}
{"id":"D25L3119SPO","title":"Sponsored by: Impetus | Supercharge AI with automated migration to Databricks with Impetus","description":"<p>Migrating legacy workloads to a modern, scalable platform like Databricks can be complex and resource-intensive. Impetus, an Elite Databricks Partner and the Databricks Migration Partner of the Year 2024, simplifies this journey with LeapLogic, an automated solution for data platform modernization and migration services. LeapLogic intelligently discovers, transforms, and optimizes workloads for Databricks, ensuring minimal risk and faster time-to-value. In this session, we’ll showcase real-world success stories of enterprises that have leveraged Impetus’ LeapLogic to modernize their data ecosystems efficiently. Join us to explore how you can accelerate your migration journey, unlock actionable insights, and future-proof your analytics with a seamless transition to Databricks.<\/p>","track":"Data Strategy","level":"Intermediate","type":"Lightning Talk","industry":["Manufacturing, Retail and CPG - Food, Financial Services"],"category":["Delta Lake, Databricks SQL, Unity Catalog"],"areas_of_interest":["Customer Data Platform, Getting started with Databricks, Migrations"],"delivery":["In Person"],"speakers":[],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/sponsored-impetus-supercharge-ai-automated-migration-databricks-impetus","alias":"\/data-ai-summit-2025\/session\/sponsored-impetus-supercharge-ai-automated-migration-databricks-impetus","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535311+00:00"}
{"id":"D25L3379SPO","title":"Sponsored by: Monte Carlo | Investing in Data Quality: Nasdaq’s Journey to Data + AI Reliability","description":"<p>As one of the world’s largest stock exchanges, Nasdaq knows that high-quality data + AI isn’t just a nice-to-have – it’s mission critical. That means choosing technology partners that can deliver on performance, scale, and reliability is just as important. That’s why their team has invested heavily in improving their organization’s data quality with data + AI observability. Join Michael Weiss to learn about the evolution of data at Nasdaq, how they partner with Monte Carlo to meet the needs of their modern data + AI challenges in their highly-regulated and scrutinized industry, and best practices and tips for how to implement a data quality program at any scale.<\/p>","track":"Data Strategy","level":"Intermediate","type":"Lightning Talk","industry":["Financial Services"],"category":["Delta Lake, Unity Catalog"],"areas_of_interest":["Customer Data Platform, ML\/LLMOps, Thought Leadership"],"delivery":["In Person"],"speakers":[],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/sponsored-monte-carlo-investing-data-quality-nasdaqs-journey-data-ai","alias":"\/data-ai-summit-2025\/session\/sponsored-monte-carlo-investing-data-quality-nasdaqs-journey-data-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535319+00:00"}
{"id":"D25B3089","title":"Tech Industry Forum: Tip of the Spear With Data and AI","description":"<p>Join us for the Tech Industry Forum, formerly known as the Tech Innovators Summit, now part of Databricks Industry Experience. This session will feature keynotes, panels and expert talks led by top customer speakers and Databricks experts.<\/p><p> <\/p><p>Tech companies are pushing the boundaries of data and AI to accelerate innovation, optimize operations and build collaborative ecosystems. In this session, we’ll explore how unified data platforms empower organizations to scale their impact, democratize analytics across teams and foster openness for building tomorrow’s products.<\/p><p> <\/p><p>Key topics include:<\/p><ul>\t<li>Scaling data platforms to support real-time analytics and AI-driven decision-making<\/li>\t<li>Democratizing access to data while maintaining robust governance and security<\/li>\t<li>Harnessing openness and portability to enable seamless collaboration with partners and customers<\/li><\/ul><p> <\/p><p>After the session, connect with your peers during the exclusive Industry Forum Happy Hour. Reserve your seat today!<\/p>","track":"Data Strategy","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["Delta Lake, Apache Iceberg, Unity Catalog"],"areas_of_interest":["Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Madelyn Mullen","company":"Databricks","job_title":"Industry Marketing, Digital Natives","bio":"Madelyn leads digital natives industry marketing at Databricks.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Mullen_Madelyn_Headshot_1744388899177001pqfr.png?h=b044a8f9&itok=MJAPvLzS","alt":"Madelyn Mullen"}},{"name":"Jason Reid","company":null,"job_title":"Director, Product","bio":null,"image":{}},{"name":"Dan Wulin","company":"Zillow","job_title":"VP, Data Engineering","bio":null,"image":{}},{"name":"Shant Hovsepian","company":"Databricks","job_title":"Data Magician","bio":null,"image":{}},{"name":"Dev Tagare","company":"Robinhood","job_title":"VP of Data & AI","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"60","path":"\/session\/tech-industry-forum-tip-spear-data-and-ai","alias":"\/data-ai-summit-2025\/session\/tech-industry-forum-tip-spear-data-and-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535390+00:00"}
{"id":"D25B1157","title":"Techcombank's Multi-Million Dollar Transformation Leveraging Cloud and Databricks","description":"<p>The migration to the Databricks Data Intelligence Platform has enabled Techcombank to more efficiently unify data from over 50 systems, improve governance, streamline daily operational analytics pipelines and use advanced analytics tools and AI to create more meaningful and personalized experiences for customers. With Databricks, Techcombank has also introduced key solutions that are reshaping its digital banking services:<\/p><p> <\/p><p>AI-driven lead management system: Techcombank's internally developed AI program called 'Lead Allocation Curated Engine' (LACE) optimizes lead management and provides relationship managers with enriched insights for smarter lead allocation to drive business growth.<\/p><p> <\/p><p>AI-powered program for digital banking inclusion of small businesses: An AI-powered GeoSense assists frontline workers with analytics-driven insights about which small businesses and merchants to engage in the bank's digital ecosystem.<\/p><p> <\/p><p>And more examples, which will be presented.<\/p>","track":"Data Strategy","level":"Intermediate","type":"Breakout","industry":["Financial Services"],"category":["Delta Lake, MLFlow, Databricks SQL"],"areas_of_interest":["AI Agents, Data Applications, Data Science"],"delivery":["In Person"],"speakers":[{"name":"Santhosh Mahendiran","company":"Techcombank (TCB)","job_title":"Chief Data and Analytics Officer","bio":"Mr. Santhosh Mahendiran is the Chief Data & Analytics Officer at Techcombank, with over 20 years of experience in the banking and finance sector with a strong focus on data, analytics and digital. He leads the bank’s data strategy, focusing on advanced analytics, machine learning, and data partnerships. Previously, he was Managing Director at Standard Chartered Bank, overseeing digital transformation and Enterprise Data Management. Mr. Santhosh also held senior roles at Citibank, where he developed innovative data solutions, including the world’s first touchscreen paperless onboarding system in Japan. Mr. Santhosh holds master's degrees in Computer Applications and Software Engineering.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/SM%25202_1745914545556001F2iw.jpg?h=cd2e3180&itok=uml8QkMA","alt":"Santhosh Mahendiran"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/techcombanks-multi-million-dollar-transformation-leveraging-cloud-and","alias":"\/data-ai-summit-2025\/session\/techcombanks-multi-million-dollar-transformation-leveraging-cloud-and","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535401+00:00"}
{"id":"D25B3246","title":"Telco Reimagined: Real-World Journeys in Data and AI for Customer Experience Transformation","description":"<p>How are today’s leading telecom operators transforming customer experience at scale with data and AI? Join us for an inspiring fireside chat with senior leaders from Optus and T-Mobile as they share their transformation stories — from the first steps to major milestones and the tangible business impact achieved with Databricks’ Data Intelligence Platform.<\/p><p> <\/p><p>You’ll hear firsthand how these forward-thinking CSP’s are driving measurable outcomes through unified data, machine learning and AI. Discover the high-impact use cases they’re prioritizing — like proactive care and hyper-personalization — and gain insight into their bold vision for the future of customer experience in telecom.<\/p><p> <\/p><p>Whether you're just beginning your AI journey or scaling to new heights, this session offers an authentic look at what’s working, what’s next and how data and AI are helping telecoms lead in a competitive landscape.<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Media and Entertainment"],"category":["Databricks SQL, Mosaic AI, Unity Catalog"],"areas_of_interest":["Thought Leadership, Industry Experience, Telecommunications"],"delivery":["In Person"],"speakers":[{"name":"Nevash Pillay","company":null,"job_title":"Head of Global Telecom Industry","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/telco-reimagined-real-world-journeys-data-and-ai-customer-experience","alias":"\/data-ai-summit-2025\/session\/telco-reimagined-real-world-journeys-data-and-ai-customer-experience","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535405+00:00"}
{"id":"D25B3247","title":"Telecom Innovation Exchange: Demos and Dialogues","description":"<p>Join us for an interactive breakout session designed to explore scalable, real-world solutions powered by Partners with Databricks. In this high-energy session, you'll hear from three of our leading partners — Accenture, Capgemini and Wipro — as they each deliver rapid-fire, 5-minute demos of their most impactful, production-grade solutions built for the telecom industry. From network intelligence to customer experience to AI-driven automation, these solutions are already driving tangible outcomes at scale.<\/p><p> <\/p><p>After the demos, you’ll have the unique opportunity to engage directly with each partner in a “speed dating” style format. Dive deep into the solutions, ask your questions and explore how these approaches can be tailored to your organization’s needs.<\/p><p> <\/p><p>Whether you're solving for churn, fraud, network ops or enterprise AI use cases, this session is your chance to connect, collaborate and walk away with practical ideas you can take back to your teams.<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Media and Entertainment"],"category":["Databricks SQL, Mosaic AI, Unity Catalog"],"areas_of_interest":["Thought Leadership, Industry Experience, Telecommunications"],"delivery":["In Person"],"speakers":[{"name":"Nevash Pillay","company":null,"job_title":"Head of Global Telecom Industry","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/telecom-innovation-exchange-demos-and-dialogues","alias":"\/data-ai-summit-2025\/session\/telecom-innovation-exchange-demos-and-dialogues","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535408+00:00"}
{"id":"D25B3245","title":"Telecommunications Industry Forum: The Intelligent Telecom: Efficiency, Revenue Growth, Impact","description":"<p>The telecommunications industry is at a pivotal moment. As networks expand to support 5G, IoT and next-generation customer experiences, success will belong to those who harness the full power of data and AI. These leaders will drive greater efficiency, unlock new revenue streams and deliver world-class service.<\/p><p> <\/p><p>Join us at the DAIS Telecom Forum for an exclusive Telecom Keynote where industry trailblazers reveal how they are transforming their organizations with the Databricks Data Intelligence Platform. Gain firsthand insights into how leading telecoms are leveraging open, interoperable data strategies to break down silos, improve operational agility and deliver measurable business outcomes.<\/p><p> <\/p><p>Don’t miss this opportunity to connect with global telecom leaders, learn from real-world success stories and be inspired to lead your organization’s next wave of transformation. The future of telecom is being built now — be part of the conversation.<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Media and Entertainment"],"category":["Databricks SQL, Mosaic AI, Unity Catalog"],"areas_of_interest":["Thought Leadership, Industry Experience, Telecommunications"],"delivery":["In Person"],"speakers":[{"name":"Nevash Pillay","company":null,"job_title":"Head of Global Telecom Industry","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"60","path":"\/session\/telecommunications-industry-forum-intelligent-telecom-efficiency","alias":"\/data-ai-summit-2025\/session\/telecommunications-industry-forum-intelligent-telecom-efficiency","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535413+00:00"}
{"id":"D25B3113","title":"The New Competitive Edge: Building Resilient Supply Chains With Data + AI","description":"<p>Consumer-facing industries are evolving faster than ever — and in today’s competitive landscape, it’s supply chains, not companies, that are truly competing. While data and AI offer huge potential for optimization, many organizations struggle to turn use cases into real business impact. In this session, leaders from retail, consumer goods, travel and hospitality will share how they’re building strong data foundations to unlock AI-driven supply chain optimization. Learn how they're using generative AI to boost productivity, streamline operations and improve insights through better data collaboration.<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Retail and CPG - Food"],"category":["Delta Sharing"],"areas_of_interest":["Collaboration, Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Rob Saker","company":"Databricks","job_title":"Global VP | Consumer Industries GTM","bio":null,"image":{}},{"name":"Andy Hancock","company":"SAP","job_title":null,"bio":null,"image":{}},{"name":"Dee Fitzgerald","company":"Danone","job_title":"VP Data, Analytics and AI (CDO)","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/new-competitive-edge-building-resilient-supply-chains-data-ai","alias":"\/data-ai-summit-2025\/session\/new-competitive-edge-building-resilient-supply-chains-data-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535455+00:00"}
{"id":"D25L2610","title":"Transforming Data at Rheem: From Silos to Scalable Data Lakehouse With Databricks and Unity Catalog","description":"<p>Rheem's journey from a fragmented data landscape to a robust, scalable data platform powered by Databricks showcases the power of data modernization. In just 1.5 years, Rheem evolved from siloed reporting to 30+ certified data products, integrated with 20+ source systems, including MDM. This transformation has unlocked significant business value across sales, procurement, service and operations, enhancing decision-making and operational efficiency. This session will delve into Rheem's implementation of Databricks, highlighting how it has become the cornerstone of rapid data product development and efficient data sharing across the organization. We will also explore the upcoming enhancements with Unity Catalog, including the full migration from HMS to UC. Attendees will gain insights into best practices for building a centralized data platform, enhancing developer experience, improving governance capabilities as well as tips and tricks for a successful UC migration and enablement.<\/p>","track":"Data Strategy","level":"Intermediate","type":"Lightning Talk","industry":["Manufacturing"],"category":["Delta Lake, Databricks SQL, Unity Catalog"],"areas_of_interest":["Customer Data Platform, Getting started with Databricks, Migrations"],"delivery":["In Person"],"speakers":[{"name":"Elise Haskins","company":"EY","job_title":"Senior Manager, AI & Data","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/transforming-data-rheem-silos-scalable-data-lakehouse-databricks-and","alias":"\/data-ai-summit-2025\/session\/transforming-data-rheem-silos-scalable-data-lakehouse-databricks-and","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535507+00:00"}
{"id":"D25B2062","title":"Transforming Government With Data and AI: Singapore GovTech's Journey With Databricks","description":"<p>GovTech is an agency in the Singapore Government focused on tech for good. The GovTech Chief Data Office (CDO) has built the GovTech Data Platform with Databricks at the core. As the government tech agency, we safeguard national-level government and citizen data. A comprehensive data strategy is essential to uplifting data maturity.<\/p><p> <\/p><p>GovTech has adopted the service model approach where data services are offered to stakeholders based on their data maturity. Their maturity is uplifted through partnership, readying them for more advanced data analytics. CDO offers a plethora of data assets in a “data restaurant” ranging from raw data to data products, all delivered via Databricks and enabled through fine-grained access control, underpinned by data management best practices such as data quality, security and governance.<\/p><p> <\/p><p>Within our first year on Databricks, CDO was able to save 8,000 man-hours, democratize data across 50% of the agency and achieve six-figure savings through BI consolidation.<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Public Sector"],"category":["AI\/BI, Databricks Workflows, Unity Catalog"],"areas_of_interest":["Data Ingestion, Data Intelligence, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Wei Hao Tan","company":"GovTech Singapore","job_title":"Senior Manager, Data Management","bio":null,"image":{}},{"name":"Sachin Tonk","company":"GovTech","job_title":"Deputy Chief Data Officer","bio":"Outstanding track record in automation, artificial intelligence, data analytics, business intelligence, Innovation, business transformation, governance, migration and architecture. Proven abilities in leading high-performing, multicultural and cross-functional teams in the delivery of multiple concurrent projects and operations of technology solutions.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Sachin-1_1738571567811001uIGq.png?h=7d66a0c3&itok=-VDSgBO4","alt":"Sachin Tonk"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/transforming-government-data-and-ai-singapore-govtechs-journey","alias":"\/data-ai-summit-2025\/session\/transforming-government-data-and-ai-singapore-govtechs-journey","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535517+00:00"}
{"id":"D25B3241","title":"Using Monte Carlo With Databricks at FanDuel","description":"<p>In this breakout session you will hear from some of the biggest names in Gaming. FanDuel will share their experiences with Databricks and Monte Carlo simulations and GeoComply will share how they’ve integrated Databricks into their solution to help Gaming customers across the globe address regulatory requirements and keep bettors safe.<\/p>","track":"Data Strategy","level":"Beginner","type":"Breakout","industry":["Media and Entertainment"],"category":["MLFlow, Mosaic AI, Unity Catalog"],"areas_of_interest":["Thought Leadership, Industry Experience, Gaming"],"delivery":["In Person"],"speakers":[{"name":"Huntting Buckley","company":"Databricks","job_title":"Global Games GTM Leader","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/using-monte-carlo-databricks-fanduel","alias":"\/data-ai-summit-2025\/session\/using-monte-carlo-databricks-fanduel","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535762+00:00"}
{"id":"D25B2916","title":"VALENTINO — Customer Journey with Databricks","description":"<p>VALENTINO decided to adopt Databricks within their own Data Strategy and Digital Transformation in order to address audience targeting across ads and marketing automation. Among several data sources and different legacy systems, Databricks offers the capabilities for an holistic view and the most recent data availability. In the past, at VALENTINO we spent significant time building and exporting CSVs and data pipelines for marketing teams —campaigns often go out late.<\/p><ul>\t<li>We can now address personalizations: All DBX data can be utilised via no-code UI to identify high-value users and improve customer experience<\/li>\t<li>Abandoned cart: Triggering omnichannel campaigns into ad\/email tools to increase conversions<\/li>\t<li>Inventory triggers: Emails sent when out-of-stock items become available<\/li>\t<li>Lakehouse CDP utilising DBX as the storage layer — all usage drives DBSQL. Plus — more datasets added to DBX to power CDP usage<\/li>\t<li>Revenue driver vs. cost centre, improving return on ad-spend and conversions<\/li><\/ul>","track":"Data Strategy","level":"Advanced","type":"Breakout","industry":["Enterprise Technology, Manufacturing, Retail and CPG - Food"],"category":["Delta Lake, Databricks Workflows, Unity Catalog"],"areas_of_interest":["Customer Data Platform, Data Intelligence, ETL, Marketing"],"delivery":["In Person"],"speakers":[{"name":"Francesco Laera","company":"Valentino","job_title":"Global Head of Brand Intelligence, Data & Analytics","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/valentino-customer-journey-databricks","alias":"\/data-ai-summit-2025\/session\/valentino-customer-journey-databricks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535766+00:00"}
