{"id":"D25B1257","title":"Accelerate End-to-End Multi-Agents on Databricks and DSPy","description":"<p>A production-ready GenAI application is more than the framework itself. Like ML, you need a unified platform to create an end-to-end workflow for production quality applications.<\/p><p> <\/p><p>Below is an example of how this works on Databricks:<\/p><ul>\t<li>Data ETL with DLT and jobs<\/li>\t<li>Data storage for governance and access with Unity Catalog<\/li>\t<li>Code development with Notebooks<\/li>\t<li>Agent versioning and metric tracking with MLflow and Unity Catalog<\/li>\t<li>Evaluation and optimizations with Mosaic AI Agent Framework and DSPy<\/li>\t<li>Hosting infrastructure with monitoring with Model Serving and AI Gateway<\/li>\t<li>Front-end apps using Databricks Apps<\/li><\/ul><p> <\/p><p>In this session, learn how to build agents to access all your data and models through function calling. Then, learn how DSPy enables agent interaction with each other to ensure the question is answered correctly. We will demonstrate a chatbot, powered by multiple agents, to be able to answer questions and reason answers the base LLM does not know and very specialized topics.<\/p>","track":"Artificial Intelligence","level":"Advanced","type":"Breakout","industry":["Enterprise Technology, Professional Services, Travel and Hospitality"],"category":["MLFlow, DSPy, Mosaic AI"],"areas_of_interest":["AI Agents, Generative AI (LLMs), ML\/LLMOps"],"delivery":["In Person"],"speakers":[{"name":"Austin Choi","company":"Databricks","job_title":"Delivery Solutions Architect","bio":"Austin is a Delivery Solutions Architect (DSA) at Databricks who specializes in Data Science and GenAI implementation. His background in Data Science at his past roles at Deloitte, IBM and Cisco have propelled him forward in the GenAI space. As a DSA, he has helped numerous customers design creative GenAI solutions on Databricks by the platform with the latest open source technology. His passion in educating and discovery drives him to help people, no matter the problem. <br \/>\n<br \/>\nIn his spare time, he enjoys building PCs, swimming and playing with his two cats. As an extrovert, he organizes and builds young adult Catholic communities in the Los Angeles area while giving back where he can to the broader community. ","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/headshot_1744156620988001OqTB.jpg?h=fdae6e20&itok=74yk7odK","alt":"Austin Choi"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/accelerate-end-end-multi-agents-databricks-and-dspy","alias":"\/data-ai-summit-2025\/session\/accelerate-end-end-multi-agents-databricks-and-dspy","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533674+00:00"}
{"id":"D25B1984","title":"Accelerating Model Development and Fine-Tuning on Databricks with TwelveLabs","description":"<p>Scaling large language models (LLMs) and multimodal architectures requires efficient data management and computational power. NVIDIA NeMo Framework Megatron-LM on Databricks is an open source solution that integrates GPU acceleration and advanced parallelism with Databricks Delta Lakehouse, streamlining workflows for pre-training and fine-tuning models at scale. This session highlights context parallelism, a unique NeMo capability for parallelizing over sequence lengths, making it ideal for video datasets with large embeddings. Through the case study of TwelveLabs’ Pegasus-1 model, learn how NeMo empowers scalable multimodal AI development, from text to video processing, setting a new standard for LLM workflows.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology, Media and Entertainment, Retail and CPG - Food"],"category":["Delta Lake, Mosaic AI, PyTorch"],"areas_of_interest":["AI Agents, Developer Experience, Generative AI (LLMs), Open Source"],"delivery":["In Person"],"speakers":[{"name":"Aiden Lee","company":"Twelve Labs, Inc","job_title":"Chief Technology Officer & Co-Founder","bio":"Aiden Lee is the Co-Founder and Chief Technology Officer at Twelve Labs, a company specializing in AI-driven video understanding. Under his leadership, Twelve Labs has developed advanced AI models capable of processing and comprehending vast video archives, enabling efficient and intuitive video search functionalities. Aiden's work focuses on pioneering multimodal video understanding, integrating visual, audio, and textual data to enhance the depth and accuracy of video content analysis.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Aiden%2520lee_1738540586075001SK2q.png?h=aabaf923&itok=kNm1LXwq","alt":"Aiden Lee"}},{"name":"Mansi Manohara","company":"NVIDIA","job_title":"Solutions Architect - NVIDIA","bio":"Manasa Manohara is a Solutions Architect at NVIDIA focusing on supporting large enterprise platforms that leverage NVIDIA technologies to build AI solutions. She previously held roles as an applied scientist and software engineering and comes with experience in AI, machine learning, and cloud infrastructure. In her current role, she helps develop new NVIDIA solutions on Databricks platform. ","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Mansi%2520_1738541589336001Bcdh.png?h=fbf7a813&itok=XSd0qYBQ","alt":"Mansi Manohara"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/accelerating-model-development-and-fine-tuning-databricks-twelvelabs","alias":"\/data-ai-summit-2025\/session\/accelerating-model-development-and-fine-tuning-databricks-twelvelabs","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533692+00:00"}
{"id":"D25B3406","title":"Achieve Your Mission With AI-Driven Decisions","description":"<p>Government leaders overwhelmingly recognize the potential benefits of AI as critical to long-term strategic goals of efficiency, but implementation challenges and security concerns could be obstacles to success.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Breakout","industry":["Education, Public Sector"],"category":["AI\/BI"],"areas_of_interest":["Generative AI (LLMs), Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Mike Daniels","company":"Databricks","job_title":"VP and GM, Public Sector","bio":"Innovative and accomplished technology executive with a proven track record of success in managing, directing and contributing to large and small organizations. My objective is to make a significant impact for my company and my team.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/MikeDaniels-2019-5_1744989397156001oZ6x.jpg?h=468ef699&itok=XorrqGZN","alt":"Mike Daniels"}},{"name":"Todd Schroeder","company":"Databricks","job_title":"VP, Federal Government","bio":"Strategic Vision: Forward-looking strategic mindset with ability to define clear vision and then translate technology strategy into action.<br \/>\n Innovative Leadership: Dynamic, collaborative leader that inspires and energizes technical teams. Adept at infusing new talent and cultivating internal IT teams committed to excellence and integrity. Can foster environments of innovation and ingenuity by blending control with creative freedom.<br \/>\nCommunications: Aptitude for driving stakeholder engagement through active listening, clear communications, and focus on gaining business perspective and probing for better way to deliver solutions.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/ToddSchroeder-3-e_1745004239869001BQmw.jpg?h=4b07008b&itok=tozoxM0C","alt":"Todd Schroeder"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/achieve-your-mission-ai-driven-decisions","alias":"\/data-ai-summit-2025\/session\/achieve-your-mission-ai-driven-decisions","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533695+00:00"}
{"id":"D25B3065","title":"Achieving Precision in AI: Retrieving the Right Data Using AI Agents","description":"Today, most RAG systems pull from vast, generalized data lakes, leading to noisy outputs and frustrating inefficiencies. The result? Wasted resources, inconsistent responses, and missed opportunities for real-time decision-making. But what if you could create an AI system that doesn’t just retrieve data—but understands its context, delivering precise, actionable insights in milliseconds?This is where agenticRAG comes into play—a breakthrough in AI architecture that pairs dedicated retrieval pipelines with intelligent agents to deliver pinpoint accuracy. By segmenting your data storage and retrieval processes specifically for training vs. inference, you can achieve hyper-focused precision while dramatically reducing latency and costs.Curious to discover how you can optimize your AI applications for laser-focused accuracy? Join me to learn more about AgenticRAG and fine tuning your models.","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Professional Services"],"category":["Mosaic AI"],"areas_of_interest":["AI Agents, Open Source"],"delivery":["In Person"],"speakers":[{"name":"Adi Polak","company":"Confluent","job_title":"Director","bio":"Adi Polak is an experienced software engineer and people manager. For most of her professional life, she has worked with data and machine learning for operations and analytics. As a data practitioner, she developed algorithms to solve real-world problems using machine learning techniques and expertise in Apache Spark, Kafka, HDFS, and distributed large-scale systems. Adi has taught Spark to thousands of students and is the author of the successful book “Scaling Machine Learning with Spark” and \"High performance Spark\" 2nd edition. A year and a half ago, she embarked on a new adventure with data streaming, specifically Flink, and she can’t get enough of it.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/adi%2520polak_1745541395973001VIti.jpg?h=04e113f4&itok=23b8wjiK","alt":"Adi Polak"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/achieving-precision-ai-retrieving-right-data-using-ai-agents","alias":"\/data-ai-summit-2025\/session\/achieving-precision-ai-retrieving-right-data-using-ai-agents","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533699+00:00"}
{"id":"D25B1176","title":"Advanced RAG Overview — Thawing Your Frozen RAG Pipeline","description":"<p>The most common RAG systems rely on a frozen RAG system — one where there’s a single embedding model and single vector index. We’ve achieved a modicum of success with that, but when it comes to increasing accuracy for production systems there is only so much this approach solves. In this session we will explore how to move from the frozen systems to adaptive RAG systems which produce more tailored outputs with higher accuracy.<\/p><p> <\/p><p>Databricks services: Lakehouse, Unity Catalog, Mosaic, Sweeps, Vector Search, Agent Evaluation, Managed Evaluation, Inference Tables <\/p>","track":"Artificial Intelligence","level":"Advanced","type":"Breakout","industry":["Enterprise Technology, Professional Services, Financial Services"],"category":["MLFlow, Mosaic AI, Unity Catalog"],"areas_of_interest":["AI Agents, Data Intelligence, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"James Lin","company":"Experian","job_title":"Head of AI\/ML Innovation","bio":"James Lin is the Head of AI\/ML Innovation at Experian where he is working on bringing Generative AI research to production. Previously James helped to pioneer Experian's predictive ML migration to the cloud as well as one of the ML Ops solutions within the company. In some past lifetimes, James helped to launch the first commercial Voice over IP product in the US and holds over 10 patents in a diverse set of fields from software to semiconductor. James holds both a Masters in Computer Science and a Master of Business Administration.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/advanced-rag-overview-thawing-your-frozen-rag-pipeline","alias":"\/data-ai-summit-2025\/session\/advanced-rag-overview-thawing-your-frozen-rag-pipeline","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533713+00:00"}
{"id":"D25B1330","title":"Agentic Architectures to Create Realistic Conversations: Using GenAI to Teach Empathy in Healthcare","description":"<p>Medical providers often receive less than 15 minutes of instruction in how to interact with patients during emotionally charged end of life interactions. Continuing education for clinicians is critical to hone these skills but is difficult to scale traditional approaches that require professional patients and instructors. Here, we describe a custom chatbot that plays the role of patient and coach to provide a scaling learning experience. A critical challenge was how to mitigate the persistently cheerful and helpful tone which results from standard pretraining in the Patient Persona AI. We accomplished this by implementing a multi-agent architecture based upon a graphical model of the conversation. System prompts reflecting the patient’s cognitive state are dynamically updated as the conversation progresses. Future extensions of the work are intended to focus on additional custom model fine-tuning in the Mosaic AI platform to further improve the realism of the conversation.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Education, Health and Life Sciences"],"category":["Delta Lake, AI\/BI, Mosaic AI"],"areas_of_interest":["AI Agents, Generative AI (LLMs), Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Lindsay Mico","company":"Providence Health","job_title":"Head of Data Science","bio":"Lindsay Mico is the Head of Data Science for Providence, with a focus on enterprise scale AI solutions and cloud native architectures. Originally trained as a cognitive neuroscientist and statistician, he has worked across industries including natural resource management, telecom, and healthcare. ","image":{}},{"name":"Alex Ralevski","company":"Tegria Consulting\/Providence Healthcare","job_title":"Senior Data Scientist","bio":"Alexandra Ralevski, PhD is a Senior Data Scientist at Tegria Consulting Group and Providence Healthcare, where she leads the development of a Generative AI training tool to assist physicians in navigating end-of-life conversations. She previously worked as a Data Scientist at the Institute for Systems Biology, where she built predictive machine learning models for personalized healthcare. She also collaborated on NASA’s Periodic Table of Life (PeTaL) project, which used AI to mine the scientific literature for nature-inspired design. Her postdoctoral research at Yale University explored the intersection of plant biology and neuroscience, contributing to studies that bridged natural systems and human health. ","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Headshot_Alexandra_Ralevski_1745860955032001OafD.jpg?h=598ddfd3&itok=cf_B2pyY","alt":"Alex Ralevski"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/agentic-architectures-create-realistic-conversations-using-genai-teach","alias":"\/data-ai-summit-2025\/session\/agentic-architectures-create-realistic-conversations-using-genai-teach","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533717+00:00"}
{"id":"D25B2232","title":"AI Agents for Marketing: Leveraging Mosaic AI to Create a Multi-Purpose Agentic Marketing Assistant","description":"<p>Marketing professionals build campaigns, create content and use effective copywriting to tell a good story to promote a product\/offer. All of this requires a thorough and meticulous process for every individual campaign.<\/p><p> <\/p><p>In order to assist marketing professionals at 7-Eleven, we built a multi-purpose assistant that could:<\/p><ol>\t<li>Use campaign briefs to generate campaign ideas and taglines<\/li>\t<li>Do copy-writing for marketing content<\/li>\t<li>Verify images for messaging accuracy<\/li>\t<li>Answer general questions and browse the web as a generic assistant<\/li><\/ol><p> <\/p><p>We will walk you through how we created multiple agents as different personas with LangGraph and Mosaic AI to create a chat assistant that assumes a different persona based on the user query. We will also explain our evaluation methodology in choosing models and prompts and how we implemented guardrails for high reliability with sensitive marketing content. This assistant by 7-Eleven was showcased at the Databricks booth at NRF earlier this year.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Retail and CPG - Food"],"category":["Mosaic AI"],"areas_of_interest":["AI Agents, Generative AI (LLMs), ML\/LLMOps, Marketing"],"delivery":["In Person"],"speakers":[{"name":"Sailesh Bharathwaaj Krishnamurthy","company":"7-Eleven Inc","job_title":"Head of AI Center of Excellence","bio":"Sailesh is a highly motivated AI leader experienced in solving practical business problems with Data & AI, and building and growing multi-faceted teams with a passion for AI strategy.<br \/>\n<br \/>\nSailesh leads the AI Center of Excellence for 7-Eleven, building and scaling an AI\/ML Platform for the enterprise for faster time to market. He also leads multiple teams on Personalization, Forecasting, Store Intelligence, CRM, Fraud detection etc with strategic focus on AI Innovation including GenAI, NLP and Computer Vision.<br \/>\n<br \/>\nSailesh has extensive experience with Innovation\/moon-shot projects, taking ideas from ideation to reality by building and proving out the cashierless store and an automated self-checkout system, resulting in 90+ granted patents.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Headshot_1744262229735001Xuvc.jpg?h=ec1f982a&itok=uPueAXNk","alt":"Sailesh Bharathwaaj Krishnamurthy"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/ai-agents-marketing-leveraging-mosaic-ai-create-multi-purpose-agentic","alias":"\/data-ai-summit-2025\/session\/ai-agents-marketing-leveraging-mosaic-ai-create-multi-purpose-agentic","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533720+00:00"}
{"id":"D25S3200","title":"AI Agents Hackathon","description":"This in-person, full-day hackathon focuses on the development of innovative AI Agents using the Databricks Data Intelligence Platform. Collaborating in teams of up to four, participants will utilize Databricks' specialized agent authoring and evaluation tools to build, test, and refine intelligent agent systems. Diverse datasets from the Databricks Marketplace are available to enhance agent capabilities. The objective is to produce a compelling proof-of-concept agent showcasing creativity, intelligent data utilization, and effective tool-calling in a novel and useful manner. This event provides a platform for demonstrating technical quality with Databricks tools, creativity in agent design or application, and clarity of purpose. The hackathon promotes hands-on experience with cutting-edge agent development tools and concludes with short team demonstrations of proofs of concept created during the event.Three finalist teams will be selected, and the winners will be announced at the end of the Hackathon. Cash prizes will be awarded to the top teams, with $10,000 for first place, $5,000 for second place, and $2,500 for third place. ","track":"Artificial Intelligence","level":"Advanced","type":"Special Interest","industry":["Professional Services"],"category":["AI\/BI"],"areas_of_interest":["Thought Leadership"],"delivery":["In Person"],"speakers":[],"day":"Monday","room":"IntercCon, Level 4 Grand Ballroom","starts":"2025-06-09T14:00:00","ends":"2025-06-09T23:00:00","starts_pst":"2025-06-09T07:00:00","ends_pst":"2025-06-09T16:00:00","start_time":"2:00 pm","end_time":"11:00 pm","pst_start_time":"7:00 am","pst_end_time":"4:00 pm","duration":"540","path":"\/session\/ai-agents-hackathon","alias":"\/data-ai-summit-2025\/session\/ai-agents-hackathon","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533723+00:00"}
{"id":"D25B2031","title":"AI-Driven Drug Discovery: Accelerating Molecular Insights With NVIDIA and Databricks","description":"<p>In the race to revolutionize healthcare and drug discovery, biopharma companies are turning to AI to streamline workflows and unlock new scientific insights. This session, we will explore how NVIDIA BioNeMo, combined with Databricks Delta Lakehouse, can be used for advancing drug discovery for critical applications like molecular structure modeling, protein folding and diagnostics. We’ll demonstrate how BioNeMo pre-trained models can run inference on data securely stored in Delta Lake, delivering actionable insights. By leveraging containerized solutions on Databricks’ ML Runtime with GPU acceleration, users can achieve significant performance gains compared to traditional CPU-based computation.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Health and Life Sciences"],"category":["Delta Lake, Mosaic AI, Unity Catalog"],"areas_of_interest":["Data Science, Generative AI (LLMs), Open Source"],"delivery":["In Person"],"speakers":[{"name":"Mansi Manohara","company":"NVIDIA","job_title":"Solutions Architect - NVIDIA","bio":"Manasa Manohara is a Solutions Architect at NVIDIA focusing on supporting large enterprise platforms that leverage NVIDIA technologies to build AI solutions. She previously held roles as an applied scientist and software engineering and comes with experience in AI, machine learning, and cloud infrastructure. In her current role, she helps develop new NVIDIA solutions on Databricks platform. ","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Mansi%2520_1738541589336001Bcdh.png?h=fbf7a813&itok=XSd0qYBQ","alt":"Mansi Manohara"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/ai-driven-drug-discovery-accelerating-molecular-insights-nvidia-and","alias":"\/data-ai-summit-2025\/session\/ai-driven-drug-discovery-accelerating-molecular-insights-nvidia-and","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533744+00:00"}
{"id":"D25B2317","title":"Amplifying Human-to-Human Connection in the Face of Mental Health Crisis Using Agentic AI","description":"<p>Crisis Text Line has been innovating for ten years in text-based mental health crisis intervention and is now leading the next wave of GenAI use cases in the space. With over 300 million messages exchanged since 2013 and a decade of expertise, Crisis Text Line is unlocking the potential of AI to amplify human connection at a global scale.We will discuss how we leveraged our bedrock application to co-navigate crisis care through a set of early AI agent workflows. First, a simulator that reproduces texter behavior to train responders in taking conversations ranging in difficulty where the texter is in imminent risk of suicide or self-harm. Second, a tool that automatically monitors clinical quality of conversations. Third, predicted summarization to capture key context before conversations are transferred. Through the power of suggestion, this compound system aims to reduce burden and drive efficiency, such that our responders can focus on what they do best — support people in need.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Health and Life Sciences, Public Sector"],"category":["Delta Lake, MLFlow, Llama"],"areas_of_interest":["Data Applications, Data Intelligence, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Kristi Lui","company":"Crisis Text Line","job_title":"Principal Product Manager","bio":"With over 6 years of experience building healthcare data products at scale, Kristi has launched technical software products ranging from BI analytics to AI-driven workflows at small to medium size companies.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Kristi_Lui_1745879556906001gHBA.png?h=a931e13c&itok=_aMSQ0Yl","alt":"Kristi Lui"}},{"name":"Mateo Garcia Pepin","company":"Crisis Text Line","job_title":"Lead Data Scientist","bio":"Mateo is a data leader with over 9 years of experience scaling teams and building data products at different start-ups and consulting firms. He holds a PhD in theoretical particle physics and cosmology from IFAE-UAB (Barcelona) and has worked at CERN (Geneva) and other research institutions. At CTL, Mateo leads AI development efforts.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/MateoGarciaPepin_photo_1745943135953001UwqI.png?h=e8ac4826&itok=gW2yYOdy","alt":"Mateo Garcia Pepin"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/amplifying-human-human-connection-face-mental-health-crisis-using","alias":"\/data-ai-summit-2025\/session\/amplifying-human-human-connection-face-mental-health-crisis-using","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533778+00:00"}
{"id":"D25B2067","title":"Anomaly Detection at Apple for Large-Scale Data Using Apache Spark and Flink","description":"<p>Anomaly detection in time series data is crucial for identifying unusual patterns and trends, enabling better alerting and action when data deviates from normal. Most anomaly detection algorithms perform adequately on a single node machine with public datasets, but do not scale well with distributed processing frameworks used in modern big data environments. This talk will focus on how we scaled anomaly detection for large-scale datasets using Apache Spark and Flink for both batch and near real-time use cases. We will also discuss how we leveraged Apache Spark to parallelize and scale common anomaly detection algorithms, enabling support for large-scale data processing. We'll highlight some of the challenges faced and how we resolved them to make it useful for massive datasets with varying degree of anomalies. Finally, we will demonstrate how our anomaly detection framework works in batch for petabytes of data and in streaming mode for hundreds of thousands of transactions per second.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Breakout","industry":["Enterprise Technology, Media and Entertainment, Financial Services"],"category":["Apache Spark, AI\/BI, Apache Iceberg"],"areas_of_interest":["Data Science, Machine Learning, Open Source, Streaming pipelines, Telecommunications"],"delivery":["In Person"],"speakers":[{"name":"Anupam Panwar","company":"Apple Inc","job_title":"Senior Machine Learning Engineer","bio":"Anupam Panwar is a Senior Machine Learning Engineer at Apple Inc., specializing in Information Retrieval, Anomaly Detection, Explainable AI, Cybersecurity, and Scalable ML Systems. With over a decade of experience at companies like Walmart Labs, Yahoo, Symantec, and Dell EMC, he has led the development of distributed systems using Apache Spark, Iceberg, and Flink. Anupam is known for translating cutting-edge research into real-world applications and for building robust, production-grade infrastructure that drives critical business operations.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/1642020331736_1744233980135001O9pL.jpg?h=fbf7a813&itok=mzoPacG3","alt":"Anupam Panwar"}},{"name":"Himadri Pal","company":"Apple Inc","job_title":"Principal Software Engineer","bio":"Principal Architect at Apple Media Products (AMP) Analytics Engineering - Subscription Analytics Platform.<br \/>\nBuilding Subscription Analytics Platform to support Apple’s growing service business.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Himadri_Pal_1744240891191001D5H3.png?h=a9c021fc&itok=MSZPH1R7","alt":"Himadri Pal"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/anomaly-detection-apple-large-scale-data-using-apache-spark-and-flink","alias":"\/data-ai-summit-2025\/session\/anomaly-detection-apple-large-scale-data-using-apache-spark-and-flink","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533785+00:00"}
{"id":"D25B1544","title":"AT&T AutoClassify: Unified Multi-Head Binary Classification From Unlabeled Text","description":"<p>We present AT&T AutoClassify, built jointly between AT&T's Chief Data Office (CDO) and Databricks professional services, a novel end-to-end system for automatic multi-head binary classifications from unlabeled text data. Our approach automates the challenge of creating labeled datasets and training multi-head binary classifiers with minimal human intervention.<\/p><p> <\/p><p>Starting only from a corpus of unlabeled text and a list of desired labels, AT&T AutoClassify leverages advanced natural language processing techniques to automatically mine relevant examples from raw text, fine-tune embedding models and train individual classifier heads for multiple true\/false labels. This solution can reduce LLM classification costs by 1,000x, making it an efficient solution in operational costs.<\/p><p> <\/p><p>The end result is a highly optimized and low-cost model servable in Databricks capable of taking raw text and producing multiple binary classifications. An example use case using call transcripts will be examined.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology, Professional Services"],"category":["MLFlow, AI\/BI, PyTorch"],"areas_of_interest":["Data Science, Generative AI (LLMs), Machine Learning, Open Source"],"delivery":["In Person"],"speakers":[{"name":"Colton Peltier","company":"Databricks","job_title":"Staff Data Scientist","bio":"I am a Staff Data Scientist at Databricks in Professional Services helping customers develop and deploy cutting-edge ML solutions.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/colton_1704403250958001cYyU_1744550941174001YAkU.png?h=e54d7d27&itok=hLYTBFdA","alt":"Colton Peltier"}},{"name":"Hien Lam","company":"AT&T","job_title":"Senior Data Scientist","bio":"Hien is a senior data scientist at AT&T specializing in NLP and ML, with particular focus on LLM distillation to optimize small language models and classical ML architectures.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/headshot_1744833129799001BLt1.png?h=32cc70da&itok=YMeYt0iE","alt":"Hien Lam"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/att-autoclassify-unified-multi-head-binary-classification-unlabeled","alias":"\/data-ai-summit-2025\/session\/att-autoclassify-unified-multi-head-binary-classification-unlabeled","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533796+00:00"}
{"id":"D25B1324","title":"Automating Taxonomy Generation With Compound AI on Databricks","description":"<p>Taxonomy generation is a challenge across industries such as retail, manufacturing and e-commerce. Incomplete or inconsistent taxonomies can lead to fragmented data insights, missed monetization opportunities and stalled revenue growth. In this session, we will explore a modern approach to solving this problem by leveraging Databricks platform to build a scalable compound AI architecture for automated taxonomy generation.<\/p><p> <\/p><p>The first half of the session will walk you through the business significance and implications of taxonomy, followed by a technical deep dive in building an architecture for taxonomy implementation on the Databricks platform using a compound AI architecture.<\/p><p> <\/p><p>We will walk attendees through the anatomy of taxonomy generation, showcasing an innovative solution that combines multimodal and text-based LLMs, internal data sources and external API calls. This ensemble approach ensures more accurate, comprehensive and adaptable taxonomies that align with business needs.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Manufacturing, Retail and CPG - Food, Travel and Hospitality"],"category":["Llama, Mosaic AI, Unity Catalog"],"areas_of_interest":["AI Agents, Generative AI (LLMs), Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Sudhir Gajre","company":"Lovelytics","job_title":"Managing Director, GenAI","bio":"Sudhir Gajre is the Managing Director of the AI and GenAI Practice at Lovelytics, where he leads the Generative AI practice. He brings over 20 years of consulting experience, driving complex data and AI transformations across industries including healthcare, financial services, media, insurance, and retail. Sudhir also serves as an Adjunct Professor at the University of Nebraska at Omaha and is a member of the Databricks Technical Council. A frequent conference speaker and blogger on GenAI and Databricks, he is known for turning innovation into impact through hands-on expertise and practical frameworks that bridge strategy and execution.<br \/>\n","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Sudhir%2520-%2520GAI%2520-%252005-02-2023%2520v1_1744934747401001kQLI.png?h=57024e64&itok=FqfyPcRR","alt":"Sudhir Gajre"}},{"name":"Bill Martin","company":"Lovelytics","job_title":"Managing Director - Industry","bio":"Former Fortune 500 Chief Data Officer with 25 Years Experience In Manufacturing, Distribution & Logistics. Former Member of The Gartner Data & Analytics Advisory Board. Extensive professional services background.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/automating-taxonomy-generation-compound-ai-databricks","alias":"\/data-ai-summit-2025\/session\/automating-taxonomy-generation-compound-ai-databricks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533809+00:00"}
{"id":"D25L1122","title":"Autonomous AI Agents in AI Infrastructure","description":"<p>Autonomous AI agents are transforming industries by enabling systems to perform tasks, make decisions and adapt in real time without human intervention. In this talk, I will delve into the architecture and design principles required to build these agents within scalable AI infrastructure. Key topics will include constructing modular, reusable frameworks, optimizing resource allocation and enabling interoperability between agents and data pipelines.<\/p><p> <\/p><p>I will discuss practical use cases in which attendees will learn how to leverage containerization and orchestration techniques to enhance the flexibility and performance of these agents while ensuring low-latency decision-making.<\/p><p> <\/p><p>This session will also highlight challenges like ensuring robustness, ethical considerations and strategies for real-time feedback loops. Participants will gain actionable insights into building autonomous AI agents that drive efficiency, scalability and innovation in modern AI ecosystems.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Lightning Talk","industry":["Energy and Utilities, Enterprise Technology"],"category":["Apache Spark, AI\/BI"],"areas_of_interest":["AI Agents, Machine Learning, ML\/LLMOps"],"delivery":["In Person"],"speakers":[{"name":"Apurva Kumar","company":"Walmart Global Tech","job_title":"Principal Software Engineer","bio":"Apurva Kumar is a technical leader and innovator in AI infrastructure, scalability and deployment with a passion for building scalable systems that drive widespread real impact in the society or industry at large. With experience at Amazon, Walmart, Yahoo, Samsung and Uber, Apurva has worked on groundbreaking contributions ranging from re-architecting Amazon’s search ranking infrastructure to creating Uber’s real-time ETA prediction model - all focused on enhancing user experiences and creating more efficient, sustainable technology solutions for hundreds of millions of users across the globe.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Screenshot%25202025-02-11%2520at%252010.36.46%2520PM_1744788504516001wN59.png?h=9d48492c&itok=SPpIFTxe","alt":"Apurva Kumar"}}],"day":"Tuesday","room":"Theater 5","starts":"2025-06-10T21:00:00","ends":"2025-06-10T21:20:00","starts_pst":"2025-06-10T14:00:00","ends_pst":"2025-06-10T14:20:00","start_time":"9:00 pm","end_time":"9:20 pm","pst_start_time":"2:00 pm","pst_end_time":"2:20 pm","duration":"20","path":"\/session\/autonomous-ai-agents-ai-infrastructure","alias":"\/data-ai-summit-2025\/session\/autonomous-ai-agents-ai-infrastructure","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533813+00:00"}
{"id":"D25B2836","title":"Best Practices for Building User-Facing AI Systems on Databricks","description":"<p>Integrating AI agents into business systems requires tailored approaches for different maturity levels (crawl-walk-run) that balance scalability, accuracy and usability.<\/p><p> <\/p><p>This session addresses the critical challenge of making AI agents accessible to business users. We will explore four key integration methods:<\/p><ul>\t<li>Databricks apps: The fastest way to build and run applications that leverage your data, with the full security and governance of Databricks<\/li>\t<li>Genie: Tool enabling non-technical users to gain data insights on Structured Data through natural language queries<\/li>\t<li>Chatbots: Combine real-time data retrieval with generative AI for contextual responses and process automation<\/li>\t<li>Batch inference: Scalable, asynchronous processing for large-scale AI tasks, optimizing efficiency and cost<\/li><\/ul><p> <\/p><p>We'll compare these approaches, discussing their strengths, challenges and ideal use cases to help businesses select the most suitable integration strategy for their specific needs.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Breakout","industry":["Energy and Utilities, Enterprise Technology, Manufacturing"],"category":["AI\/BI, Mosaic AI, Databricks Apps"],"areas_of_interest":["AI Agents, Data Applications, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Arthur Dooner","company":"Databricks","job_title":"Senior Specialist Solutions Architect","bio":"I am an SSA at Databricks specializing in \"Enterprise Data Science\": distilling real world applications of emerging technologies in AI and ML to apply them for Enterprise scale, value, security, and quality. <br \/>\n<br \/>\nMy strongest specialization is in building Generative AI Enterprise Applications, but other specializations of mine include:<br \/>\n- Compound AI System Design<br \/>\n- MLOps<br \/>\n- Advanced ML Evaluation and Testing<br \/>\n- Azure Infrastructure (I was a Microsoft CSA before Databricks)<br \/>\n- Delta Table Optimization","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/arthur_dooner_1744691142962001VcZp.png?h=cef46eb6&itok=s8NGZKXU","alt":"Arthur Dooner"}},{"name":"Jyotsna Bharadwaj","company":"Databricks","job_title":"Senior Solutions Architect","bio":"I am a Senior Solutions Architect at Databricks . I Help Architect and Build Innovative Data and AI solutions for Enterprise Customers  <br \/>\nPrior:<br \/>\n25+ years in the software industry<br \/>\nHave successfully spearheaded numerous complex global IT programs<br \/>\nNokia , Ericsson , Wipro , Tata Consultancy Services <br \/>\n<br \/>\nEducation:<br \/>\nMasters in CS (Machine Learning), Georgia Institute of Technology<br \/>\nBachelors in Electrical Engineering","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/jyotsna_1745242033134001WcQ4.jpg?h=a7ffc51c&itok=kAPt5iET","alt":"Jyotsna Bharadwaj"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/best-practices-building-user-facing-ai-systems-databricks","alias":"\/data-ai-summit-2025\/session\/best-practices-building-user-facing-ai-systems-databricks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533820+00:00"}
{"id":"D25B2792","title":"Beyond AI Accuracy: Building Trustworthy and Responsible AI Application Through Mosaic AI Framework","description":"<p>Generic LLM metrics are useless until it meets your business needs.In this session we will dive deep into creating bespoke custom state-of-the-art AI metrics that matters to you. Discuss best practices on LLM evaluation strategies, when to use LLM judge vs. statistical metrics and many more.<\/p><p> <\/p><p>Through a live demo using Mosaic AI Framework, we will showcase:<\/p><ul>\t<li>How you can build your own custom AI metric tailored to your needs for your GenAI application<\/li>\t<li>Implement autonomous AI evaluation suite for complex, multi-agent systems<\/li>\t<li>Generate ground truth data at scale and production monitoring strategies<\/li>\t<li>Drawing from extensive experience on working with customers on real-world use cases, we will share actionable insights on building a robust AI evaluation framework<\/li><\/ul><p> <\/p><p>By the end of this session, you'll be equipped to create AI solutions that are not only powerful but also relevant to your organizations needs. Join us to transform your AI strategy and make a tangible impact on your business!<\/p>","track":"Artificial Intelligence","level":"Advanced","type":"Breakout","industry":["Enterprise Technology, Health and Life Sciences, Financial Services"],"category":["MLFlow, Llama, Mosaic AI"],"areas_of_interest":["AI Agents, Generative AI (LLMs), Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Ananya Roy","company":"Databricks","job_title":"Specialist Solution Architect","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/beyond-ai-accuracy-building-trustworthy-and-responsible-ai-application","alias":"\/data-ai-summit-2025\/session\/beyond-ai-accuracy-building-trustworthy-and-responsible-ai-application","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533827+00:00"}
{"id":"D25L2723","title":"Beyond the Privacy-Utility Tradeoff: Differential Privacy in Tabular Data Synthesis","description":"<p>As organizations increasingly leverage sensitive data for AI applications, generating high quality synthetic data with mathematical guarantees of privacy has become crucial. This talk explores the use of Gretel Navigator to generate differentially private synthetic data that maintains high fidelity to the source data and high utility on downstream tasks across heterogeneous datasets. Our analysis covers a framework for privacy-preserving synthetic data generation with two use cases: patient events and e-commerce reviews. We reveal nuanced strategies for: calibrating privacy parameters ε and δ for mixed-modal data, leveraging both record-level and user-level differential privacy depending on which entity in the dataset requires protection, maintaining statistical properties and high utility on downstream classification tasks under stringent privacy constraints (e.g., <0.05 difference in AUC when using DP), and quantifying resilience to membership inference and attribute inference attacks.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Lightning Talk","industry":["Enterprise Technology, Health and Life Sciences, Financial Services"],"category":["Llama, PyTorch"],"areas_of_interest":["Data Science, Generative AI (LLMs), Machine Learning, Open Source"],"delivery":["In Person"],"speakers":[{"name":"Lipika Ramaswamy","company":"NVIDIA","job_title":"Research Scientist","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/beyond-privacy-utility-tradeoff-differential-privacy-tabular-data","alias":"\/data-ai-summit-2025\/session\/beyond-privacy-utility-tradeoff-differential-privacy-tabular-data","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533834+00:00"}
{"id":"D25B3291DBX","title":"Boosting Data Science and AI Productivity With Databricks Notebooks","description":"<p>Want to accelerate your team's data science workflow? This session reveals how Databricks Notebooks can transform your productivity through an optimized environment designed specifically for data science and AI work. Discover how notebooks serve as a central collaboration hub where code, visualizations, documentation and results coexist seamlessly, enabling faster iteration and development.<\/p><p> <\/p><p>Key takeaways:<\/p><ul>\t<li>Leveraging interactive coding features including multi-language support, command-mode shortcuts and magic commands<\/li>\t<li>Implementing version control best practices through Git integration and notebook revision history<\/li>\t<li>Maximizing collaboration through commenting, sharing and real-time co-editing capabilities<\/li>\t<li>Streamlining ML workflows with built-in MLflow tracking and experiment management<\/li><\/ul><p> <\/p><p>You'll leave with practical techniques to enhance your notebook-based workflow and deliver AI projects faster with higher-quality results.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Jason Cui","company":"Databricks","job_title":null,"bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/boosting-data-science-and-ai-productivity-databricks-notebooks","alias":"\/data-ai-summit-2025\/session\/boosting-data-science-and-ai-productivity-databricks-notebooks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533838+00:00"}
{"id":"D25L1490","title":"Bridging Big Data and AI: Empowering PySpark With Lance Format for Multi-Modal AI Data Pipelines","description":"<p>PySpark has long been a cornerstone of big data processing, excelling in data preparation, analytics and machine learning tasks within traditional data lakes. However, the rise of multimodal AI and vector search introduces challenges beyond its capabilities. Spark’s new Python data source API enables integration with emerging AI data lakes built on the multi-modal Lance format. Lance delivers unparalleled value with its zero-copy schema evolution capability and robust support for large record-size data (e.g., images, tensors, embeddings, etc), simplifying multimodal data storage. Its advanced indexing for semantic and full-text search, combined with rapid random access, enables high-performance AI data analytics to the level of SQL. By unifying PySpark's robust processing capabilities with Lance's AI-optimized storage, data engineers and scientists can efficiently manage and analyze the diverse data types required for cutting-edge AI applications within a familiar big data framework.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Lightning Talk","industry":["Enterprise Technology"],"category":["Apache Spark, AI\/BI"],"areas_of_interest":["Data Applications, Data Ingestion, Generative AI (LLMs), Open Source"],"delivery":["In Person"],"speakers":[{"name":"Allison Wang","company":"Databricks","job_title":"Staff Software Engineer","bio":"Allison is a software engineer at Databricks, working on Spark SQL and PySpark. She holds a Bachelor’s degree in Computer Science from Carnegie Mellon University.","image":{}},{"name":"LU QIU","company":"LanceDB","job_title":"Database Engineer","bio":"Lu is a Database engineer at LanceDB. Lu builds distributed vector databases at LanceDB and integrates Lance with the big data ecosystem. She developed the distributed system Alluxio as its PMC maintainer. She's also a Data on Kubernetes Ambassador and Kubernetes community evangelist, bridging AI data infrastructure with cloud-native technologies.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Lu_1745630576571001FHkh.jpg?h=0a24b165&itok=hAkgy0Xc","alt":"LU QIU"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/bridging-big-data-and-ai-empowering-pyspark-lance-format-multi-modal-ai","alias":"\/data-ai-summit-2025\/session\/bridging-big-data-and-ai-empowering-pyspark-lance-format-multi-modal-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533866+00:00"}
{"id":"D25B3296DBX","title":"Bringing AI to Your Data: Using SQL Functions in Databricks","description":"<p>Databricks AI Functions make it easy for analysts and data engineers to integrate advanced AI capabilities into data workflows — no ML expertise is required. These built-in SQL functions let you apply tasks like sentiment analysis, text summarization and language translation directly to data in Databricks, whether you're working in SQL queries, notebooks, DLT or Jobs. This session will walk through practical applications of both general-purpose and task-specific AI Functions, showing how to analyze text data at scale using simple SQL. You'll learn how to convert unstructured content into structured insights, and how to embed AI directly into batch pipelines and analytics processes.<\/p><p> <\/p><p>What you’ll learn:<\/p><ul>\t<li>How to use AI Functions for reliable, scalable batch processing of large datasets<\/li>\t<li>Best practices for managing cost and performance when applying AI at scale<\/li>\t<li>Real-world examples of AI Functions improving productivity and insights in production environments<\/li><\/ul>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Databricks SQL, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Ahmed Bilal","company":"Databricks","job_title":null,"bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/bringing-ai-your-data-using-sql-functions-databricks","alias":"\/data-ai-summit-2025\/session\/bringing-ai-your-data-using-sql-functions-databricks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533870+00:00"}
{"id":"D25B3300DBX","title":"Build and Deploy Fine-Tuned Models on Mosaic AI","description":"<p>Want to create AI models that truly understand your business? This session shows you how to customize foundation models for your specific needs using Databricks' Mosaic AI Model Training. We'll walk through the complete process of taking open-source models and fine-tuning them with your enterprise data to create specialized solutions that outperform generic alternatives.<\/p><p> <\/p><p>Key takeaways:<\/p><ul>\t<li>Creating cost-effective custom models with domain-specific accuracy<\/li>\t<li>Selecting the right fine-tuning approach for your specific use cases<\/li>\t<li>Deploying models with one-click using Mosaic AI Model Serving<\/li>\t<li>Implementing evaluation strategies to measure quality improvements<\/li>\t<li>Ensuring data security and governance throughout the process<\/li><\/ul><p> <\/p><p>Whether you're looking to enhance customer interactions or extract insights from specialized content, you'll leave with practical knowledge to build AI models that speak your business language.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Tejas Sundaresan","company":null,"job_title":null,"bio":null,"image":{}},{"name":"Nancy Hung","company":"Databricks","job_title":"Sr Software Engineer","bio":"Nancy is a backend software engineering and working on empowering enterprise users to securely customize their own LLMs. Prior to MosaicML \/ Databricks, she has worked on applying ML insights to production applications for credit risk underwriting at Stripe and recommending patients to doctors in healthcare. Outside of work, she enjoys long-distance running and exploring new bakeries.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/build-and-deploy-fine-tuned-models-mosaic-ai","alias":"\/data-ai-summit-2025\/session\/build-and-deploy-fine-tuned-models-mosaic-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533877+00:00"}
{"id":"D25B3061","title":"Building AI Models In Health Care Using Semi-Synthetic Data","description":"<p>Regulated or restricted fields like Health Care make collecting training data complicated. We all want to do the right thing, but how? This talk will look at how Fight Health Insurance used de-identified public and proprietary information to create a semi-synthetic training set for use in fine-tuning machine learning models to power Fight Paperwork. We'll explore how to incorporate the latest \"reasoning\" techniques in fine tuning as well as how to make models that you can afford to serve — think single GPU inference instead of a cluster of A100s.<\/p><p> <\/p><p>In addition to the talk we have the code used in a public GitHub repo — although it is a little rough, so you might want to use it more as a source of inspiration rather than directly forking it. <\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Health and Life Sciences"],"category":["Llama"],"areas_of_interest":["Generative AI (LLMs), Open Source"],"delivery":["In Person"],"speakers":[{"name":"Holden Karau","company":"Fight Health Insurance INC","job_title":"Co-founder","bio":"Holden is a transgender Canadian open source developer with a focus on Apache Spark, and related \"big data\" tools. By day (and night, go go startup life) she works on brining large language models and other AI tools to help healthcare users deal with insurance through https:\/\/www.fighthealthinsurance.com & https:\/\/www.fightpaperwork.com She is the co-author of Learning Spark, High Performance Spark, and a few others. She is a committer and PMC on Apache Spark. She was tricked into the world of big data while trying to improve search and recommendation systems and has long since forgotten her original goal.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/image1_1742965247502001kGQU.png?h=40f5e6bb&itok=NimszQ0y","alt":"Holden Karau"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/building-ai-models-health-care-using-semi-synthetic-data","alias":"\/data-ai-summit-2025\/session\/building-ai-models-health-care-using-semi-synthetic-data","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533897+00:00"}
{"id":"D25B3287DBX","title":"Building and Scaling Production AI Systems With Mosaic AI","description":"<p>Ready to go beyond the basics of Mosaic AI? This session will walk you through how to architect and scale production-grade AI systems on the Databricks Data Intelligence Platform. We’ll cover practical techniques for building end-to-end AI pipelines — from processing structured and unstructured data to applying Mosaic AI tools and functions for model development, deployment and monitoring.<\/p><p> <\/p><p>You’ll learn how to integrate experiment tracking with MLflow, apply performance tuning and use built-in frameworks to manage the full AI lifecycle. By the end, you’ll be equipped to design, deploy and maintain AI systems that deliver measurable outcomes at enterprise scale.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Hanlin Tang","company":"Databricks","job_title":"CTO, Neural Networks","bio":null,"image":{}},{"name":"Akhil Gupta","company":"Databricks","job_title":"VP of Engineering","bio":"Akhil Gupta is  VP of Engineering leading the AI Systems Group at Databricks. He is responsible for building  tools and products that enable developers to easily build and deploy AI applications. Prior to Databricks, he was the CEO\/Co-Founder of Rubicon which was acquired by Databricks in 2023. He has previously lead product and engineering at at Dropbox and Google.<br \/>\nAkhil holds a bachelor degree in computer science from the Indian Institute of Technology and a master’s degree in Computer Science from the University of Maryland. He is the proud father of two children.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/building-and-scaling-production-ai-systems-mosaic-ai","alias":"\/data-ai-summit-2025\/session\/building-and-scaling-production-ai-systems-mosaic-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533901+00:00"}
{"id":"D25B3075","title":"Building Intelligent AI Agents With Claude Models and Databricks Mosaic AI Framework","description":"<p>Explore how Anthropic's frontier models power AI agents in Databricks Mosaic AI Agent Framework. Learn to leverage Claude's state-of-the-art capabilities for complex agentic workflows while benefiting from Databricks unified governance, credential management and evaluation tools. We'll demonstrate how Anthropic's models integrate seamlessly to create production-ready applications that combine Claude's reasoning with Databricks data intelligence capabilities.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["AI Agents, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Sam Flamini","company":"Anthropic","job_title":"Technical Staff","bio":null,"image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/speaker_1743550737377001F0kk.png?h=c35ab9d9&itok=kY4KEJxN","alt":"Sam Flamini"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/building-intelligent-ai-agents-claude-models-and-databricks-mosaic-ai","alias":"\/data-ai-summit-2025\/session\/building-intelligent-ai-agents-claude-models-and-databricks-mosaic-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533909+00:00"}
{"id":"D25B1876","title":"Building Knowledge Agents to Automate Document Workflows","description":"<p>One of the biggest promises for LLM agents is automating all knowledge work over unstructured data — we call these \"knowledge agents\". To date, while there are fragmented tools around data connectors, storage and agent orchestration, AI engineers have trouble building and shipping production-grade agents beyond basic chatbots.<\/p><p> <\/p><p>In this session, we first outline the highest-value knowledge agent use cases we see being built and deployed at various enterprises. These are:<\/p><ul>\t<li>Multi-step document research,<\/li>\t<li>Automated document extraction<\/li>\t<li>Report generation<\/li><\/ul><p> <\/p><p>We then define the core architectural components around knowledge management and agent orchestration required to build these use cases.<\/p><p> <\/p><p>By the end you'll not only have an understanding of the core technical concepts, but also an appreciation of the ROI you can generate for end-users by shipping these use cases to production. <\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, AI\/BI, Mosaic AI"],"areas_of_interest":["AI Agents, Data Ingestion, Generative AI (LLMs), Open Source"],"delivery":["In Person"],"speakers":[{"name":"Jerry Liu","company":"LlamaIndex","job_title":"Co-founder and CEO","bio":"Jerry is the co-founder\/CEO of LlamaIndex, the most accurate and secure platform to automate document workflows with AI agents. Before this, he led ML monitoring at Robust Intelligence, did self-driving AI research at Uber ATG, and worked on recommendation systems at Quora.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/jerry%2520square%2520%25282%2529_1745869935600001eKCo.jpg?h=e76d9467&itok=1H-eD20G","alt":"Jerry Liu"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/building-knowledge-agents-automate-document-workflows","alias":"\/data-ai-summit-2025\/session\/building-knowledge-agents-automate-document-workflows","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533912+00:00"}
{"id":"D25B3304DBX","title":"Building Tool-Calling Agents With Databricks Agent Framework and MCP","description":"<p>Want to create AI agents that can do more than just generate text? Join us to explore how combining Databricks' Mosaic AI Agent Framework with the Model Context Protocol (MCP) unlocks powerful tool-calling capabilities. We'll show you how MCP provides a standardized way for AI agents to interact with external tools, data and APIs, solving the headache of fragmented integration approaches. Learn to build agents that can retrieve both structured and unstructured data, execute custom code and tackle real enterprise challenges.<\/p><p> <\/p><p>Key takeaways:<\/p><ul>\t<li>Implementing MCP-enabled tool-calling in your AI agents<\/li>\t<li>Prototyping in AI Playground and exporting for deployment<\/li>\t<li>Integrating Unity Catalog functions as agent tools<\/li>\t<li>Ensuring governance and security for enterprise deployments<\/li><\/ul><p> <\/p><p>Whether you're building customer service bots or data analysis assistants, you'll leave with practical know-how to create powerful, governed AI agents.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Siddharth Murching","company":null,"job_title":"Software Engineer","bio":null,"image":{}},{"name":"Elise Gonzales","company":"Databricks","job_title":"Staff Product Manager","bio":"Elise is a Product Manager on the Mosaic AI team at Databricks focused on building agents. Before Databricks, she ran the product team at Amperity, a Customer Data Platform, as well as working on HoloLens at Microsoft and Alexa at Amazon. She got her undergraduate degree in Computer Science at Carnegie Mellon.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/headshot_1746061492464001ImyV.png?h=a7e6d17b&itok=LtNiVDzo","alt":"Elise Gonzales"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/building-tool-calling-agents-databricks-agent-framework-and-mcp","alias":"\/data-ai-summit-2025\/session\/building-tool-calling-agents-databricks-agent-framework-and-mcp","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533934+00:00"}
{"id":"D25B1476","title":"Composing High-Accuracy AI Systems With SLMs and Mini-Agents","description":"<p>For most companies, building compound AI systems remains aspirational. LLMs are powerful, but imperfect, and their non-deterministic nature makes steering them to high accuracy a challenge. In this session, we’ll demonstrate how to build compound AI systems using SLMs and highly accurate mini-agents that can be integrated into agentic workflows. You'll learn about breakthrough techniques, including: memory RAG, an embedding algorithm that reduces hallucinations using embed-time compute to generate contextual embeddings, improving indexing and retrieval, and memory tuning, a finetuning algorithm that reduces hallucinations using a Mixture of Memory Experts (MoME) to specialize models with proprietary data. We’ll also share real-world examples (text-to-SQL, factual reasoning, function calling, code analysis and more) across various industries. With these building blocks, we’ll demonstrate how to create high accuracy mini-agents that can be composed into larger AI systems.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Breakout","industry":["Enterprise Technology, Health and Life Sciences, Financial Services"],"category":["AI\/BI, Llama"],"areas_of_interest":["AI Agents, Generative AI (LLMs), ML\/LLMOps, Open Source"],"delivery":["In Person"],"speakers":[{"name":"Sharon Zhou","company":"Lamini","job_title":"CEO & Cofounder","bio":"Dr. Sharon Zhou is the co-founder and CEO of Lamini, which has won this year’s VentureBeat Gen AI Startup Award and has been recognized as a Forbes Cloud 100 Rising Star. As a former faculty member at Stanford, she led a 50+ person Generative AI research group and published award-winning papers in generative AI. Sharon teaches popular AI courses on Coursera, including Fine-tuning LLMs. She earned her PhD in AI from Stanford, where she was advised by Dr. Andrew Ng. Before her PhD, she worked as an AI product manager at Google. She received her bachelor's degree in computer science and Classics from Harvard. Additionally, Sharon has served as an AI advisor in Washington, D.C., and has been featured in MIT Technology Review’s 35 Under 35 list.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Sharon%2527s%2520Portrait_1744744676272001ZOQ4.png?h=88bd6bb4&itok=xiGEXm3a","alt":"Sharon Zhou"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/composing-high-accuracy-ai-systems-slms-and-mini-agents","alias":"\/data-ai-summit-2025\/session\/composing-high-accuracy-ai-systems-slms-and-mini-agents","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533968+00:00"}
{"id":"D25D3295DBX","title":"Comprehensive Guide to MLOps on Databricks","description":"<p>This in-depth session explores advanced MLOps practices for implementing production-grade machine learning workflows on Databricks. We'll examine the complete MLOps journey from foundational principles to sophisticated implementation patterns, covering essential tools including MLflow, Unity Catalog, Feature Stores and version control with Git. Dive into Databricks' latest MLOps capabilities including MLflow 3.0, which enhances the entire ML lifecycle from development to deployment with particular focus on generative AI applications.<\/p><p> <\/p><p>Key session takeaways include:<\/p><ul>\t<li>Advanced MLflow 3.0 features for LLM management and deployment<\/li>\t<li>Enterprise-grade governance with Unity Catalog integration<\/li>\t<li>Robust promotion patterns across development, staging and production<\/li>\t<li>CI\/CD pipeline automation for continuous deployment<\/li>\t<li>GenAI application evaluation and streamlined deployment<\/li><\/ul>","track":"Artificial Intelligence","level":"Intermediate","type":"Deep Dive","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[],"day":"Tuesday","room":"West, Level 2, Room 2016","starts":"2025-06-10T15:00:00","ends":"2025-06-10T16:30:00","starts_pst":"2025-06-10T08:00:00","ends_pst":"2025-06-10T09:30:00","start_time":"3:00 pm","end_time":"4:30 pm","pst_start_time":"8:00 am","pst_end_time":"9:30 am","duration":"90","path":"\/session\/comprehensive-guide-mlops-databricks","alias":"\/data-ai-summit-2025\/session\/comprehensive-guide-mlops-databricks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533979+00:00"}
{"id":"D25L3392","title":"Cracking Complex Documents with Databricks Mosaic AI","description":"<p>In this session, we will share how we are transforming the way organizations process unstructured and non-standard documents using Mosaic AI and agentic patterns within the Databricks ecosystem. We have developed a scalable pipeline that turns complex legal and regulatory content into structured, tabular data.We will walk through the full architecture, which includes Unity Catalog for secure and governed data access, Databricks Vector Search for intelligent indexing and retrieval and Databricks Apps to deliver clear insights to business users.<\/p><p> <\/p><p>The solution supports multiple languages and formats, making it suitable for teams working across different regions. We will also discuss some of the key technical challenges we addressed, including handling parsing inconsistencies, grounding model responses and ensuring traceability across the entire process.<\/p><p> <\/p><p>If you are exploring how to apply GenAI and large language models, this session is for you.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Lightning Talk","industry":["Financial Services"],"category":["AI\/BI, Mosaic AI, Unity Catalog"],"areas_of_interest":["AI Agents"],"delivery":["In Person"],"speakers":[{"name":"Gavita Regunath","company":"Advancing Analytics","job_title":"Principal Data Scientist","bio":"Gavita Regunath is a principal data scientist consultant with Advancing Analytics and a Microsoft AI MVP. She has a PhD in Computational and Experimental Fluid Dynamics and has over a decade of experience working with Data and AI within the aeronautical, automotive, finance and agritech industries. She is a advocate for women in data science, actively engaging with organizations such as Women in Data Science (WiDS) and Women in Data (WiD). Through her mentorship and support, she helps aspiring women professionals overcome obstacles and flourish in their careers, driving meaningful change in the industry. Gavita is addicted to learning and in her spare time when she is not blogging or talking about AI, she enjoys being a mother, going for a run and cooking something new.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/cracking-complex-documents-databricks-mosaic-ai","alias":"\/data-ai-summit-2025\/session\/cracking-complex-documents-databricks-mosaic-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533993+00:00"}
{"id":"D25B3153","title":"Data Intelligence for Marketing Breakout: Agentic Systems for Bayesian MMM and Consumer Testing","description":"<p>This talk dives into leveraging GenAI to scale sophisticated decision intelligence. Learn how an AI copilot interface simplifies running complex Bayesian probabilistic models, accelerating insight generation, and accurate decision making at the enterprise level. We talk through techniques for deploying AI agents at scale to simulate market dynamics or product feature impacts, providing robust, data-driven foresight for high-stakes innovation and strategy directly within your Databricks environment. For marketing teams, this approach will help you leverage autonomous AI agents to dynamically manage media channel allocation while simulating real-world consumer behavior through synthetic testing environments.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Media and Entertainment"],"category":["MLFlow, Mosaic AI, Unity Catalog"],"areas_of_interest":["AI Agents, Data Science, Marketing, Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Dan Morris","company":"Databricks","job_title":"Marketing Solutions GTM","bio":null,"image":{}},{"name":"Luca Fiaschi","company":"PyMC Labs","job_title":"Partner","bio":"With over 15 years of leadership experience in AI, data science, and analytics, Luca has driven transformative growth in technology-first businesses. He is currently a partner at PyMC Labs, the leading Bayesian consultancy, developing applications of Bayesian Inference and Generative AI for 500 companies. Prior to that, Chief Data & AI Officer at Mistplay, he led the company’s revenue growth through AI-powered personalization and data-driven pricing. Earlier, he held executive roles at global industry leaders such as HelloFresh ($8B), Stitch Fix ($1.2B) and Rocket Internet ($1B).  Luca holds a PhD in Machine Learning from Heidelberg university, his core competencies include ML\/AI, MLOPS and data platform engineering.  ","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/headshot_1745542887928001yjnL.png?h=fbf7a813&itok=M6WCP6_J","alt":"Luca Fiaschi"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/data-intelligence-marketing-breakout-agentic-systems-bayesian-mmm-and","alias":"\/data-ai-summit-2025\/session\/data-intelligence-marketing-breakout-agentic-systems-bayesian-mmm-and","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534030+00:00"}
{"id":"D25B2925","title":"Databricks on Databricks: Transforming the Sales Experience using GenAI Agents at Scale","description":"<p>Databricks is transforming its sales experience with a GenAI agent — built and deployed entirely on Databricks — to automate tasks, streamline data retrieval, summarize content, and enable conversational AI for over 4,000 sellers. This agent leverages the AgentEval framework, AI Bricks, and Model Serving to process both structured and unstructured data within Databricks, unlocking deep sales insights. The agent seamlessly integrates across multiple data sources including Salesforce, Google Drive, and Glean securely via OAuth. This session includes a live demonstration and explores the business impact, architecture as well as agent development and evaluation strategies, providing a blueprint for deploying secure, scalable GenAI agents in large enterprises.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Breakout","industry":["Enterprise Technology, Health and Life Sciences, Retail and CPG - Food"],"category":["MLFlow, Mosaic AI, Unity Catalog"],"areas_of_interest":["AI Agents, Data Intelligence, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Akhil Aggrawal","company":"Databricks","job_title":"Enterprise Architect","bio":null,"image":{}},{"name":"Deepa Gopinath","company":"Databricks","job_title":"Senior Vice President, IT & Deputy CIO","bio":"Deepa Gopinath is a Senior Vice President, Deputy CIO at Databricks.  She has over 25 years of experience in the IT industry,  and most recently she is responsible for the business applications as well as data & analytics portfolio internally at Databricks. In her role, she works across HR, Finance, Marketing, Sales and Customer support functions on their data analytics needs and leverages the Databricks Intelligence platform to deliver use cases to drive efficiency and productivity in each of those functions. ","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/deepa-profile_1746034498494001TVia.jpg?h=429e261e&itok=Hw4DlZbK","alt":"Deepa Gopinath"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/databricks-databricks-transforming-sales-experience-using-genai-agents","alias":"\/data-ai-summit-2025\/session\/databricks-databricks-transforming-sales-experience-using-genai-agents","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534098+00:00"}
{"id":"D25B3299DBX","title":"Deploy and Scale AI Models With Mosaic Model Serving","description":"<p>Ever struggled with getting your AI models into production? Join us to discover how Databricks' Mosaic AI Model Serving takes the headache out of deploying both traditional ML and generative AI models at scale. This session demonstrates how to implement a highly available, auto-scaling service that optimizes performance while controlling costs. Discover deployment strategies for various model types — from custom models to foundation models like Llama 4 and external models from OpenAI and Anthropic — with proper governance through Mosaic AI Gateway.<\/p><p> <\/p><p>Key takeaways:<\/p><ul>\t<li>Selecting optimal deployment approaches based on use case and performance needs<\/li>\t<li>Integrating models with enterprise data using Feature Store and Vector Search<\/li>\t<li>Monitoring deployed models and ensuring security compliance<\/li>\t<li>Implementing efficient batch inference for large-scale processing<\/li><\/ul>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Ahmed Bilal","company":"Databricks","job_title":null,"bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/deploy-and-scale-ai-models-mosaic-model-serving","alias":"\/data-ai-summit-2025\/session\/deploy-and-scale-ai-models-mosaic-model-serving","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534164+00:00"}
{"id":"D25B3079","title":"DSPy 3.0 — and DSPy at Databricks","description":"<p>The DSPy OSS team at Databricks and beyond is excited to present DSPy 3.0, targeted for release close to DAIS 2025. We will present what DSPy is and how it evolved over the past year. We will discuss greatly improved prompt optimization and finetuning\/RL capabilities, improved productionization and observability via thorough and native integration with MLflow, and lessons from usage of DSPy in various Databricks R&D and professional services contexts.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology, Health and Life Sciences, Professional Services"],"category":["MLFlow, DSPy, Unity Catalog"],"areas_of_interest":["AI Agents, Generative AI (LLMs), Open Source"],"delivery":["In Person"],"speakers":[{"name":"Omar Khattab","company":null,"job_title":null,"bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/dspy-30-and-dspy-databricks","alias":"\/data-ai-summit-2025\/session\/dspy-30-and-dspy-databricks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534201+00:00"}
{"id":"D25L2755","title":"Empowering Fundraising With AI: A Journey With Databricks Mosaic AI","description":"<p>Artificial Intelligence (AI) is more than a corporate tool; it’s a force for good. At Doctors Without Borders\/Médecins Sans Frontières (MSF), we use AI to optimize fundraising, ensuring that every dollar raised directly supports life-saving medical aid worldwide.<\/p><p> <\/p><p>With Databricks, Mosaic AI and Unity Catalog, we analyze donor behavior, predict giving patterns and personalize outreach, increasing contributions while upholding ethical AI principles. This session will showcase how AI maximizes fundraising impact, enabling faster crisis response and resource allocation.<\/p><p> <\/p><p>We’ll explore predictive modeling for donor engagement, secure AI governance with Unity Catalog and our vision for generative AI in fundraising, leveraging AI-assisted storytelling to deepen donor connections.<\/p><p> <\/p><p>AI is not just about efficiency; it’s about saving lives. Join us to see how AI-driven fundraising is transforming humanitarian aid on a global scale.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Lightning Talk","industry":["Public Sector"],"category":["Mosaic AI, Unity Catalog"],"areas_of_interest":["Data Science, Machine Learning, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Amina Alavi","company":"Doctors Without Borders","job_title":"Director of Data Science","bio":"Amina Alavi is the Director of Analytics and Data Science at Doctors Without Borders, where she is leading the development of a comprehensive data strategy and roadmap for harnessing analytics and artificial intelligence. Her work is instrumental in transforming the organization into a data-driven entity, with a particular focus on optimizing fundraising, marketing, and digital communications. Prior to her current role, Amina was leading the Data Warehouse team at United Nations Children’s Fund (UNICEF) for over 7 years. She has a Master's degree in Data Science from the University of California, Berkeley. ","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Amina_pic_1744394715124001lKky.JPG?h=54107417&itok=2F-GzgD6","alt":"Amina Alavi"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/empowering-fundraising-ai-journey-databricks-mosaic-ai","alias":"\/data-ai-summit-2025\/session\/empowering-fundraising-ai-journey-databricks-mosaic-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534228+00:00"}
{"id":"D25B1218","title":"Empowering the Warfighter With AI","description":"<p>The new Budget Execution Validation process has transformed how the Navy reviews unspent funds. Powered by Databricks Workflows, MLflow, Delta Lake and Apache Spark™, this data-driven model predicts which financial transactions are most likely to have errors, streamlining reviews and increasing accuracy. In FY24, it helped review $40 billion, freeing $1.1 billion for other priorities, including $260 million from active projects. By reducing reviews by 80%, cutting job runtime by over 50% and lowering costs by 60%, it saved 218,000 work hours and $6.7 million in labor costs. With automated workflows and robust data management, this system exemplifies how advanced tools can improve financial decision-making, save resources and ensure efficient use of taxpayer dollars.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Professional Services, Public Sector, Financial Services"],"category":["Apache Spark, AI\/BI, Databricks Workflows"],"areas_of_interest":["Collaboration, Data Science, Machine Learning"],"delivery":["In Person"],"speakers":[{"name":"Teneika Askew","company":"Navy","job_title":"Data Science Director","bio":null,"image":{}},{"name":"Teneika Askew","company":"Navy","job_title":"Data Science Director","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/empowering-warfighter-ai","alias":"\/data-ai-summit-2025\/session\/empowering-warfighter-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534239+00:00"}
{"id":"D25B3018","title":"Entity Resolution for the Best Outcomes on Your Data","description":"<p>There are many ways to implement entity resolution (ER) system — both using vendor software and open-source libraries that enable DIY Entity Resolution. However, generally we see common challenges with any approach — scalability, bound to a single model architecture, lack of metrics and explainability, and stagnant implementations that do not \"learn\" with experience. Recent experiments with transformer-based approaches, fast lookups with vector search and Databricks components such as Databricks Apps and Agent Eval provide the foundations for a composable ER system that can get better with time on your data. In this presentation, we include a demo of how to use these components to build a composable ER that has the best outcomes for your data.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Health and Life Sciences, Manufacturing"],"category":["MLFlow, Mosaic AI, Databricks Apps"],"areas_of_interest":["Data Applications, Machine Learning, Open Source"],"delivery":["In Person"],"speakers":[{"name":"Yinxi Zhang","company":"Databricks","job_title":"Staff Data Scientist","bio":"Yinxi Zhang is a Staff Data Scientist at Databricks, where she works with customers to build GenAI applications at scale. Prior to joining Databricks, Yinxi worked as an ML specialist in the energy industry for 7 years, optimizing production for conventional and renewable assets. She holds a Ph.D. in Electrical Engineering from the University of Houston. Yinxi is a former marathon runner, and is now a happy yogi.","image":{}},{"name":"Ninad Sohoni","company":"Databricks","job_title":"DSA","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/entity-resolution-best-outcomes-your-data","alias":"\/data-ai-summit-2025\/session\/entity-resolution-best-outcomes-your-data","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534263+00:00"}
{"id":"D25B3306DBX","title":"Evaluating Domain-Specific Agent Performance and Metrics","description":"<p>This session explores comprehensive methodologies for assessing agent performance across specialized knowledge domains, tailored workflows and task-specific objectives. We'll demonstrate practical approaches to designing robust evaluation metrics that align with your business goals and provide meaningful insights into agent capabilities and limitations.<\/p><p> <\/p><p>Key session takeaways include:<\/p><ul>\t<li>Frameworks for creating domain-relevant evaluation datasets and benchmarks that accurately reflect real-world use cases<\/li>\t<li>Techniques for quantifying agent effectiveness through metrics including accuracy, relevance and even custom business objectives<\/li>\t<li>Strategies for interpreting evaluation results to drive iterative improvement in agent performance<\/li><\/ul><p> <\/p><p>Join us to learn how proper evaluation methodologies can transform your domain-specific agents from experimental tools to trusted enterprise solutions with measurable business value.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Eric Peter","company":"Databricks","job_title":null,"bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/evaluating-domain-specific-agent-performance-and-metrics","alias":"\/data-ai-summit-2025\/session\/evaluating-domain-specific-agent-performance-and-metrics","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534267+00:00"}
{"id":"D25B2912","title":"Evaluation-Driven Development Workflows: Best Practices and Real-World Scenarios","description":"<p>In enterprise AI, Evaluation-Driven Development (EDD) ensures reliable, efficient systems by embedding continuous assessment and improvement into the AI development lifecycle. High-quality evaluation datasets are created using techniques like document analysis, synthetic data generation via Mosaic AI’s synthetic data generation API, SME validation, and relevance filtering, reducing manual effort and accelerating workflows.<\/p><p> <\/p><p>EDD focuses on metrics such as context relevance, groundedness, and response accuracy to identify and address issues like retrieval errors or model limitations. Custom LLM judges, tailored to domain-specific needs like PII detection or tone assessment, enhance evaluations.<\/p><p> <\/p><p>By leveraging tools like Mosaic AI Agent Framework and Agent Evaluation, MLflow, EDD automates data tracking, streamlines workflows, and quantifies improvements, transforming AI development for delivering scalable, high-performing systems that drive measurable organizational value.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology, Manufacturing, Financial Services"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["AI Agents, Data Science, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Arthur Dooner","company":"Databricks","job_title":"Senior Specialist Solutions Architect","bio":"I am an SSA at Databricks specializing in \"Enterprise Data Science\": distilling real world applications of emerging technologies in AI and ML to apply them for Enterprise scale, value, security, and quality. <br \/>\n<br \/>\nMy strongest specialization is in building Generative AI Enterprise Applications, but other specializations of mine include:<br \/>\n- Compound AI System Design<br \/>\n- MLOps<br \/>\n- Advanced ML Evaluation and Testing<br \/>\n- Azure Infrastructure (I was a Microsoft CSA before Databricks)<br \/>\n- Delta Table Optimization","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/arthur_dooner_1744691142962001VcZp.png?h=cef46eb6&itok=s8NGZKXU","alt":"Arthur Dooner"}},{"name":"Wenwen Xie","company":"Databricks","job_title":"Specialist Solutions Architect","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/evaluation-driven-development-workflows-best-practices-and-real-world","alias":"\/data-ai-summit-2025\/session\/evaluation-driven-development-workflows-best-practices-and-real-world","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534270+00:00"}
{"id":"D25B2514","title":"Evolving Agent Complexity: Building Multi-Agent Systems With Mosaic AI","description":"<p>This session dives into building multi-agent systems on the Mosaic AI Platform, exploring the techniques, architectures and lessons learned from experiences building Greenlight’s real-world agent applications. This presentation is well suited for executives, product managers and engineers alike, breaking down AI Agents into easy-to-understand concepts, while presenting an architecture for building complex systems.<\/p><p> <\/p><p>We’ll examine the core components of generative AI Agents and different ways to assemble them into agents, including different prompting and reasoning techniques. We’ll cover how the Mosaic AI Platform has enabled our small team to build, deploy and monitor our AI Agents, touching on vector search, feature and model serving endpoints, and the evaluation framework. Finally, we’ll discuss the pros and cons of building a multi-agent system consisting of specialized agents vs. a single large agent for Greenlight’s AI Assistant, and the challenges we encountered.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Financial Services"],"category":["MLFlow, Mosaic AI, Unity Catalog"],"areas_of_interest":["AI Agents, Generative AI (LLMs), ML\/LLMOps"],"delivery":["In Person"],"speakers":[{"name":"Tim Mullins","company":"Greenlight Financial Technology","job_title":"Staff Machine Learning Engineer","bio":"Tim Mullins is a Staff Machine Learning Engineer at Greenlight, where he leads efforts on the full lifecycle of their ML implementations including development, deployment, and operations of ML and GenAI applications. <br \/>\n<br \/>\nPrior to Greenlight, Tim built a strong foundation in Data Science and Data Engineering at Cardlytics, implementing ML solutions, designing data pipelines, and building enterprise data warehouses. He holds an MS in Computer Science (Machine Learning) from Georgia Tech and a BS in Information Systems from Kennesaw State University. ","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Tim_Mullins_1744293078549001s22j.png?h=97102f31&itok=gSsdw3Jm","alt":"Tim Mullins"}},{"name":"Shanduojiao Jiang","company":"Greenlight Financial Technology","job_title":"Machine Learning Engineer","bio":"SJ is a Machine Learning Engineer at Greenlight, where she designs, implements, and deploys full-stack AI\/ML solutions that seamlessly integrate with Greenlight's systems. Her work spans the entire lifecycle of AI applications—from model development to scalable, production-grade deployment.<br \/>\n<br \/>\nShe holds an M.S. in Computer Science from Stanford University and a B.S. in Computer Science from the University of Illinois. With multiple ML\/AI publications and a strong technical foundation built through roles at Google and other companies, SJ brings a rare combination of research depth and production rigor.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/shanduojiao_jiang_1745509231513001WQNf.png?h=e392df01&itok=zrZ08D3f","alt":"Shanduojiao Jiang"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/evolving-agent-complexity-building-multi-agent-systems-mosaic-ai","alias":"\/data-ai-summit-2025\/session\/evolving-agent-complexity-building-multi-agent-systems-mosaic-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534275+00:00"}
{"id":"D25B2760","title":"From Code Completion to Autonomous Software Engineering Agents","description":"<p>As language models have advanced, they have moved beyond code completion and are beginning to tackle software engineering tasks in a more autonomous, agentic way. However, evaluating agentic capabilities is challenging. To address this, we first introduce SWE-bench, a benchmark built from real GitHub issues that has become the standard for assessing AI’s ability to resolve complex software tasks in large codebases. We will discuss the current state of the field, the limitations of today’s models, and how far we still are from truly autonomous AI developers. Next, we will explore the fundamentals of agents based on hands-on demonstrations with SWE-agent, a simple yet powerful agent framework designed for software engineering but adaptable to a variety of domains. By the end of this session, you will have a clear understanding of the current frontier of agentic AI in software engineering, the challenges ahead and how you can experiment with AI agents in your own workflows.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Breakout","industry":["Enterprise Technology"],"category":["AI\/BI"],"areas_of_interest":["AI Agents, Generative AI (LLMs), Open Source"],"delivery":["In Person"],"speakers":[{"name":"Kilian Lieret","company":"Princeton University","job_title":"Research Software Engineer","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/code-completion-autonomous-software-engineering-agents","alias":"\/data-ai-summit-2025\/session\/code-completion-autonomous-software-engineering-agents","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534313+00:00"}
{"id":"D25B1956","title":"From Metadata to Agents: Building the future of content understanding with Coactive AI + Databricks","description":"<p>Media enterprises generate vast amounts of visual content, but unlocking its full potential requires multimodal AI at scale. Coactive AI and NBCUniversal’s Corporate Decision Sciences team are transforming how enterprises discover and understand visual content. We explore how Coactive AI and Databricks — from Delta Share to Genie — can revolutionize media content search, tagging and enrichment, enabling new levels of collaboration.<\/p><p> <\/p><p>Attendees will see how this AI-powered approach fuels AI workflows, enhances BI insights and drives new applications — from automating cut sheet generation to improving content compliance and recommendations. By structuring and sharing enriched media metadata, Coactive AI and NBCU are unlocking deeper intelligence and laying the groundwork for agentic AI systems that retrieve, interpret and act on visual content. This session will showcase real-world examples of these AI agents and how they can reshape future content discovery and media workflows.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Breakout","industry":["Enterprise Technology, Media and Entertainment"],"category":["AI\/BI, Databricks SQL, Delta Sharing"],"areas_of_interest":["AI Agents, Data Intelligence, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"William Gaviria Rojas","company":"Coactive Systems Inc","job_title":"Field CTO & Co-Founder","bio":"Will has previously worked as a Data Scientist at eBay and held various roles as a visiting researcher. He holds a PhD in Materials Science from Northwestern University, where he was advised by Professor Mark Hersam, and a B.S. from MIT. His academic work spans from IoT electronics, to design and performance benchmarking of deep learning in neuromorphic systems.","image":{}},{"name":"Augusto Moreno","company":"NBC Universal","job_title":"SVP Data Science, Media Group","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/metadata-agents-building-future-content-understanding-coactive-ai","alias":"\/data-ai-summit-2025\/session\/metadata-agents-building-future-content-understanding-coactive-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534330+00:00"}
{"id":"D25L1458","title":"Fueling Efficiency: How Pilot Uses Vector Stores, Data Quality, and GenAI to Deliver Business Value","description":"In the complex world of logistics, efficiency and accuracy are paramount. At Pilot, the largest travel center network in North America, managing fuel delivery operations was a time-intensive and error-prone process. Tasks like processing delivery records and validating fuel transaction data posed significant challenges due to the diverse formats and handwritten elements involved. After several attempts to use robotic process automation failed, the team turned to Generative AI to automate and streamline this critical business process. In this session, discover how Pilot leverages GenAI, powered by advanced text and vision models, to revolutionize BOL processing. By implementing few-shot learning and vectorized examples, the data team at Pilot was able to increase document parsing accuracy from 70% to 95%, enabling real-time validation against truck driver inputs, which has resulted in millions of savings from accelerating credit reconciliation and improved financial operations.","track":"Artificial Intelligence","level":"Intermediate","type":"Lightning Talk","industry":["Energy and Utilities, Travel and Hospitality"],"category":["MLFlow, AI\/BI"],"areas_of_interest":["Generative AI (LLMs), ML\/LLMOps, Open Source"],"delivery":["In Person"],"speakers":[{"name":"Travis Lawrence","company":"Pilot Travel Centers","job_title":"Sr Manager, Machine Learning Engineering","bio":"Dr. Travis Lawrence leads the GenAI team at Pilot Travel Centers, where he applies cutting-edge artificial intelligence to transform travel center operations. His background bridges academic research and industry application, having earned his PhD from University of California, Merced and continued his research at Oak Ridge National Laboratory. Dr. Lawrence specializes in translating complex AI capabilities into practical business solutions that drive efficiency and enhance customer experiences in the retail travel sector.​​​​​​​​​​​​​​​​","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Travis_Lawrence_1744841605873001otcp.jpg?h=9850cf84&itok=OhQyRNXY","alt":"Travis Lawrence"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/fueling-efficiency-how-pilot-uses-vector-stores-data-quality-and-genai","alias":"\/data-ai-summit-2025\/session\/fueling-efficiency-how-pilot-uses-vector-stores-data-quality-and-genai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534348+00:00"}
{"id":"D25L3290DBX","title":"Gaining Insight From Image Data in Databricks Using Multi-Modal Foundation Model API","description":"<p>Unlock the hidden potential in your image data without specialized computer vision expertise! This session explores how to leverage Databricks' multi-modal Foundation Model APIs to analyze, classify and extract insights from visual content. Learn how Databricks provides a unified API to understand images using powerful foundation models within your data workflows.<\/p><p> <\/p><p>Key takeaways:<\/p><ul>\t<li>Implementing efficient workflows for image data processing within your Databricks lakehouse<\/li>\t<li>Understanding multi-modal foundation models for image understanding<\/li>\t<li>Integrating image analysis with other data types for business insights<\/li>\t<li>Using OpenAI-compatible APIs to query multi-modal models<\/li>\t<li>Building end-to-end pipelines from image ingestion to model deployment<\/li><\/ul><p> <\/p><p>Whether analyzing product images, processing visual documents or building content moderation systems, you'll discover how to extract valuable insights from your image data within the Databricks ecosystem.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Lightning Talk","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Madeleine Dawson","company":"Databricks","job_title":"Sr. Software Engineer","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/gaining-insight-image-data-databricks-using-multi-modal-foundation","alias":"\/data-ai-summit-2025\/session\/gaining-insight-image-data-databricks-using-multi-modal-foundation","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534352+00:00"}
{"id":"D25B2286","title":"GenAI for Finance and Audit—Getting to Production","description":"<p>During this session, we’ll demonstrate how KPMG’s audit practice has used the Databricks Data Intelligence Platform to transform the assessment of a company’s annual report and accounts.<\/p><p> <\/p><p>You’ll learn how we’ve built a robust GenAI solution that is live in production—including a multi-model optimized RAG pipeline, automated evaluations and end-to-end orchestration and monitoring within Databricks.<\/p><p> <\/p><p>We’re now able to perform thousands of legal and regulatory compliance checks on high complexity documents in minutes—a task that used to take auditors days and weeks.<\/p><p> <\/p><p>We’ll wrap up with a view on the broader impact AI is having on the audit, accounting and finance sector—and how the solution we’ve built is providing the foundations to accelerate future use cases.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Professional Services, Financial Services"],"category":["MLFlow, Databricks Workflows, Mosaic AI"],"areas_of_interest":["AI Agents, Generative AI (LLMs), ML\/LLMOps, Open Source"],"delivery":["In Person"],"speakers":[{"name":"Mark Wallington","company":"KPMG","job_title":"Head of Audit Analytics & AI","bio":"Mark leads KPMG's Audit Analytics & AI capability in the UK. He is responsible for building and deploying data and AI solutions that are used across thousands of audits in the UK and globally. He has previously worked in KPMG's Advisory practice building data solutions for client's across various industry sectors.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/105329_2_1745946493807001N45V.png?h=6c83441f&itok=ZdzfPbq7","alt":"Mark Wallington"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/genai-finance-and-audit-getting-production","alias":"\/data-ai-summit-2025\/session\/genai-finance-and-audit-getting-production","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534374+00:00"}
{"id":"D25B1051","title":"GenAI-Powered Shopping Assistant for Prada e-Commerce Search Bar","description":"<p>Prada has developed a complex solution, leveraging MosaicAI which powers its e-commerce search bar. The backbone is a 70B model and a Vector Store, which collaborates with additional filterings and AI solutions to suggest not only the perfect outfit for each occasion, but also provide alternative solutions and similar items.<\/p>","track":"Artificial Intelligence","level":"Advanced","type":"Breakout","industry":["Retail and CPG - Food"],"category":["MLFlow, Llama, Mosaic AI"],"areas_of_interest":["AI Agents, Generative AI (LLMs), ML\/LLMOps"],"delivery":["In Person"],"speakers":[{"name":"andrea adami","company":"Prada Group","job_title":"Data Scientist Manager","bio":"Distinguished professional in the field of data analytics and artificial intelligence. Currently, Maria Paola serves as the Lead Data Scientist at Prada Group, where she leads innovative projects to enhance the company's digital capabilities and customer engagement. Before joining Prada Group, Maria Paola worked for several years in tech consulting, focusing on data and AI. During this time, she gained extensive experience in implementing advanced analytics solutions and driving digital transformation for clients across various industries.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/MariaPaolaTatulli_1744302399309001CAZL.png?h=fbf7a813&itok=XZcv2aT5","alt":"andrea adami"}},{"name":"Maria Paola Tatulli","company":"Data Reply IT","job_title":"Senior Data Scientist","bio":null,"image":{}}],"day":"Tuesday","room":"South, Esplanade, Room 159","starts":"2025-06-10T18:30:00","ends":"2025-06-10T19:10:00","starts_pst":"2025-06-10T11:30:00","ends_pst":"2025-06-10T12:10:00","start_time":"6:30 pm","end_time":"7:10 pm","pst_start_time":"11:30 am","pst_end_time":"12:10 pm","duration":"40","path":"\/session\/genai-powered-shopping-assistant-prada-e-commerce-search-bar","alias":"\/data-ai-summit-2025\/session\/genai-powered-shopping-assistant-prada-e-commerce-search-bar","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534381+00:00"}
{"id":"D25L2683","title":"Generating Laughter: Testing and Evaluating the Success of LLMs for Comedy","description":"<p>Nondeterministic AI models, like large language models (LLMs), offer immense creative potential but require new approaches to testing and scalability. Drawing from her experience running New York Times-featured Generative AI comedy shows, Erin uncovers how traditional benchmarks may fall short and how embracing unpredictability can lead to innovative, laugh-inducing results.<\/p><p> <\/p><p>This talk will explore methods like multi-tiered feedback loops, chaos testing and exploratory user testing, where AI outputs are evaluated not by rigid accuracy standards but by their adaptability and resonance across different contexts — from comedy generation to functional applications. Erin will emphasize the importance of establishing a root source of truth — a reliable dataset or core principle — to manage consistency while embracing creativity.<\/p><p> <\/p><p>Whether you’re looking to generate a few laughs of your own or explore creative uses of Generative AI, this talk will inspire and delight enthusiasts of all levels.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Lightning Talk","industry":["Education, Media and Entertainment"],"category":["AI\/BI, Databricks SQL, PyTorch"],"areas_of_interest":["Generative AI (LLMs), Open Source, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Erin Staples","company":"Galileo","job_title":"Sr. Developer Experience Engineer","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/generating-laughter-testing-and-evaluating-success-llms-comedy","alias":"\/data-ai-summit-2025\/session\/generating-laughter-testing-and-evaluating-success-llms-comedy","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534384+00:00"}
{"id":"D25L2726","title":"Generating Zero-Shot Hard-Case Hallucinations: A Synthetic and Open Data Approach","description":"<p>We present a novel framework for designing and inducing controlled hallucinations in long-form content generation by LLMs across diverse domains. The purpose is to create fully-synthetic benchmarks and mine hard cases for iterative refinement of zero-shot hallucination detectors. We will first demonstrate how Gretel Navigator can be used to design realistic, high-quality long-context datasets across various domains. Second, we will describe our reasoning-based approach to hard-case mining. Specifically, our methodology relies on chain-of-thought-based generation of both faithful and deceptive question-answer pairs based upon long-context samples. Subsequently, a consensus labeling and detector framework is employed to filter synthetic examples to zero-shot hard cases. The result of this process is a fully-automated system, operating under open data licenses such as Apache-2.0, for the generation of hallucinations at the edge-of-capabilities for a target LLM to detect.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Lightning Talk","industry":["Enterprise Technology"],"category":["AI\/BI, Llama, PyTorch"],"areas_of_interest":["AI Agents, Generative AI (LLMs), Machine Learning, Open Source"],"delivery":["In Person"],"speakers":[{"name":"Eric Tramel","company":"Nvidia","job_title":"Principal Research Scientist","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/generating-zero-shot-hard-case-hallucinations-synthetic-and-open-data","alias":"\/data-ai-summit-2025\/session\/generating-zero-shot-hard-case-hallucinations-synthetic-and-open-data","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534387+00:00"}
{"id":"D25L2371","title":"Generative AI Merchant Matching","description":"<p>Our project demonstrates building enterprise AI systems cost-effectively, focusing on matching merchant descriptors to known businesses. Using fine-tuned LLMs and advanced search, we created a solution rivaling alternatives at minimal cost.<\/p><p> <\/p><p>The system works in three steps: A fine-tuned Llama 3 8B model parses merchant descriptors into standardized components. A hybrid search system uses these components to find candidate matches in our database. A Llama 3 70B model then evaluates top candidates, with an AI judge reviewing results for hallucination. We achieved a 400% latency improvement while maintaining accuracy and keeping costs low and each fine-tuning round cost hundreds of dollars. Through careful optimization and simple architecture for a balance between cost, speed and accuracy, we show that small teams with modest budgets can tackle complex problems effectively using this technology. We share key insights on prompt engineering, fine-tuning and cost and latency management.<\/p>","track":"Artificial Intelligence","level":"Advanced","type":"Lightning Talk","industry":["Financial Services"],"category":["Apache Spark, Llama, Mosaic AI"],"areas_of_interest":["Data Intelligence, Data Science, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Tomáš Drietomský","company":"Mastercard","job_title":"Senior Data Scientist","bio":"Tomáš is a Senior Data Scientist at Mastercard, leveraging an extensive background in finance and AI to tackle complex data-quality challenges and drive innovation. Specializing in rapid prototyping, he architects end-to-end, AI-powered solutions from concept through production. Highlights of his work include: a next-generation merchant sales forecasting framework employing ensemble and hierarchical modeling; a generative AI merchant enrichment engine (the subject of his talk at this summit); and a zip-code–level analytics tool empowering users to make data-driven decisions.<br \/>\n<br \/>\nWith educational background in Computer Science and Data Science, he leverages technical expertise and creative problem-solving to deliver impactful solutions.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/image0_1745846737320001H9kD.jpg?h=81b43544&itok=kdbs2qa6","alt":"Tomáš Drietomský"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/generative-ai-merchant-matching","alias":"\/data-ai-summit-2025\/session\/generative-ai-merchant-matching","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534391+00:00"}
{"id":"D25B3293DBX","title":"High-Throughput ML: Mastering Efficient Model Serving at Enterprise Scale","description":"<p>Ever wondered how industry leaders handle thousands of ML predictions per second? This session reveals the architecture behind high-performance model serving systems on Databricks. We'll explore how to build inference pipelines that efficiently scale to handle massive request volumes while maintaining low latency. You'll learn how to leverage Feature Store for consistent, low-latency feature lookups and implement auto-scaling strategies that optimize both performance and cost.<\/p><p> <\/p><p>Key takeaways:<\/p><ul>\t<li>Determining optimal compute capacity using the QPS × model execution time formula<\/li>\t<li>Configuring Feature Store for high-throughput, low-latency feature retrieval<\/li>\t<li>Managing cold starts and scaling strategies for latency-sensitive applications<\/li>\t<li>Implementing monitoring systems that provide visibility into inference performance<\/li><\/ul><p> <\/p><p>Whether you're serving recommender systems or real-time fraud detection models, you'll gain practical strategies for building enterprise-grade ML serving systems.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/high-throughput-ml-mastering-efficient-model-serving-enterprise-scale","alias":"\/data-ai-summit-2025\/session\/high-throughput-ml-mastering-efficient-model-serving-enterprise-scale","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534440+00:00"}
{"id":"D25B2701","title":"Improve AI Training With the First Synthetic Personas Dataset Aligned to Real-World Distributions","description":"<p>A big challenge in LLM development and synthetic data generation is ensuring data quality and diversity. While data incorporating varied perspectives and reasoning traces consistently improves model performance, procuring such data remains impossible for most enterprises. Human-annotated data struggles to scale, while purely LLM-based generation often suffers from distribution clipping and low entropy. In a novel compound AI approach, we combine LLMs with probabilistic graphical models and other tools to generate synthetic personas grounded in real demographic statistics. The approach allows us to address major limitations in bias, licensing and persona skew of existing methods. We release the first open source dataset aligned with real-world distributions and show how enterprises can leverage it with its Gretel Navigator extensions to bring diversity and quality to model training on the Databricks Platform, all while addressing model collapse and data provenance concerns head-on.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology, Health and Life Sciences, Financial Services"],"category":["Apache Spark, AI\/BI, Llama"],"areas_of_interest":["AI Agents, Generative AI (LLMs), Open Source"],"delivery":["In Person"],"speakers":[{"name":"Yev Meyer","company":"NVIDIA","job_title":"Principal Research Scientist","bio":"Yev Meyer is Principal Research Scientist at NVIDIA. Prior to that, Yev was Chief Scientist at Gretel, the synthetic data platform for developers and led AI\/ML teams at a number of Enterprise SaaS startups, including Guru, Curalate and RJMetrics (precursor to dbt Labs, Stitch). He holds a PhD in Computational Neuroscience from Columbia University, where he developed models of dendritic processing and multisensory encoding in spiking neural circuits. He also performed brain surgery on fruit flies to validate these models on (non-artificial) neural networks of the olfactory system.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/yev_meyer_1745509238839001D1G3.png?h=f2d33511&itok=zeQlmMAP","alt":"Yev Meyer"}},{"name":"Dane Corneil","company":"Gretel.ai","job_title":"Staff Applied Scientist","bio":"Dane is a Staff Applied Scientist at Gretel where he is researching methods to generate high-quality synthetic data at scale. His background is in computational neuroscience and reinforcement learning.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/dane_2_1738630973974001EFBo.png?h=a7ffc51c&itok=X7u_iize","alt":"Dane Corneil"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/improve-ai-training-first-synthetic-personas-dataset-aligned-real-world","alias":"\/data-ai-summit-2025\/session\/improve-ai-training-first-synthetic-personas-dataset-aligned-real-world","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534557+00:00"}
{"id":"D25S3210","title":"Industry Forum Networking Reception","description":"Coming Soon","track":"Artificial Intelligence","level":"Beginner","type":"Special Interest","industry":["Education"],"category":["DLT"],"areas_of_interest":["AI Agents"],"delivery":["In Person"],"speakers":[],"day":"Tuesday","room":"West, Level 2, Foyer","starts":"2025-06-11T00:00:00","ends":"2025-06-11T01:00:00","starts_pst":"2025-06-10T17:00:00","ends_pst":"2025-06-10T18:00:00","start_time":"12:00 am","end_time":"1:00 am","pst_start_time":"5:00 pm","pst_end_time":"6:00 pm","duration":"60","path":"\/session\/industry-forum-networking-reception","alias":"\/data-ai-summit-2025\/session\/industry-forum-networking-reception","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534569+00:00"}
{"id":"D25B3289DBX","title":"Intelligent Document Processing: Building AI, BI, and Analytics Systems on Unstructured Data","description":"<p>Most enterprise data is trapped in unstructured formats — documents, PDFs, scanned images and tables — making it difficult to access, analyze and use. This session shows how to unlock that hidden value by building intelligent document processing workflows on the Databricks Data Intelligence Platform. You’ll learn how to ingest unstructured content using Lakeflow Connect, extract structured data with AI Parse — even from complex tables and scanned documents — and apply analytics or AI to this newly structured data.<\/p><p> <\/p><p>What you’ll learn:<\/p><ul>\t<li>How to build scalable pipelines that transform unstructured documents into structured tables<\/li>\t<li>Techniques for automating document workflows with Databricks tools<\/li>\t<li>Strategies for maintaining quality and governance with Unity Catalog<\/li>\t<li>Real-world examples of AI applications built with intelligent document processing<\/li><\/ul>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Databricks SQL, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Adam Gurary","company":"Databricks","job_title":"Product Manager","bio":null,"image":{}},{"name":"Jason Ping (Product)","company":"Databricks","job_title":null,"bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/intelligent-document-processing-building-ai-bi-and-analytics-systems","alias":"\/data-ai-summit-2025\/session\/intelligent-document-processing-building-ai-bi-and-analytics-systems","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534589+00:00"}
{"id":"D25B3284DBX","title":"Intro to the Mosaic AI Platform: Building Data Intelligence Into Your AI Solutions","description":"<p>Take a front-row seat for a comprehensive, high-level introduction to Mosaic AI through the lens of Data Intelligence. In this session, we’ll spotlight the Databricks Platform’s newest features and announcements, showcase how Mosaic AI transforms raw enterprise data into actionable insights and share real-world examples of success. Whether you’re beginning your AI journey or scaling your existing efforts, this talk will provide you with the foundational knowledge and inspiration to fully leverage Mosaic AI for Data Intelligence and next-generation GenAI solutions.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Craig Wiley","company":"Databricks","job_title":"AI\/ML Product Mgmt","bio":"Craig leads Product for Artificial Intelligence at Databricks. He joined three years ago from Google Cloud where he led their Cloud AI Products and built Vertex AI. Previous to Google, Craig spent 9 years at Amazon. Most recently, as the founding General Manager of Amazon SageMaker, AWS’ machine learning platform. Previous to AWS, he led pricing and analytics for Fulfillment By Amazon. Craig has a deep belief in democratizing the power of data. He pushes to improve the tooling for experienced users while also seeking to simplify it for the growing set of less experienced users. Outside of work he enjoys spending time with his family, and spending time on his bike.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/linkedinpic_1745610410485001pKXW.jpg?h=fbf7a813&itok=4P8nlz2G","alt":"Craig Wiley"}},{"name":"Amber Roberts","company":"Databricks","job_title":"Staff Technical Marketing Manager","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/intro-mosaic-ai-platform-building-data-intelligence-your-ai-solutions","alias":"\/data-ai-summit-2025\/session\/intro-mosaic-ai-platform-building-data-intelligence-your-ai-solutions","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534593+00:00"}
{"id":"D25L1643","title":"Kill Bill-ing? Revenge is a Dish Best Served Optimized with GenAI","description":"<p>In an era where cloud costs can spiral out of control, Sportsbet achieved a remarkable 49% reduction in Total Cost of Ownership (TCO) through an innovative AI-powered solution called 'Kill Bill.' This presentation reveals how we transformed Databricks' consumption-based pricing model from a challenge into a strategic advantage through an intelligent automation and optimization.<\/p><ul>\t<li>Understand how to use GenAI to reduce Databricks TCO<\/li>\t<li>Leverage generative AI within Databricks solutions enables automated analysis of cluster logs, resource consumption, configurations, and codebases to provide Spark optimization suggestions<\/li>\t<li>Create AI agentic workflows by integrating Databricks' AI tools and Databricks Data Engineering tools<\/li>\t<li>Review a case study demonstrating how Total Cost of Ownership was reduced in practice.<\/li><\/ul><p>Attendees will leave with a clear understanding of how to implement AI within Databricks solutions to address similar cost challenges in their environments.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Lightning Talk","industry":["Enterprise Technology, Media and Entertainment, Professional Services"],"category":["Databricks Workflows, Mosaic AI, Databricks Apps"],"areas_of_interest":["AI Agents, Generative AI (LLMs), ML\/LLMOps, Gaming"],"delivery":["In Person"],"speakers":[{"name":"Ryan Nguyen","company":"Sportsbet","job_title":null,"bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/kill-bill-ing-revenge-dish-best-served-optimized-genai","alias":"\/data-ai-summit-2025\/session\/kill-bill-ing-revenge-dish-best-served-optimized-genai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534635+00:00"}
{"id":"D25B2467","title":"Lakehouse to Powerhouse: Reckitt's Enterprise AI Transformation Story","description":"<p>In this presentation, we showcase Reckitt’s journey to develop and implement a state-of-the-art Gen AI platform, designed to transform enterprise operations starting with the marketing function. We will explore the unique technical challenges encountered and the innovative architectural solutions employed to overcome them. Attendees will gain insights into how cutting-edge Gen AI technologies were integrated to meet Reckitt’s specific needs. This session will not only highlight the transformative impacts on Reckitt’s marketing operations but also serve as a blueprint for AI-driven innovation in the Consumer Goods sector, demonstrating a successful model of partnership in technology and business transformation.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Professional Services, Retail and CPG - Food"],"category":["AI\/BI, Unity Catalog, Databricks Apps"],"areas_of_interest":["Data Applications, Generative AI (LLMs), Thought Leadership, Marketing"],"delivery":["In Person"],"speakers":[{"name":"Tewfik Bedreddine","company":"Reckitt","job_title":"VP - Global Data & Analytics @ Reckitt","bio":"Tewfik is Global Lead Data & Analytics at Reckitt. His background spans across several sectors including travel, retail, technology and consumer product always with a focus on digital and data transformation at scale. He has deep experience in setting the conditions for fast and secure customer proposition development, whether those enablers are to do with culture, ways of working, people & skills, business process or technology. ","image":{}},{"name":"Bastien Parizot","company":"Reckitt","job_title":"SVP Tech & Digital, CIO\/CDO","bio":"With over 15 years of experience in various industries, I am a business and technology leader who puts data and digital at the core and consumer at the heart. I lead the global tech and digital function for Reckitt, a leading consumer health and hygiene company, where I focus on delivering innovative solutions and driving business transformation across marketing, sales and data. My mission is to help brands connect with consumers and customers, enabled by digital and data. I have a proven track record of leading marketing operations, digital, CRM, data, analytics, AI, and privacy for global brands at enterprise level such as Reckitt, Renault, Nestlé, and Salomon. I have also successfully built and managed strategic partnerships with media, agencies, and tech platforms. I am passionate about learning and staying ahead of the curve, and I have earned multiple certifications in digital transformation, industry 4.0, and RPA, and AI\/GenAI.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/lakehouse-powerhouse-reckitts-enterprise-ai-transformation-story","alias":"\/data-ai-summit-2025\/session\/lakehouse-powerhouse-reckitts-enterprise-ai-transformation-story","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534664+00:00"}
{"id":"D25B2644","title":"LanceDB: A Complete Search and Analytical Store for Serving Production-scale AI Applications","description":"<p>If you're building AI applications, chances are you're solving a retrieval problem somewhere along the way. This is why vector databases are popular today. But if we zoom out from just vector search, serving AI applications also requires handling KV workloads like a traditional feature store, as well as analytical workloads to explore and visualize data. This means that building an AI application often requires multiple data stores, which means multiple data copies, manual syncing, and extra infrastructure expenses.<\/p><p> <\/p><p>LanceDB is the first and only system that supports all of these workloads in one system. Powered by Lance columnar format, LanceDB completely breaks open the impossible triangle of performance, scalability, and cost for AI serving. Serving AI applications is different from previous waves of technology, and a new paradigm demands new tools.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology, Health and Life Sciences, Financial Services"],"category":["Apache Spark, Mosaic AI, PyTorch"],"areas_of_interest":["AI Agents, Generative AI (LLMs), ML\/LLMOps, Open Source"],"delivery":["In Person"],"speakers":[{"name":"Zero Qu","company":"Databricks","job_title":"Software Engineer","bio":null,"image":{}},{"name":"Chang She","company":"LanceDB","job_title":"CEO \/ Co-founder","bio":"Chang She is the CEO and cofounder of LanceDB, the developer-friendly, open-source database for multi-modal AI. A serial entrepreneur, Chang has been building DS\/ML tooling for nearly two decades and is one of the original contributors to the pandas library. Prior to founding LanceDB, Chang was VP of Engineering at TubiTV, where he focused on personalized recommendations and ML experimentation.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Chang-CRV-Chloe-Jackman-Photography-2023-2_1744315844350001z7wS.jpg?h=4a54dbf0&itok=iwjBS0sZ","alt":"Chang She"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/lancedb-complete-search-and-analytical-store-serving-production-scale","alias":"\/data-ai-summit-2025\/session\/lancedb-complete-search-and-analytical-store-serving-production-scale","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534668+00:00"}
{"id":"D25L3355","title":"Learn How the Virtue Foundation Saves Lives by Optimizing Health Care Delivery Across the Globe","description":"<p>The Virtue Foundation uses cutting-edge techniques in AI to optimize global health care delivery to save lives. With Unity Catalog as a foundation, they are using advanced Gen AI with model serving, vector search and MLflow to radically change how they map volunteer health resources with the right locations and facilities.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Lightning Talk","industry":["Health and Life Sciences"],"category":["Unity Catalog"],"areas_of_interest":["Catalogs, Data Ingestion, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Joan LaRovere","company":"Virtue Foundation","job_title":"Co-Founder and President","bio":"Dr. Joan LaRovere is Co-Founder and President of Virtue Foundation, an NGO with Special Consultative Status to the United Nations focused on a data-driven, evidence-based approach to development. The foundation’s mission is to deliver quality healthcare to those in need while working to create an efficient marketplace for global healthcare delivery through machine learning and AI. Dr. LaRovere has led collaborations with companies such as Apple, Carto, DataRobot and Databricks, among others, and governments globally. <br \/>\n<br \/>\nDr. LaRovere is also a Senior Attending in Cardiovascular Critical Care and Associate Chief Medical Officer for Transformation at Boston Children’s Hospital, and Assistant Professor of Pediatrics at Harvard Medical School. ","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/learn-how-virtue-foundation-saves-lives-optimizing-health-care-delivery","alias":"\/data-ai-summit-2025\/session\/learn-how-virtue-foundation-saves-lives-optimizing-health-care-delivery","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534675+00:00"}
{"id":"D25L1105","title":"Learn to Program Not Write Prompts with DSPy","description":"<p>Writing prompts for our GenAI applications is long, tedious, and unmaintainable. A proper software development lifecycle requires proper testing and maintenance, something incredibly difficult to do on a block of text. Our current prompt engineering best practices have largely been manual trial and error, testing which of our prompts work well in certain situations. This process worsens as our prompts become more complex, adding multiple tasks and functionality within one long singular prompt.<\/p><p> <\/p><p>Enter DSPy, your PROGRAMATIC way of building GenAI Applications. Learn how DSPy allows you to modularize your prompt into modules and enforce typing through signatures. Then, utilize state of the art algorithms to optimize the prompts and weights against your evaluation datasets, just like machine learning! We will compare DSPy to a restaurant to help illustrate and demo DSPy’s capabilities. It's time to start programming, rather than prompting, again!<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Lightning Talk","industry":["Enterprise Technology, Professional Services"],"category":["MLFlow, DSPy, Mosaic AI"],"areas_of_interest":["AI Agents, Generative AI (LLMs), ML\/LLMOps"],"delivery":["In Person"],"speakers":[{"name":"Austin Choi","company":"Databricks","job_title":"Delivery Solutions Architect","bio":"Austin is a Delivery Solutions Architect (DSA) at Databricks who specializes in Data Science and GenAI implementation. His background in Data Science at his past roles at Deloitte, IBM and Cisco have propelled him forward in the GenAI space. As a DSA, he has helped numerous customers design creative GenAI solutions on Databricks by the platform with the latest open source technology. His passion in educating and discovery drives him to help people, no matter the problem. <br \/>\n<br \/>\nIn his spare time, he enjoys building PCs, swimming and playing with his two cats. As an extrovert, he organizes and builds young adult Catholic communities in the Los Angeles area while giving back where he can to the broader community. ","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/headshot_1744156620988001OqTB.jpg?h=fdae6e20&itok=74yk7odK","alt":"Austin Choi"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/learn-program-not-write-prompts-dspy","alias":"\/data-ai-summit-2025\/session\/learn-program-not-write-prompts-dspy","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534678+00:00"}
{"id":"D25B1380","title":"Let the LLM Write the Prompts: An Intro to DSPy in Compound AI Pipelines","description":"<p>Large Language Models (LLMs) excel at understanding messy, real-world data, but integrating them into production systems remains challenging. Prompts can be unruly to write, vary by model and can be difficult to manage in the large context of a pipeline. In this session, we'll demonstrate incorporating LLMs into a geospatial conflation pipeline, using DSPy. We'll discuss how DSPy works under the covers and highlight the benefits it provides pipeline creators and managers.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Breakout","industry":["Enterprise Technology, Public Sector"],"category":["AI\/BI, DSPy, Llama"],"areas_of_interest":["Data Ingestion, Generative AI (LLMs), Open Source"],"delivery":["In Person"],"speakers":[{"name":"Drew Breunig","company":"Overture Maps Foundation","job_title":"Data Science Leader & Strategist","bio":"Drew is focused on using data to better understand the world and ourselves. Drew ran strategy, data science, and major client projects at PlaceIQ (acquired by Precisely) – a pioneer in mobile location intelligence –and strategy at Precisely. Currently, Drew works with the Overture Maps Foundation – an open data project founded by Amazon, Meta, Microsoft, and TomTom – where he is focused on their global ID effort and ecosystem. <br \/>\n<br \/>\nAs a consultant and advisor, Drew guides organizations through practical AI implementation and assists startups in refining their market positioning and strategic direction.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/drew_22_lite_1743804537666001nph9.jpg?h=f0574bed&itok=irB4A8i3","alt":"Drew Breunig"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/let-llm-write-prompts-intro-dspy-compound-ai-pipelines","alias":"\/data-ai-summit-2025\/session\/let-llm-write-prompts-intro-dspy-compound-ai-pipelines","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534689+00:00"}
{"id":"D25B1277","title":"LLMOps at Intermountain Health: A Case Study on AI Inventory Agents","description":"<p>In this session, we will delve into the creation of an infrastructure, CI\/CD processes and monitoring systems that facilitate the responsible and efficient deployment of Large Language Models (LLMs) at Intermountain Healthcare. Using the \"AI Inventory Agents\" project as a case study, we will showcase how an LLM Agent can assist in effort and impact estimates, as well as provide insights into various AI products, both custom-built and third-party hosted. This includes their responsible AI certification status, development status and monitoring status (lights on, performance, drift, etc.). Attendees will learn how to build and customize their own LLMOps infrastructure to ensure seamless deployment and monitoring of LLMs, adhering to responsible AI practices.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Health and Life Sciences"],"category":["MLFlow, Databricks Workflows, Unity Catalog"],"areas_of_interest":["AI Agents, Generative AI (LLMs), ML\/LLMOps"],"delivery":["In Person"],"speakers":[{"name":"Mark Nielsen","company":"Intermountain Healthcare","job_title":"Lead MLOps Engineer","bio":"Mark Nielsen is a lead MLOps Engineer at Intermountain Health and helps lead in the governance, deployment, and monitoring of ML models to ensure better implementation of these models into patient and caregiver workflows. He’s passionate about machine learning, automation, and programming and has experience in both finance and healthcare sectors.  He is a proud alumnus of both Utah State and Brigham Young Universities where he obtained degrees in math and statistics.  In his spare time, he enjoys spending time with his family, tinkering with various robotics projects, or designing something to print on his 3d printer.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Mark_Nielsen_1744909092242001Oiyw.jpg?h=9cedd88d&itok=su3V23He","alt":"Mark Nielsen"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/llmops-intermountain-health-case-study-ai-inventory-agents","alias":"\/data-ai-summit-2025\/session\/llmops-intermountain-health-case-study-ai-inventory-agents","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534709+00:00"}
{"id":"D25B3097","title":"Low-Emission Oil & Gas: Engineering the Balance Between Clean and Reliable","description":"Join three energy industry leaders as they showcase groundbreaking applications of AI and data solutions in modern oil and gas operations. NOV demonstrates how their Generative AI pipeline revolutionized drilling mud report processing, automating the analysis of 300 reports daily with near-perfect accuracy and real-time analytics capabilities. ExxonMobil reveals their machine learning breakthrough in gas lift optimization, achieving over 5% production uplift across 200+ wells through innovative time series forecasting and Bayesian optimization. BP completes the session by sharing how Unity Catalog has transformed their enterprise-wide data strategy, breaking down silos while maintaining robust governance and security. Together, these case studies illustrate how AI and advanced analytics are enabling cleaner, more efficient energy operations while maintaining the reliability demanded by today's market.","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Energy and Utilities"],"category":["AI\/BI, Unity Catalog"],"areas_of_interest":["Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Jay Yoon","company":"NOV","job_title":"Manager of Data Science and Applied AI","bio":"Jay Yoon, Ph.D., is an accomplished AI leader and researcher currently serving as Manager of Data Science and Applied AI at NOV, where he leads a team dedicated to industrial AI innovation and generative AI applications. With a career spanning both industry and academia, Dr. Yoon's work integrates advanced machine learning, predictive maintenance, and digital transformation across the energy sector. His recent focus includes developing and deploying GenAI solutions for corporate use cases, such as multi-agent LLM systems and enterprise-scale document intelligence. Dr. Yoon holds a Ph.D. in Industrial Engineering from the University of Illinois at Chicago and is currently pursuing an MBA at Rice University.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/portrait_1744409289468001yjvP.jpg?h=db7aa3e1&itok=Lqa4OMpR","alt":"Jay Yoon"}},{"name":"Krishanu Roy","company":"bp","job_title":null,"bio":null,"image":{}},{"name":"Ali Marzban","company":"NOV","job_title":"Director of Data Science and Analytics","bio":"Dr. Ali Marzban is a leader in AI and data-driven innovation for the energy sector. At NOV, he drives the development of intelligent systems using digital twins, machine learning, and Generative AI to optimize equipment health, predictive maintenance, and operational efficiency. His work focuses on turning complex data into actionable insights, enabling smarter, faster decision-making across global operations. With a strong track record in digital transformation, Ali bridges engineering and AI to deliver scalable, high-impact solutions.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Pic_1744414591494001C4sD.JPG?h=815ed4fb&itok=DLxVvOTz","alt":"Ali Marzban"}},{"name":"Srinivas Chandolu","company":"BP","job_title":"Technical lead","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/low-emission-oil-gas-engineering-balance-between-clean-and-reliable","alias":"\/data-ai-summit-2025\/session\/low-emission-oil-gas-engineering-balance-between-clean-and-reliable","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534714+00:00"}
{"id":"D25B2664","title":"Machine Learning Aimbot Detection in Call of Duty","description":"<p>As online gaming grows, maintaining fair play is increasingly difficult. Call of Duty, a highly competitive first-person shooter, faces a surge in aimbot usage—cheats that enable near-perfect accuracy, undermining ranked play. Traditional detection methods are ineffective against advanced cheats that mimic human behavior.<\/p><p> <\/p><p>Machine learning presents a scalable and adaptive solution. We developed a data pipeline that collects features such as angle velocity, acceleration, etc. to train a deep neural network and deployed it. We are processing 30 million rows of data per hour for this detection on Databricks Platform.<\/p><p> <\/p><p>As cheat developers evolve, so must detection techniques. This session will explore our methodologies, challenges and future directions, demonstrating how machine learning is transforming anti-cheat strategies and preserving competitive integrity in online gaming and how Databricks enabling us to do so. <\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Breakout","industry":["Media and Entertainment"],"category":["Apache Spark, Delta Lake, Databricks SQL"],"areas_of_interest":["Machine Learning, Security & Compliance, Gaming"],"delivery":["In Person"],"speakers":[{"name":"Mathew Varghese","company":"Activision","job_title":"Machine Learning Research Engineer","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/machine-learning-aimbot-detection-call-duty","alias":"\/data-ai-summit-2025\/session\/machine-learning-aimbot-detection-call-duty","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534717+00:00"}
{"id":"D25B1094","title":"Managing Data and AI Security Risks With DASF 2.0 — and a Customer Story","description":"<p>The Databricks Security team led a broad working group that significantly evolved the Databricks AI Security Framework (DASF) to its 2.0 version since its first release by closely collaborating with the top cyber security researchers at industry organizations such as OWASP, Gartner, NIST, HITRUST, FAIR Institute and several Fortune 100 companies to address the evolving risks and associated controls of AI systems in enterprises. Join us to to learn how The CLEVER GenAI pipeline, an AI-driven innovation in healthcare, processes over 1.5 million clinical notes daily to classify social determinants impacting veteran care while adhering to robust security measures like NIST 800-53 controls and by leveraging Databricks AI Security Framework. We will discuss robust AI security guidelines to help data and AI teams understand how to deploy their AI applications securely. This session will give a security framework for security teams, AI practitioners, data engineers and governance teams.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Health and Life Sciences, Public Sector, Financial Services"],"category":["Llama, Mosaic AI, Unity Catalog"],"areas_of_interest":["Cybersecurity, Data Science, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Arun Pamulapati","company":"Databricks","job_title":"Principal Staff Security Field Engineer","bio":"Arun has been a security engineer with Databricks for 7 years and has 25+ years of experience in building data products, including over a decade of experience in building data and AI products. Arun led and co-created the Security Analysis Tool (SAT), is a co-author of Databricks AI Security Framework (DASF) and is a core member of the Security Field Engineering team at Databricks. He has worked with customers in both the private and regulated industries on security. Arun has Bachelor's in Com Sci and holds Cloud security, Bigdata, and AI\/ML industry certifications.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Arun_Pamulapati_headshot_1744219267912001CREa.png?h=fbf7a813&itok=CUW2OJ9n","alt":"Arun Pamulapati"}},{"name":"Joseph Raetano","company":"US AI","job_title":"Director of Artificial Intelligence","bio":"Joseph Raetano is an AI Researcher and Architect with expertise in artificial intelligence and cybersecurity compliance. He led the mapping of NIST SP 800-53 Rev 5 controls to Databricks AI Security Framework (DASF) 2.0 and implemented these measures in the VA's first generative AI pipeline, CLEVER GenAI, analyzing over 1.5 million clinical notes daily. Currently, Joseph serves as Director of AI at US AI, assisting various agencies in enabling secure, ethical AI capabilities.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Joseph_Raetano_1745633358400001p3jc.png?h=c2329f29&itok=3ulgLHno","alt":"Joseph Raetano"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/managing-data-and-ai-security-risks-dasf-20-and-customer-story","alias":"\/data-ai-summit-2025\/session\/managing-data-and-ai-security-risks-dasf-20-and-customer-story","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534738+00:00"}
{"id":"D25B2527","title":"MLOps That Ships: Accelerating AI Deployment at Vizient with Databricks\n\n","description":"<p>Deploying AI models efficiently and consistently is a challenge many organizations face. This session will explore how Vizient built a standardized MLOps stack using Databricks, Azure DevOps and GitHub Actions to streamline model development, deployment and monitoring.<\/p><p> <\/p><p>Attendees will gain insights into how Databricks Asset Bundles were leveraged to create reproducible, scalable pipelines and how Infrastructure-as-Code principles accelerated onboarding for new AI projects.The talk will cover:<\/p><ul>\t<li>End-to-end MLOps stack setup, ensuring efficiency and governance<\/li>\t<li>CI\/CD pipeline architecture, automating model versioning and deployment<\/li>\t<li>Standardizing AI model repositories, reducing development and deployment time<\/li>\t<li>Lessons learned, including challenges and best practices<\/li><\/ul><p> <\/p><p>By the end of this session, participants will have a roadmap for implementing a scalable, reusable MLOps framework that enhances operational efficiency across AI initiatives.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Energy and Utilities, Health and Life Sciences, Financial Services"],"category":["MLFlow, AI\/BI, Databricks Workflows"],"areas_of_interest":["AI Agents, Generative AI (LLMs), ML\/LLMOps"],"delivery":["In Person"],"speakers":[{"name":"Ram Radhakrishnan","company":"Vizient Inc.","job_title":"Director- Technology Delivery, Data & AI","bio":null,"image":{}},{"name":"Adam Hasham","company":"Vizient","job_title":"Lead Machine Learning Engineer","bio":"Adam Hasham is a Machine Learning Engineer at Vizient, where he works on the AI Platform team, helping to deploy advanced AI models and build a scalable MLOps framework to streamline model development and deployment.<br \/>\n<br \/>\nHe has experience working across AI startups, including TripleBlind, where he focused on privacy-preserving AI, and Imubit, where he developed and deployed AI solutions to optimize real-time manufacturing processes.<br \/>\n<br \/>\nAdam holds a Master’s in Computer Science from Georgia Tech, specializing in machine learning, and is passionate about creating practical, scalable AI solutions that drive meaningful impact.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/mlops-ships-accelerating-ai-deployment-vizient-databricks","alias":"\/data-ai-summit-2025\/session\/mlops-ships-accelerating-ai-deployment-vizient-databricks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534796+00:00"}
{"id":"D25L3402","title":"MLOps With Databricks","description":"Adopting MLOps is getting increasingly important with the rise of AI. A lot of different features are required to do MLOps in large organizations. In the past, you had to implement these features yourself. Luckily, the MLOps space is getting more mature, and end-to-end platforms like Databricks provide most of the features. In this talk, I will walk through the MLOps components and how you can simplify your processes using Databricks.","track":"Artificial Intelligence","level":"Intermediate","type":"Lightning Talk","industry":["Enterprise Technology"],"category":["MLFlow, Databricks Workflows, DLT"],"areas_of_interest":["Machine Learning"],"delivery":["In Person"],"speakers":[{"name":"Maria Vechtomova","company":"Marvelous MLOps","job_title":"MLOps Tech Lead","bio":"Maria is MLOps Tech lead with 11+ years of experience in Data &AI, 8+ years of experience with MLOps (before it became a thing!). Maria has led MLOps adoption in large corporate organizations and co-founded Marvelous MLOps to educate machine learning professionals on best MLOps practices.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/mlops-databricks","alias":"\/data-ai-summit-2025\/session\/mlops-databricks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534800+00:00"}
{"id":"D25B3305DBX","title":"Monitor AI Agent Deployments With Mosaic Agent Monitoring","description":"<p>How do you know if your AI agents are really delivering value in production? This session dives into Databricks' Mosaic Agent Monitoring solution, your window into AI agent performance and quality. We'll show you how the system automatically tracks everything from basic operational metrics to sophisticated quality indicators, giving you real-time visibility into how your agents are performing in the wild.<\/p><p> <\/p><p>Key takeaways:<\/p><ul>\t<li>Monitoring critical metrics like request volume, latency, errors and cost efficiency<\/li>\t<li>Implementing AI judges for continuous quality evaluation without ground truth labels<\/li>\t<li>Setting up effective dashboards for analysis across time periods and user segments<\/li>\t<li>Creating feedback loops that drive continuous agent improvement\t <\/li><\/ul><p>Transform your AI operations from reactive firefighting to proactive excellence, ensuring your agents consistently deliver value in production.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Elise Gonzales","company":"Databricks","job_title":"Staff Product Manager","bio":"Elise is a Product Manager on the Mosaic AI team at Databricks focused on building agents. Before Databricks, she ran the product team at Amperity, a Customer Data Platform, as well as working on HoloLens at Microsoft and Alexa at Amazon. She got her undergraduate degree in Computer Science at Carnegie Mellon.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/headshot_1746061492464001ImyV.png?h=a7e6d17b&itok=LtNiVDzo","alt":"Elise Gonzales"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/monitor-ai-agent-deployments-mosaic-agent-monitoring","alias":"\/data-ai-summit-2025\/session\/monitor-ai-agent-deployments-mosaic-agent-monitoring","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534804+00:00"}
{"id":"D25B1464","title":"Moody's AI Screening Agent: Automating Compliance Decisions","description":"<p>The AI Screening Agent automates Level 1 (L1) screening process, essential for Know Your Customer (KYC) and compliance due diligence during customer onboarding. This system aims to minimize false positives, significantly reducing human review time and costs. Beyond typical Retrieval-Augmented Generation (RAG) applications like summarization and chat-with-your-data (CWYD), the AI Screening Agent employs a ReAct architecture with intelligent tools, enabling it to perform complex compliance decision-making with human-like accuracy and greater consistency.<\/p><p> <\/p><p>In this talk, I will explore the screening agent architecture, demonstrating its ability to meet evolving client policies. I will discuss evaluation and configuration management using MLflow LLM-as-judge and Unity Catalog, and discuss challenges, such as, data fidelity and customization. This session underscores the transformative potential of AI agents in compliance workflows, emphasizing their adaptability, accuracy, and consistency.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Public Sector, Financial Services"],"category":["MLFlow, Mosaic AI, Unity Catalog"],"areas_of_interest":["AI Agents, Data Science, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Nishant Gurunath","company":"Moody's","job_title":"Assc Dir - Machine Learning","bio":"Nishant is a data scientist and ML engineer with 5 years at Moody’s and a Master’s in Computer Engineering from Carnegie Mellon. He specializes in NLP, with experience in information extraction, fraud detection, and recommendation systems. His work spans traditional ML to advanced LLMs, with a focus on Transformer fine-tuning, RAG systems, and AI agents. He led the development of the AI Screening Agent, automating Level 1 KYC workflows with human-level accuracy. Nishant is skilled in Hugging Face, PyTorch, and Databricks, and regularly builds scalable, explainable ML systems on AWS. He is passionate about creating real-world AI solutions that deliver impact.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/IMG_3453_Original_1746117221595001Rov6.png?h=545c2c03&itok=COWe9jRE","alt":"Nishant Gurunath"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/moodys-ai-screening-agent-automating-compliance-decisions","alias":"\/data-ai-summit-2025\/session\/moodys-ai-screening-agent-automating-compliance-decisions","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534811+00:00"}
{"id":"D25L1215","title":"No Time for the Dad Bod: Automating Life with AI and Databricks","description":"<p>Life as a father, tech leader, and fitness enthusiast demands efficiency. To reclaim my time, I’ve built AI-driven solutions that automate everyday tasks—from research agents that prep for podcasts to multi-agent systems that plan meals—all powered by real-time data and automation.<\/p><p> <\/p><p>This session dives into the technical foundations of these solutions, focusing on event-driven agent design and scalable patterns for robust AI systems. You’ll discover how Databricks technologies like Delta Lake, for reliable and scalable data management, and DSPy, for streamlining the development of generative AI workflows, empower seamless decision-making and deliver actionable insights.<\/p><p> <\/p><p>Through detailed architecture diagrams and a live demo, I’ll showcase how to design systems that process data in motion to tackle complex, real-world problems. Whether you’re an engineer, architect, or data scientist, you’ll leave with practical strategies to integrate AI-driven automation into your workflows.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Lightning Talk","industry":["Education, Health and Life Sciences, Media and Entertainment"],"category":["Delta Lake, AI\/BI, DSPy"],"areas_of_interest":["AI Agents, Data Applications, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Sean Falconer","company":"Confluent","job_title":"AI Entrepreneur in Residence","bio":"Dr. Sean Falconer is Confluent’s AI Entrepreneur in Residence, driving AI strategy and thought leadership. Sean has built and launched products that have impacted millions. As the founder of Proven.com, he led engineering, product development, and go-to-market strategies, successfully guiding the company to acquisition. At Google, Sean worked on enhancing developer experience and advancing conversational AI technologies. <br \/>\n<br \/>\nHe holds a Postdoc in Bioinformatics at Stanford University, where he collaborated with the World Health Organization to modernize the International Classification of Diseases.<br \/>\n<br \/>\nHe has published extensively on topics ranging from AI to quantum computing, reflecting his diverse expertise and contributions to the field.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/sean-falconer-large_1744316955727001vrQO.png?h=1e66e246&itok=u6hDUtC6","alt":"Sean Falconer"}}],"day":"Wednesday","room":"Theater 5","starts":"2025-06-11T18:30:00","ends":"2025-06-11T18:50:00","starts_pst":"2025-06-11T11:30:00","ends_pst":"2025-06-11T11:50:00","start_time":"6:30 pm","end_time":"6:50 pm","pst_start_time":"11:30 am","pst_end_time":"11:50 am","duration":"20","path":"\/session\/no-time-dad-bod-automating-life-ai-and-databricks","alias":"\/data-ai-summit-2025\/session\/no-time-dad-bod-automating-life-ai-and-databricks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534824+00:00"}
{"id":"D25B1283","title":"One-Stop Machine Translation Solution in Game Domain From Real-Time UGC Content to In-Game Text","description":"<p>We present Level Infinite AI Translation, a translation engine developed by Tencent, tailored specifically for the gaming industry. The primary challenge in game machine translation (MT) lies in accurately interpreting the intricate context of game texts, effectively handling terminology and adapting to the highly diverse translation formats and stylistic requirements across different games. Traditional MT approaches cannot effectively address the aforementioned challenges due to their weak context representation ability and lack of common knowledge. Leveraging large language model and related technology, our engine is crafted to capture the subtleties of localized language expression while ensuring optimization for domain-specific terminology, jargon and required formats and styles. To date, the engine has been successfully implemented in 15 international projects, translating over one billion words across 23 languages, and has demonstrated cost savings exceeding 25% for partners.<\/p>","track":"Artificial Intelligence","level":"Advanced","type":"Breakout","industry":["Media and Entertainment"],"category":["AI\/BI, Llama"],"areas_of_interest":["AI Agents, Generative AI (LLMs), ML\/LLMOps, Gaming"],"delivery":["In Person"],"speakers":[{"name":"Hao li","company":"Tencent","job_title":null,"bio":null,"image":{}},{"name":"Wenqiang Liu","company":"Proxima Beta (Tencent)","job_title":"Lead Researcher","bio":"After completing his PhD in 2018, Liu Wenqiang joined Tencent, where he was responsible for constructing and applying knowledge graphs in the gaming field. He is currently the head of the NLP group at Tencent IEG Global Algorithm Center, primarily focusing on the algorithm development of multilingual natural language processing as well as the design and development of applications for Tencent's overseas games.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/WechatIMG35_1737352798192001QUHM.jpg?h=57024e64&itok=l2sRj_tV","alt":"Wenqiang Liu"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/one-stop-machine-translation-solution-game-domain-real-time-ugc-content","alias":"\/data-ai-summit-2025\/session\/one-stop-machine-translation-solution-game-domain-real-time-ugc-content","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534835+00:00"}
{"id":"D25B1998","title":"Optimize Cost and User Value Through Model Routing AI Agent","description":"<p>Each LLM has unique strengths and weaknesses, and there is no one-size-fits-all solution. Companies strive to balance cost reduction with maximizing the value of their use cases by considering various factors such as latency, multi-modality, API costs, user need, and prompt complexity. Model routing helps in optimizing performance and cost along with enhanced scalability and user satisfaction. <\/p><p> <\/p><p>Overview of cost-effective models training using AI gateway logs, user feedback, prompt, and model features to design an intelligent model-routing AI agent. Covers different strategies for model routing, deployment in Mosaic AI, re-training, and evaluation through A\/B testing and end-to-end Databricks workflows. Additionally, it will delve into the details of training data collection, feature engineering, prompt formatting, custom loss functions, architectural modifications, addressing cold-start problems, query embedding generation and clustering through VectorDB, and RL policy-based exploration.<\/p>","track":"Artificial Intelligence","level":"Advanced","type":"Breakout","industry":["Health and Life Sciences, Professional Services, Financial Services"],"category":["MLFlow, Llama, Mosaic AI"],"areas_of_interest":["AI Agents, Generative AI (LLMs), ML\/LLMOps"],"delivery":["In Person"],"speakers":[{"name":"Aditya Gautam","company":"Meta","job_title":"Machine Learning Lead","bio":"Aditya is a seasoned Machine learning practitioner, currently working on LLM (llama) application to enhance recommendation and ranking algorithms at scale. He has led several critical Machine learning projects in Facebook reels including user interest exploration, trend detection, quality improvement and safeguarding policy by detection violation and mitigating misinformation. He holds a master’s degree from Carnegie Mellon University, has worked in Machine learning at Google and has been a founding engineer of an AI startup at Area 120 (Google Incubator). Aditya has been quite active in the Generative AI community and is actively contributing through different speaking, panel and research engagement at various conferences.<br \/>\n","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Screenshot%25202025-02-02%2520at%25203.14.16%25E2%2580%25AFPM_1738547843341001xBWa.png?h=13955ce6&itok=Lx5QcAVe","alt":"Aditya Gautam"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/optimize-cost-and-user-value-through-model-routing-ai-agent","alias":"\/data-ai-summit-2025\/session\/optimize-cost-and-user-value-through-model-routing-ai-agent","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534842+00:00"}
{"id":"D25B1835","title":"Optimizing EV Charging Experience: Machine Learning for Accurate Charge Time Estimation","description":"<p>Accurate charge time estimation is key to vehicle performance and user experience. We developed a scalable ML model that enhances real-time charge predictions in vehicle controls. Traditional rule-based methods struggle with dynamic factors like environment, vehicle state, and charging conditions. Our adaptive ML solution improves accuracy by 10%.<\/p><p> <\/p><p>We use Unity Catalog for data governance, Delta Tables for storage, and Liquid Clustering for data layout. Job schedulers manage data processing, while AutoML accelerates model selection. MLflow streamlines tracking, versioning, and deployment. A dedicated serving endpoint enables A\/B testing and real-time insights.<\/p><p> <\/p><p>As our data ecosystem grew, scalability became critical. Our flexible ML framework was integrated into vehicle control systems within months. With live accuracy tracking and software-driven blending, we support 50,000+ weekly charge sessions, improving energy management and user experience.<\/p>","track":"Artificial Intelligence","level":"Advanced","type":"Breakout","industry":["Energy and Utilities"],"category":["MLFlow"],"areas_of_interest":["Machine Learning"],"delivery":["In Person"],"speakers":[{"name":"Mohammed Farag","company":"Rivian Automotive, LLC","job_title":"Senior Manager, Machine Learning & AI","bio":"Mohammed Farag is Senior Manager of AI & Machine Learning at Rivian, where he leads the integration of real-time machine learning into vehicle control systems, enabling intelligent performance, predictive diagnostics, and optimized EV charging. His work focuses on scaling AI\/ML platforms for embedded systems, from deep learning to MLOps. He holds a Ph.D. in Engineering from McMaster Univ. and a Master’s in Management from Harvard. Prior to Rivian, Mohammed led autonomous driving architecture at BMW and was founder of a digital twin company for battery management systems. He holds multiple patents and received the IEEE Best Paper Award. His work bridges AI, energy systems, and control engineering to drive innovation in electric mobility.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/imresizer-1703183782658_1746059688140001Hzql.jpg?h=3645ed1b&itok=Evc08_5x","alt":"Mohammed Farag"}},{"name":"Sihang Chen","company":"Rivian","job_title":"Sr. Machine Learning\/AI Engineer","bio":"Sihang Chen is a Sr. Machine Learning\/AI Engineer at Rivian, driven by a passion for clean energy and data-powered innovation. With a background in data science and sustainable energy systems, he bridges Machine Learning and vehicle intelligence to build scalable solutions for electric mobility. His work focuses on enhancing EV performance, energy efficiency, and charging experience through massive telemetry data and real-time deployed ML systems. Passionate about sustainable mobility and real-world impact, he will present Rivian's ML-powered charge time prediction framework at the 2025 Databricks AI Summit.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Sihang_Chen_Photo_Badge_1745274138797001WaAg.png?h=cb6957fd&itok=nQzzMaxz","alt":"Sihang Chen"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/optimizing-ev-charging-experience-machine-learning-accurate-charge-time","alias":"\/data-ai-summit-2025\/session\/optimizing-ev-charging-experience-machine-learning-accurate-charge-time","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534849+00:00"}
{"id":"D25B1028","title":"Patients Are Waiting... Accelerating Healthcare Innovation With Data, AI and Agents","description":"<p>In an era of exponential data growth, organizations across industries face common challenges in transforming raw data into actionable insights. This presentation showcases how Novo Nordisk is pioneering insights generation approaches to clinical data management and AI.Using our clinical trials platform FounData, built on Databricks, we demonstrate how proper data architecture enables advanced AI applications. We'll introduce a multi-agent AI framework that revolutionizes data interaction, combining specialized AI agents to guide users through complex datasets. While our focus is on clinical data, these principles apply across sectors – from manufacturing to financial services.Learn how democratizing access to data and AI capabilities can transform organizational efficiency while maintaining governance. Through this real-world implementation, participants will gain insights on building scalable data architectures and leveraging multi-agent AI frameworks for responsible innovation.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Health and Life Sciences"],"category":["MLFlow, AI\/BI, Unity Catalog"],"areas_of_interest":["AI Agents, Data Applications, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"JZTS (Jonatan Selsing)","company":"Novo Nordisk","job_title":"Principal Platform Architect","bio":"I'm a Principal Platform Architect, employed at Novo Nordisk. I have a research background in astrophysics and am now a part of Global Data and AI where I operationalise and enterprise scale the most sophisticated, contemporary computational frameworks and platforms in a highly regulated industry. I work across the industry and focus on driving large projects of strategic importance that are aligned to business goals. Through the focus on the future of computers, I ensure that Novo Nordisk is ahead in the digital age.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/profile_picture_1738600476582001H3sY.jpg?h=6ead44df&itok=7BB4aYOT","alt":"JZTS (Jonatan Selsing)"}},{"name":"Thomas Larsen","company":"Novo Nordisk A\/S","job_title":"VP, Data & AI Platform Engineering","bio":null,"image":{}},{"name":"Christian Sørensen","company":"Novo Nordisk","job_title":"Head of Automation & Digital Innovation","bio":"Head of Automation & Digital Innovation","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/QCSO_1746046433798001CUt5.jpg?h=794c6362&itok=ZudGub4W","alt":"Christian Sørensen"}}],"day":"Tuesday","room":"South, Esplanade, Room 158","starts":"2025-06-10T17:20:00","ends":"2025-06-10T18:00:00","starts_pst":"2025-06-10T10:20:00","ends_pst":"2025-06-10T11:00:00","start_time":"5:20 pm","end_time":"6:00 pm","pst_start_time":"10:20 am","pst_end_time":"11:00 am","duration":"40","path":"\/session\/patients-are-waiting-accelerating-healthcare-innovation-data-ai-and","alias":"\/data-ai-summit-2025\/session\/patients-are-waiting-accelerating-healthcare-innovation-data-ai-and","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534868+00:00"}
{"id":"D25B1761","title":"Petrobras MLOps Transformation With MLflow and Databricks","description":"<p>As a global energy leader, Petrobras relies on machine learning to optimize operations, but manual model deployment and validation processes once created bottlenecks that delayed critical insights.<\/p><p> <\/p><p>In this session, we’ll reveal how we revolutionized our MLOps framework using MLflow, Databricks Asset Bundles (DABs) and Unity Catalog to:<\/p><ul>\t<li>Replace error-prone manual validation with automated metric-driven workflows<\/li>\t<li>Reduce model deployment timelines from days to hours<\/li>\t<li>Establish granular governance and reproducibility across production models<\/li><\/ul><p> <\/p><p>Discover how we enabled data scientists to focus on innovation—not infrastructure—through standardized pipelines while ensuring compliance and scalability in one of the world’s most complex energy ecosystems.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Energy and Utilities, Public Sector"],"category":["MLFlow, Databricks Workflows, Unity Catalog"],"areas_of_interest":["Data Science, Machine Learning, ML\/LLMOps"],"delivery":["In Person"],"speakers":[{"name":"Luiz Carrossoni Neto","company":"Databricks","job_title":"Sr. Solutions Architect","bio":"Luiz Carrossoni Neto is a Sr. Solutions Architect at Databricks, with a strong background in Big Data, data architecture, and scalable analytics platforms. He holds a degree in Data Processing from FATEC-SP and an MBA in Data Analysis and Data Science from FIA. With over a decade of experience in data-intensive environments, Luiz has worked with a wide range of MPP databases and modern data technologies. Currently based in São José do Rio Preto, SP Brazil, he focuses on helping organizations modernize their data ecosystems. ","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/1716299348667%2520%25281%2529_1744380249413001ftJw.png?h=fbf7a813&itok=pZPBHFlQ","alt":"Luiz Carrossoni Neto"}},{"name":"Bruno Guberfain do Amaral","company":"Petrobras","job_title":"Consultant","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/petrobras-mlops-transformation-mlflow-and-databricks","alias":"\/data-ai-summit-2025\/session\/petrobras-mlops-transformation-mlflow-and-databricks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534888+00:00"}
{"id":"D25B3099","title":"Practical AI Solutions: From Customer Care to Supply Chain Excellence","description":"Discover how two industry leaders are delivering measurable business value through practical AI implementations. Lippert Components demonstrates their success in transforming customer support through GenAI, enhancing efficiency and reducing agent turnover across their million-call operation. Hypertherm shares how their innovative three-pronged automation approach revolutionized order processing, achieving 52% automation rates and handling 100,000 orders without human intervention in 2024, while freeing up valuable resources for strategic roles. These real-world applications showcase how AI solutions can drive operational excellence across customer service and supply chain domains.","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Manufacturing"],"category":["AI\/BI"],"areas_of_interest":["Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Chris Nishnick","company":"Lippert","job_title":"Director of AI","bio":"Chris Nishnick is the Director of AI at Lippert, a leading global manufacturer of highly engineered products for the RV, marine, and automotive industries. At Lippert, Chris is focused on driving innovation and business value, utilizing AI and ML technologies to enhance product development, optimize operations, and deliver superior customer experiences.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Chris_Nishnick_1744406920038001wbx2.PNG?h=2a479378&itok=r9ghsED3","alt":"Chris Nishnick"}},{"name":"Kenan Colson","company":"Lippert","job_title":"VP, Data + AI","bio":"Kenan Colson is the VP of Data + AI at Lippert, a leading global manufacturer of highly engineered products for the RV, marine and automotive industries. At Lippert, Kenan is focused on creating an environment where all decision are made and validated with data, while driving innovation and business value. While she works at a manufacturing company, she can talk about her success in achieving data democratization across a number of facets. She overseas a multinational Lakehouse environment ingesting all of Lippert's core business systems data.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Profile2_1744826470972001I5QW.png?h=dc1b65a9&itok=ilx3MRs-","alt":"Kenan Colson"}},{"name":"Narasimhan Krishnan","company":"Hypertherm Associates","job_title":"Director - AI, Analytics & Automation","bio":"Currently, I serve as the Director of AI, Analytics & Automation at Hypertherm Associates in Hanover, New Hampshire. In this role, I oversee the strategic implementation of artificial intelligence solutions and drive innovation through advanced analytics and process automation. Before assuming my current position, I led the Data & AI Program at Hypertherm. Prior to this, I was the Manager of DevOps. I completed my master’s in computing and information sciences from Kansas State University, and I also hold a Post Graduate degree in AI & ML from The University of Texas at Austin. Beyond my professional life, I love travelling and I enjoy both playing\/watching tennis. I also love skiing, biking, and hiking with my family.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Profile%2520Picture_1745187377595001zj4s.jpg?h=17ab1ee7&itok=holYArLT","alt":"Narasimhan Krishnan"}},{"name":"Brian Cavanaugh","company":"Hypertherm Associates","job_title":"Senior Programmer","bio":"Brian Cavanaugh is a Senior Programmer at Hypertherm Associates, specializing in Data and AI technologies. With over 25 years of experience in data processing, Brian has developed innovative solutions and contributed significantly to various projects, including Order Entry Automation. He holds a Master's in Computer Science from Southern Connecticut State University. Outside of work, Brian enjoys music and exercise, which help him stay creative and balanced.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Screenshot%25202025-05-01%2520at%25207.53.18%25E2%2580%25AFAM_1746104602357001PxLm.png?h=7f412c8f&itok=A5MzfCp9","alt":"Brian Cavanaugh"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/practical-ai-solutions-customer-care-supply-chain-excellence","alias":"\/data-ai-summit-2025\/session\/practical-ai-solutions-customer-care-supply-chain-excellence","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534906+00:00"}
{"id":"D25B2477","title":"Real-Time Botnet Defense at CVS: AI-Driven Detection and Mitigation on Databricks","description":"<p>Botnet attacks mobilize digital armies of compromised devices that continuously evolve, challenging traditional security frameworks with their high-speed, high-volume nature. In this session, we will reveal our advanced system — developed on the Databricks platform — that leverages cutting-edge AI\/ML capabilities to detect and mitigate bot attacks in near-real time. We will dive into the system’s robust architecture, including scalable data ingestion, feature engineering, MLOps strategies & production deployment of the system. We will address the unique challenges of processing bulk HTTP traffic data, time-series anomaly detection and attack signature identification. We will demonstrate key business values through downtime minimization and threat response automation. With sectors like healthcare facing heightened risks, ensuring data integrity and service continuity is vital. Join us to uncover lessons learned while building an enterprise-grade solution that stays ahead of adversaries.<\/p>","track":"Artificial Intelligence","level":"Advanced","type":"Breakout","industry":["Enterprise Technology, Health and Life Sciences"],"category":["AI\/BI, Databricks Workflows, Unity Catalog"],"areas_of_interest":["Cybersecurity, Data Science, Streaming pipelines"],"delivery":["In Person"],"speakers":[{"name":"Virender Dhiman","company":"CVS","job_title":"Sr. Data Scientist","bio":null,"image":{}},{"name":"andrew HintonA","company":"CVS","job_title":"Principal Data Scientist","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/real-time-botnet-defense-cvs-ai-driven-detection-and-mitigation","alias":"\/data-ai-summit-2025\/session\/real-time-botnet-defense-cvs-ai-driven-detection-and-mitigation","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534931+00:00"}
{"id":"D25B1106","title":"RecSys, Topic Modeling and Agents: Bridging the GenAI-Traditional ML Divide","description":"<p>The rise of GenAI has led to a complete reinvention of how we conceptualize Data + AI. In this breakout, we will recontextualize the rise of GenAI in traditional ML paradigms, and hopefully unite the pre- and post-LLM eras. We will demonstrate when and where GenAI may prove more effective than traditional ML algorithms, and highlight problems for which the wheel is unnecessarily being reinvented with GenAI. This session will also highlight how MLflow provides a unified means of benchmarking traditional ML against GenAI, and lay out a vision for bridging the divide between Traditional ML and GenAI practitioners.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, DSPy, Mosaic AI"],"areas_of_interest":["AI Agents, Machine Learning, ML\/LLMOps"],"delivery":["In Person"],"speakers":[{"name":"Dan Pechi","company":"Databricks","job_title":"Sr GenAI Product Specialist","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/recsys-topic-modeling-and-agents-bridging-genai-traditional-ml-divide","alias":"\/data-ai-summit-2025\/session\/recsys-topic-modeling-and-agents-bridging-genai-traditional-ml-divide","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534943+00:00"}
{"id":"D25B2155","title":"Responsible AI at Scale: Balancing Democratization and Regulation in the Financial Sector","description":"We partnered with Databricks to pioneer a new standard in financial sector's enterprise AI, balancing rapid AI democratization with strict regulatory and security requirements. At the core is our Responsible AI Gateway, enforcing jailbreak prevention and compliance on every LLM query. Real-time observability, powered by Databricks, calculates risk and accuracy metrics, detecting issues before escalation. Leveraging Databricks' model hosting ensures scalable LLM access, fortifying security and efficiency. We built frameworks to democratize AI without compromising guardrails. Operating in a regulated environment, we showcase how Databricks enables democratization and responsible AI at scale, offering best practices for financial organizations to harness AI safely and efficiently.","track":"Artificial Intelligence","level":"Advanced","type":"Breakout","industry":["Financial Services"],"category":["MLFlow, Mosaic AI, Unity Catalog"],"areas_of_interest":["Generative AI (LLMs), ML\/LLMOps, Security & Compliance"],"delivery":["In Person"],"speakers":[{"name":"Aman Thind","company":"State Street","job_title":"Executive Vice President and Chief Architect for State Street","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/responsible-ai-scale-balancing-democratization-and-regulation-financial","alias":"\/data-ai-summit-2025\/session\/responsible-ai-scale-balancing-democratization-and-regulation-financial","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534976+00:00"}
{"id":"D25B3087","title":"Revolutionizing Insurance: How to Drive Growth and Innovation\t\t\t\t","description":"<p>The insurance industry is rapidly evolving as advances in data and artificial intelligence (AI) drive innovation, enabling more personalized customer experiences, streamlined operations, and improved efficiencies. With powerful data analytics and AI-driven solutions, insurers can automate claims processing, enhance risk management, and make real-time decisions. Leveraging insights from large and complex datasets, organizations are delivering more customer-centric products and services than ever before. Key takeaways: Real-world applications of data and AI in claims automation, underwriting, and customer engagementHow predictive analytics and advanced data modeling help anticipate risks and meet customer needs. Personalization of policies, optimized pricing, and more efficient workflows for greater ROI. Discover how data and AI are fueling growth, improving protection, and shaping the future of the insurance industry!<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Breakout","industry":["Financial Services"],"category":["Mosaic AI, Unity Catalog"],"areas_of_interest":["Data Intelligence, Thought Leadership, Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Anindita Mahapatra","company":"Databricks","job_title":"Principal Solutions Architect","bio":"I’m a Solutions Architect focused on the data and analytics space. I’ve over 20 years of experience in software development, consulting, and client-facing roles helping organizations make the most of their data investments. I've authored the book “Simplifying Data Engineering and Analytics with Delta: Create analytics-ready data that fuels artificial intelligence and business intelligence\" I have a Master's degree in Computer Science from Boston University, a Master's degree in Liberal Arts and Management from Harvard Extension School, and I have co-authored 2 patents. I teach a graduate course on Data Engineering (CSCI E-103) at the Harvard Extension School.","image":{}},{"name":"Porter Orr","company":"Standard","job_title":null,"bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/revolutionizing-insurance-how-drive-growth-and-innovation","alias":"\/data-ai-summit-2025\/session\/revolutionizing-insurance-how-drive-growth-and-innovation","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535009+00:00"}
{"id":"D25B1801","title":"Revolutionizing Nuclear AI With HiVE and Bertha on Databricks Architecture","description":"<p>In this session we will explore the revolutionary advancements in nuclear AI capabilities with HiVE and Bertha on Databricks architecture. HiVE, developed by Westinghouse, leverages over a century of proprietary data to deliver unparalleled AI capabilities. At its core is Bertha, a generative AI model designed to tackle the unique challenges of the nuclear industry.<\/p><p> <\/p><p>This session will delve into the technical architecture of HiVE and Bertha, showcasing how Databricks' scalable environment enhances their performance. We will discuss the secure data infrastructure supporting HiVE, ensuring data integrity and compliance. Real-world applications and use cases will demonstrate the impact of HiVE and Bertha on improving efficiency, innovation and safety in nuclear operations.<\/p><p> <\/p><p>Discover how the fusion of HiVE and Bertha with Databricks architecture is transforming the nuclear AI landscape and driving the future of nuclear technology.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Breakout","industry":["Energy and Utilities, Manufacturing"],"category":["Unity Catalog"],"areas_of_interest":["Generative AI (LLMs), Security & Compliance"],"delivery":["In Person"],"speakers":[{"name":"Lou Martinez Sancho","company":"Westinghouse Electric Company","job_title":"CTO, EVP R&D and Innovation","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/revolutionizing-nuclear-ai-hive-and-bertha-databricks-architecture","alias":"\/data-ai-summit-2025\/session\/revolutionizing-nuclear-ai-hive-and-bertha-databricks-architecture","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535013+00:00"}
{"id":"D25L2757","title":"Route to Success: Scalable Routing Agents With Databricks and DSPy","description":"<p>As companies increasingly adopt Generative AI, they're faced with a new challenge: managing multiple AI assistants. What if you could have a single, intuitive interface that automatically directs questions to the best assistant for the task? Join us to discover how to implement a flexible Routing Agent that streamlines working with multiple AI Assistants. We'll show you how to leverage Databricks and DSPy 3.0 to simplify adding this powerful pattern to your system.<\/p><p> <\/p><p>We'll dive into the essential aspects including:<\/p><ul>\t<li>Using DSPy optimizers to maximize correct route selections<\/li>\t<li>Optimizing smaller models to reduce latency<\/li>\t<li>Creating stateful interactions<\/li>\t<li>Designing for growth and adaptability to support tens or hundreds of AI Assistants<\/li>\t<li>Ensuring authorized access to AI Assistants<\/li>\t<li>Tracking performance in production environments<\/li><\/ul><p> <\/p><p>We'll share real-world examples that you can apply today. You'll leave with the knowledge to make your AI system run smoothly and efficiently.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Lightning Talk","industry":["Enterprise Technology, Professional Services"],"category":["MLFlow, DSPy, Mosaic AI"],"areas_of_interest":["AI Agents, Generative AI (LLMs), Open Source"],"delivery":["In Person"],"speakers":[{"name":"Luis Moros","company":"Databricks","job_title":"Staff Data Scientist - ML Practice","bio":"<br \/>\nLuis Moros is a Staff Machine Learning Engineer consultant at the ML Practice of Databricks.  He has been working in software engineering for more than 20 years, focusing in GenAI, Data Science and Big Data in the last 8.  Prior to Databricks, Luis has applied Machine Learning and Data Science in different industries including: Financial Services, BioTech, Entertainment, and Augmented Reality.  ","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/LuisMoros_1744308212514001IZvo.png?h=89eaebb6&itok=_AUsY1Zn","alt":"Luis Moros"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/route-success-scalable-routing-agents-databricks-and-dspy","alias":"\/data-ai-summit-2025\/session\/route-success-scalable-routing-agents-databricks-and-dspy","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535021+00:00"}
{"id":"D25L2733","title":"Scaling Blockchain ML With Databricks: From Graph Analytics to Graph Machine Learning","description":"<p>Coinbase leverages Databricks to scale ML on blockchain data, turning vast transaction networks into actionable insights. This session explores how Databricks’ scalable infrastructure, powered by Delta Lake, enables real-time processing for ML applications like NFT floor price predictions. We’ll show how GraphFrames helps us analyze billion-node transaction graphs (e.g., Bitcoin) for clustering and fraud detection, uncovering structural patterns in blockchain data. But traditional graph analytics has limits. We’ll go further with Graph Neural Networks (GNNs) using Kumo AI, which learn from the transaction network itself rather than relying on hand-engineered features. By encoding relationships directly into the model, GNNs adapt to new fraud tactics, capturing subtle relationships that evolve over time. Join us to see how Coinbase is advancing blockchain ML with Databricks and deep learning on graphs.<\/p>","track":"Artificial Intelligence","level":"Advanced","type":"Lightning Talk","industry":["Enterprise Technology"],"category":["Apache Spark, MLFlow, PyTorch"],"areas_of_interest":["Data Ingestion, Data Science, ML\/LLMOps, Open Source"],"delivery":["In Person"],"speakers":[{"name":"Indra Rustandi","company":"Coinbase","job_title":"Staff ML Engineer","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/scaling-blockchain-ml-databricks-graph-analytics-graph-machine-learning","alias":"\/data-ai-summit-2025\/session\/scaling-blockchain-ml-databricks-graph-analytics-graph-machine-learning","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535047+00:00"}
{"id":"D25B2098","title":"Scaling Demand Forecasting at Nikon: Automating Camera Accessories Sales Planning with Databricks","description":"<p>At Nikon, camera accessories are essential in meeting the diverse needs of professional photographers worldwide, making their timely availability a priority. Forecasting accessories, however, presents unique challenges including dependencies on parent products, sparse demand patterns, and managing predictions for thousands of items across global subsidiaries. To address this, we leveraged Databricks' unified data and AI platform to develop and deploy an automated, scalable solution for accessory sales planning. Our solution employs a hybrid approach that auto-selects best algorithm from a suite of ML and time-series models, incorporating anomaly detection and methods to handle sparse and low-demand scenarios. MLflow is utilized to automate model logging and versioning, enabling efficient management, and scalable deployment. The framework includes data preparation, model selection and training, performance tracking, prediction generation, and output processing for downstream systems.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Manufacturing"],"category":["Delta Lake, MLFlow, Databricks Workflows"],"areas_of_interest":["Data Applications, Machine Learning, ML\/LLMOps"],"delivery":["In Person"],"speakers":[{"name":"Heya Ouyang","company":"Nikon Corporation","job_title":"Senior Associate Researcher","bio":"After earning a Master’s degree in Industrial and Operations Engineering with a focus on operations research, Heya Ouyang joined Nikon in 2022 as a researcher at the Mathematical Science Research Laboratory. Her work centers on applying data science and advanced analytical methods to optimize decision-making in supply chain management, with a focus on Sales & Operations Planning (S&OP), demand forecasting, and production plan optimization. In her current role, Heya collaborates with her team to utilize Databricks to streamline R&D processes, ensuring efficient transitions from development to production.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Heya_Ouyang_1746005339192001kMEY.png?h=472ba4bf&itok=7BbTjee8","alt":"Heya Ouyang"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/scaling-demand-forecasting-nikon-automating-camera-accessories-sales","alias":"\/data-ai-summit-2025\/session\/scaling-demand-forecasting-nikon-automating-camera-accessories-sales","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535071+00:00"}
{"id":"D25L2292","title":"Scaling GenAI Inference From Prototype to Production: Real-World Lessons in Speed & Cost","description":"<p>This lightning talk dives into real-world GenAI projects that scaled from prototype to production using Databricks’ fully managed tools. Facing cost and time constraints, we leveraged four key Databricks features—Workflows, Model Serving, Serverless Compute, and Notebooks—to build an AI inference pipeline processing millions of documents (text and audiobooks).<\/p><p> <\/p><p>This approach enables rapid experimentation, easy tuning of GenAI prompts and compute settings, seamless data iteration and efficient quality testing—allowing Data Scientists and Engineers to collaborate effectively. Learn how to design modular, parameterized notebooks that run concurrently, manage dependencies and accelerate AI-driven insights.<\/p><p> <\/p><p>Whether you're optimizing AI inference, automating complex data workflows or architecting next-gen serverless AI systems, this session delivers actionable strategies to maximize performance while keeping costs low.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Lightning Talk","industry":["Education, Media and Entertainment"],"category":["Delta Lake, Data Marketplace, Databricks Workflows"],"areas_of_interest":["ETL, Generative AI (LLMs), Orchestration"],"delivery":["In Person"],"speakers":[{"name":"Anish Kumar","company":"Scribd","job_title":"Lead Engineer","bio":null,"image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/s6r0zmdl_1745943743963001uuwC.png?h=777b3280&itok=J4ptB2eD","alt":"Anish Kumar"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/scaling-genai-inference-prototype-production-real-world-lessons-speed","alias":"\/data-ai-summit-2025\/session\/scaling-genai-inference-prototype-production-real-world-lessons-speed","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535075+00:00"}
{"id":"D25B3292DBX","title":"Scaling Generative AI: Batch Inference Strategies for Foundation Models","description":"<p>Curious how to apply resource-intensive generative AI models across massive datasets without breaking the bank? This session reveals efficient batch inference strategies for foundation models on Databricks. Learn how to architect scalable pipelines that process large volumes of data through LLMs, text-to-image models and other generative AI systems while optimizing for throughput, cost and quality.<\/p><p> <\/p><p>Key takeaways:<\/p><ul>\t<li>Implementing efficient batch processing patterns for foundation models using AI functions<\/li>\t<li>Optimizing token usage and prompt engineering for high-volume inference<\/li>\t<li>Balancing compute resources between CPU preprocessing and GPU inference<\/li>\t<li>Techniques for parallel processing and chunking large datasets through generative models<\/li>\t<li>Managing model weights and memory requirements across distributed inference tasks<\/li><\/ul><p> <\/p><p>You'll discover how to process any scale of data through your generative AI models efficiently.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Databricks SQL, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Ankit Mathur","company":"Databricks","job_title":"Engineering Lead, AI Serving","bio":"I work on ML Infrastructure here at Databricks, and I currently tech lead our model serving efforts for GPUs and LLMs. Recently, I was a member of the team that created our Dolly model and dataset. Previously, I've worked on a wide variety of ML at Databricks, ranging from open source MLflow to Model Registry, and before that, I did research at Stanford in Matei Zaharia's lab on computer vision inference<br \/>\n<br \/>\nLove talking about all sorts of data stuff - email me and we can find time to chat at DAIS!","image":{}},{"name":"Andrew Shieh","company":"Databricks","job_title":"Software Engineer","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/scaling-generative-ai-batch-inference-strategies-foundation-models","alias":"\/data-ai-summit-2025\/session\/scaling-generative-ai-batch-inference-strategies-foundation-models","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535079+00:00"}
{"id":"D25B2327","title":"Scaling Real-Time Fraud Detection With Databricks: Lessons From DraftKings","description":"<p>At DraftKings, ensuring secure, fair gaming requires detecting fraud in real time with both speed and precision. In this talk, we’ll share how Databricks powers our fraud detection pipeline, integrating real-time streaming, machine learning and rule-based detection within a PySpark framework. Our system enables rapid model training, real-time inference and seamless feature transformation across historical and live data. We use shadow mode to test models and rules in live environments before deployment. Collaborating with Databricks, we push online feature store performance and enhance real-time PySpark capabilities. We'll cover PySpark-based feature transformations, real-time inference, scaling challenges and our migration from a homegrown system to Databricks. This session is for data engineers and ML practitioners optimizing real-time AI workloads, featuring a deep dive, code snippets and lessons from building and scaling fraud detection.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Media and Entertainment"],"category":["Apache Spark, Delta Lake, MLFlow"],"areas_of_interest":["Data Science, Machine Learning, Gaming"],"delivery":["In Person"],"speakers":[{"name":"Monika Hristova","company":"Draftkings","job_title":"Principal Software Engineers","bio":"Monika Hristova is a Principal Software Engineer at DraftKings with 17 years in development. For the last decade she has built distributed, real-time data systems using Apache Flink, Spark, and Databricks. She now drives fraud-detection and streaming initiatives. Earlier roles spanned several sectors, where she delivered large-scale data platforms and ML-powered pipelines. Passionate about scalable algorithms, Monika also enjoys mountain biking, trail running, and a good book.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/IMG_20250429_154940_584_1745931335860001YDlA.jpg?h=3cd06fc8&itok=86tVOy8N","alt":"Monika Hristova"}},{"name":"Greg Von Pless","company":"DraftKings","job_title":"Principal Data Science Engineer","bio":"Greg Von Pless has been working in software development and machine learning research for over 16 years. At DraftKings for the last 5 years, he has led teams focused on personalization and machine learning platform, and now acts as an overall solutions architect for data science and machine learning systems. He was previously at BAE Systems, Inc., where he focused on machine learning research and development.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/greg_von_pless_headshot_1738612472080001JXcK.jpg?h=9d998b9d&itok=RfF0QMf3","alt":"Greg Von Pless"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/scaling-real-time-fraud-detection-databricks-lessons-draftkings","alias":"\/data-ai-summit-2025\/session\/scaling-real-time-fraud-detection-databricks-lessons-draftkings","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535092+00:00"}
{"id":"D25B1221","title":"Scaling Sales Excellence: How Databricks Uses Its Own Tech to Train GTM Teams","description":"<p>In this session, discover how Databricks leverages the power of Gen AI, MosaicML, Model Serving and Databricks Apps to revolutionize sales enablement. We’ll showcase how we built an advanced chatbot that equips our go-to-market team with the tools and knowledge needed to excel in customer-facing interactions. This AI-driven solution not only trains our salespeople but also enhances their confidence and effectiveness in demonstrating the transformative potential of Databricks to future customers.<\/p><p> <\/p><p>Attendees will gain insights into the architecture, development process and practical applications of this innovative approach. The session will conclude with an interactive demo, offering a firsthand look at the chatbot in action. Join us to explore how Databricks is using its own platform to drive sales excellence through cutting-edge AI solutions.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Llama, Mosaic AI"],"areas_of_interest":["AI Agents, Data Applications, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Sergio Ballesteros Solanas","company":"Databricks","job_title":"Senior Solutions Architect","bio":"Sergio is a Senior Solutions Architect in Data and AI at Databricks. He has a background in AI, Data Science, and Data Engineering. Currently, he helps companies in the Southeast Asia market to adopt and scale AI solutions.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Screenshot%25202025-04-07%2520at%252012.54.19_1744001859083001JsRZ.png?h=1f776e8b&itok=Z99QjEyN","alt":"Sergio Ballesteros Solanas"}},{"name":"Ivy Ng","company":"Databricks","job_title":"Director, Sales Performance, APJ","bio":"Ivy Ng is an accomplished sales enablement expert with over 25 years of both sales enablement and sales experience across the Asia Pacific. She has a proven track record of delivering exceptional results for Fortune 500 companies and government agencies, driving business growth and expanding market presence.<br \/>\n<br \/>\nIvy has spent over a decade specializing in sales enablement, during which she has honed her expertise in designing and delivering high-impact programs that enhance sales capabilities. She has completed several renowned train-the-trainer programs and also being certified by the Singapore Government. This extensive training background equips Ivy to create tailored sales solutions that boost performance and deliver long-term success.<br \/>\n<br \/>\n<br \/>\n<br \/>\n","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/69b29c8e-870a-4109-a2ff-5c9ae04c8353%2520%25281%2529_1744177810913001vpQF.jpg?h=01508041&itok=ExiOSgjX","alt":"Ivy Ng"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/scaling-sales-excellence-how-databricks-uses-its-own-tech-train-gtm","alias":"\/data-ai-summit-2025\/session\/scaling-sales-excellence-how-databricks-uses-its-own-tech-train-gtm","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535096+00:00"}
{"id":"D25B3302DBX","title":"Scaling Smarter: Technical Dive Into How Databricks Optimizes Model Serving","description":"<p>Learn from the experts on how Databricks’ Mosaic AI Model Serving delivers unparalleled speed and scalability for deploying AI models. This session delves into the architecture and innovations that showcase the impressive improvements in throughput for the AI-serving infrastructure that powers Mosaic AI.<\/p>","track":"Artificial Intelligence","level":"Advanced","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Asfandyar Qureshi","company":"Databricks","job_title":"Software Engineer","bio":null,"image":{}},{"name":"Cade Daniel","company":"Databricks","job_title":null,"bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/scaling-smarter-technical-dive-how-databricks-optimizes-model-serving","alias":"\/data-ai-summit-2025\/session\/scaling-smarter-technical-dive-how-databricks-optimizes-model-serving","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535101+00:00"}
{"id":"D25B1872","title":"Scaling XGBoost With Spark Connect ML on Grace Blackwell","description":"<p>XGBoost is one of the off-the-shelf gradient boosting algorithms for analyzing tabular datasets. Unlike deep learning, gradient-boosting decision trees require the entire dataset to be in memory for efficient model training. To overcome the limitation, XGBoost features a distributed out-of-core implementation that fetches data in batch, which benefits significantly from the latest NVIDIA GPUs and the NVLink-C2C’s ultra bandwidth.<\/p><p> <\/p><p>In this talk, we will share our work on optimizing XGBoost using the Grace Blackwell super chip. The fast chip-to-chip link between the CPU and the GPU enables XGBoost to scale up without compromising performance. Our work has effectively increased XGBoost’s training capacity to over 1.2TB on a single node.<\/p><p> <\/p><p>The approach is scalable to GPU clusters using Spark, enabling XGBoost to handle terabytes of data efficiently. We will demonstrate combining XGBoost out-of-core algorithms with the latest connect ML from Spark 4.0 for large model training workflows.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Retail and CPG - Food, Financial Services"],"category":["Apache Spark"],"areas_of_interest":["Data Science, Machine Learning, Open Source"],"delivery":["In Person"],"speakers":[{"name":"Bobby Wang","company":"Nvidia Corp","job_title":"Engineer","bio":"Bobby Wang is a distributed system engineer at Nvidia. Prior to Nvidia, I worked for Qualcomm on the Android platform. I hold an MS in communication and information system from University of Electronic Science and Technology of China","image":{}},{"name":"Jiaming Yuan","company":"​NVIDIA Semiconductor Co., Ltd","job_title":"Engineer","bio":"GPU Software Engineer at NVIDIA","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/jmy-1600x1600_1744281476019001l37W.png?h=00546c34&itok=zlH-XCUw","alt":"Jiaming Yuan"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/scaling-xgboost-spark-connect-ml-grace-blackwell","alias":"\/data-ai-summit-2025\/session\/scaling-xgboost-spark-connect-ml-grace-blackwell","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535115+00:00"}
{"id":"D25L1776","title":"Searching for Meaning in the Age of AI","description":"<p>Bryan McCann, You.com’s co-founder and CTO, shares his journey from studying philosophy and meaning to the Stanford Computer Science Department working on groundbreaking AI research alongside Richard Socher. Right now, AI is reshaping everything we hold dear — our jobs, creativity, and identities. It’s also our greatest source of inspiration. The Age of AI is simultaneously a Renaissance, Enlightenment, Industrial Revolution and likely source of humanity’s greatest existential crisis. To surmount this, Bryan will discuss how he uses AI responses as new starting points rather than answers, building teams like neural networks optimized for learning and how the answer to our meaning crisis may be for humans to be more like AI. Exploring AI’s impact on politics, economics, healthcare, education and culture, Bryan asserts that we must all take part in authoring humanity’s new story — AI can inspire us to become something new, rather than merely replace what we are now.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Lightning Talk","industry":["Education, Enterprise Technology, Professional Services"],"category":["AI\/BI"],"areas_of_interest":["AI Agents, Generative AI (LLMs), Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Bryan McCann","company":"You.com","job_title":"CoFounder and CTO","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/searching-meaning-age-ai","alias":"\/data-ai-summit-2025\/session\/searching-meaning-age-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535123+00:00"}
{"id":"D25B3084","title":"Securing Capital Markets: AI-Powered Risk Management for Resilience\t\t\t\t","description":"<p>Mitigating risk is vital for protecting reputation, assets and clients in capital markets. This session highlights how firms use Databricks’ Data Intelligence Platform to enhance risk management, ensure compliance and safeguard operations from emerging threats.<\/p><p> <\/p><p>Discover how advanced analytics and machine learning models enable anomaly detection, fraud prevention and precise regulatory management. Industry leaders share proactive risk strategies that balance security with operational efficiency.<\/p><p> <\/p><p>Key takeaways:<\/p><ul>\t<li>AI-powered techniques for early risk identification<\/li>\t<li>Best practices for navigating complex regulatory environments<\/li>\t<li>Strategies for building resilient operations that protect assets while supporting growth<\/li><\/ul><p> <\/p><p>Learn how data intelligence transforms risk management in capital markets, securing the future while driving success!<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Breakout","industry":["Financial Services"],"category":["Data Marketplace, AI\/BI, Mosaic AI"],"areas_of_interest":["Thought Leadership, Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Venkatesh Ganesan","company":"State Street","job_title":"Senior Vice President","bio":null,"image":{}},{"name":"Kim Hatton","company":"Databricks","job_title":"Global Head of FS Industry Marketing","bio":"Kim Hatton is the Global Financial Services Marketing Leader at Databricks, where she shapes global marketing strategy for the financial sector. With nearly two decades of experience, Kim has held marketing leadership roles at Databricks, AWS, Bloomberg LP, J.P. Morgan, Guardian Life, and UBS. She is known for driving digital transformation and AI innovation across banking, capital markets, and fintech. A frequent industry speaker, Kim is recognized for her strategic vision, collaborative leadership, and passion for helping organizations realize the value of data and AI. ","image":{}},{"name":"Luis Amador","company":"Moody's Analytics","job_title":"Chief Data Officer","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/securing-capital-markets-ai-powered-risk-management-resilience","alias":"\/data-ai-summit-2025\/session\/securing-capital-markets-ai-powered-risk-management-resilience","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535132+00:00"}
{"id":"D25B3077","title":"Self-Improving Agents and Agent Evaluation With Arize & Databricks ML Flow","description":"<p>As autonomous agents become increasingly sophisticated and widely deployed, the ability for these agents to evaluate their own performance and continuously self-improve is essential. However, the growing complexity of these agents amplifies potential risks, including exposure to malicious inputs and generation of undesirable outputs. In this talk, we'll explore how to build resilient, self-improving agents. To drive self-improvement effectively, both the agent and the evaluation techniques must simultaneously improve with a continuously iterating feedback loop. Drawing from extensive real-world experiences across numerous productionized use cases, we will demonstrate practical strategies for combining tools from Arize, Databricks MLflow and Mosaic AI to evaluate and improve high-performing agents.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["AI Agents, Generative AI (LLMs), ML\/LLMOps"],"delivery":["In Person"],"speakers":[{"name":"Aprana Dhinakaran","company":"Arize","job_title":"Co-Founder and Chief Product Officer","bio":"Aparna Dhinakaran is the Co-Founder and Chief Product Officer at Arize AI, a pioneer and early leader in machine learning (ML) observability. A frequent speaker at top conferences and thought leader in the space, Dhinakaran was recently named to the Forbes 30 Under 30. Before Arize, Dhinakaran was an ML engineer and leader at Uber, Apple, and TubeMogul (acquired by Adobe). During her time at Uber, she built several core ML Infrastructure platforms, including Michealangelo. She has a bachelor’s from Berkeley's Electrical Engineering and Computer Science program, where she published research with Berkeley's AI Research group. She is on a leave of absence from the Computer Vision Ph.D. program at Cornell University.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/aparna_1743519358108001x0TR.png?h=f57c33c4&itok=X1_sSRhE","alt":"Aprana Dhinakaran"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/self-improving-agents-and-agent-evaluation-arize-databricks-ml-flow","alias":"\/data-ai-summit-2025\/session\/self-improving-agents-and-agent-evaluation-arize-databricks-ml-flow","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535155+00:00"}
{"id":"D25B1812","title":"ServiceNow ‘Walks the Talk’ With Databricks: Revolutionizing Go-To-Market With AI","description":"<p>At ServiceNow, we’re not just talking about AI innovation — we’re delivering it. By harnessing the power of Databricks, we’re reimagining Go-To-Market (GTM) strategies, seamlessly integrating AI at every stage of the deal journey — from identifying high-value leads to generating hyper-personalized outreach and pitch materials.<\/p><p> <\/p><p>In this session, learn how we’ve slashed data processing times by over 90%, reducing workflows from an entire day to just 30 minutes with Databricks. This unprecedented speed enables us to deploy AI-driven GTM initiatives faster, empowering our sellers with real-time insights that accelerate deal velocity and drive business growth.<\/p><p> <\/p><p>As Agentic AI becomes a game-changer in enterprise GTM, ServiceNow and Databricks are leading the charge — paving the way for a smarter, more efficient future in AI-powered sales.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology, Manufacturing, Retail and CPG - Food"],"category":["AI\/BI, Databricks Workflows"],"areas_of_interest":["AI Agents, Data Science, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Amulya Gupta","company":"ServiceNow","job_title":"Senior NLP Data Scientist","bio":"Amulya is a Senior NLP Scientist at ServiceNow, bringing a unique blend of technical expertise and business acumen. He holds an MBA and a PhD in Computer Science, specializing in NLP. Before joining ServiceNow, he contributed to Nationwide Insurance and TCS, with additional experience from internships at Microsoft and EY. His diverse background enables him to lead complex projects, bridging AI innovation with real-world impact. Amulya continues to push the boundaries of NLP, driving advancements at ServiceNow while contributing to the internal tech community.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/image_1738362855416001Ix4E.png?h=98c429b1&itok=BRTsEIuL","alt":"Amulya Gupta"}},{"name":"Mili Merchant","company":"ServiceNow","job_title":"Senior AI Product Management","bio":"Mili Merchant is a Senior AI\/ML Product Manager at ServiceNow, driving cutting-edge AI solutions that transform the sales journey. She leverages machine learning and data science to power smarter decision-making, targeted engagement, and seamless automation, helping sellers work more efficiently and close deals faster.<br \/>\n<br \/>\nBefore stepping into AI product management, Mili honed her expertise in analytics and data science. As a Data Informatics Analyst, she optimized business processes with data-driven insights, and at Northrop Grumman, she built forecasting and reporting tools that enhanced supply chain efficiency and supplier performance.<br \/>\n<br \/>\nWith a master’s degree in Data Analytics from UC Irvine and a passion for data storytelling, she thrives on turning complex data into actionable strategies that drive real impact.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/headshot_1738364975912001XsmU.png?h=8ae8ef55&itok=6xKA27XA","alt":"Mili Merchant"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/servicenow-walks-talk-databricks-revolutionizing-go-market-ai","alias":"\/data-ai-summit-2025\/session\/servicenow-walks-talk-databricks-revolutionizing-go-market-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535180+00:00"}
{"id":"D25L2659","title":"Smart Inbox: A Cutting-Edge AI for Automated Customer Email Classification by ENGIE","description":"<p>In an era of digital communication overload, businesses struggle to efficiently process and categorize vast volumes of customer emails. Smart Inbox transforms this challenge into an opportunity by combining classic AI techniques with state-of-the-art generative AI, delivering a highly accurate and business-impactful email classification system.<\/p><p> <\/p><p>Built on Databricks’ powerful data and AI ecosystem, Smart Inbox integrates semantic analysis, large language models and distributed computing to enhance classification precision and reduce manual processing efforts. By leveraging both structured and unstructured data insights, this hybrid AI approach ensures not only operational efficiency but also improved customer engagement and faster response times. This presentation will unveil the key innovations behind Smart Inbox, demonstrating how cutting-edge AI can transform customer interaction workflows, enhance operational agility and redefine the future of intelligent email processing.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Lightning Talk","industry":["Energy and Utilities"],"category":["AI\/BI, PyTorch, Unity Catalog"],"areas_of_interest":["Data Science, Generative AI (LLMs), SQL"],"delivery":["In Person"],"speakers":[{"name":"Kenza Graoui","company":"ENGIE","job_title":null,"bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/smart-inbox-cutting-edge-ai-automated-customer-email-classification","alias":"\/data-ai-summit-2025\/session\/smart-inbox-cutting-edge-ai-automated-customer-email-classification","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535216+00:00"}
{"id":"D25B1337","title":"Smart Vehicles, Secure Data: Recreating Vehicle Environments for Privacy-Preserving Machine Learning","description":"<p>As connected vehicles generate vast amounts of personal and sensitive data, ensuring privacy and security in machine learning (ML) processes is essential. This session explores how Trusted Execution Environments (TEEs) and Azure Confidential Computing can enable privacy-preserving ML in cloud environments. We’ll present a method to recreate a vehicle environment in the cloud, where sensitive data remains private throughout model training, inference and deployment. Attendees will learn how Mercedes-Benz R&D North America builds secure, privacy-respecting personalized systems for the next generation of connected vehicles.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["Apache Spark, AI\/BI, Databricks Workflows"],"areas_of_interest":["Cybersecurity, Machine Learning, ML\/LLMOps"],"delivery":["In Person"],"speakers":[{"name":"Frankie Cancino","company":"Mercedes-Benz R&D","job_title":"Senior Data Scientist","bio":"Frankie is a Senior Data Scientist at Mercedes-Benz Research & Development, where he designs and deploys AI solutions and machine learning systems. With deep expertise in machine learning and predictive analytics, Frankie previously led major tech initiatives and built enterprise-scale ML systems at a large retail company. Outside of Mercedes he organizes a Meetup group, writes about machine learning concepts, and serves as an AI advisor for a venture capital firm.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Frankie_Cancino_1744391469813001VIbt.PNG?h=8a7fc05e&itok=d0tondGc","alt":"Frankie Cancino"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/smart-vehicles-secure-data-recreating-vehicle-environments-privacy","alias":"\/data-ai-summit-2025\/session\/smart-vehicles-secure-data-recreating-vehicle-environments-privacy","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535220+00:00"}
{"id":"D25B3346SPO","title":"Sponsored by: Deloitte | AI Innovation and Governance: AT&T and Deloitte Leverage Databricks for Secure AI Expansion","description":"<p>AT&T and Deloitte are driving AI innovation across their respective enterprises. Both companies are leveraging the Databricks Data Intelligence Platform to enable AI expansion and adoption as well as to address the complexities and risks associated with AI implementation in large, dynamic organizations. This session will explore how AT&T and Deloitte are transforming their businesses with advanced AI and Gen AI solutions. Attendees will also gain insights into how AT&T and Deloitte are managing enterprise risks, security threats, and data governance challenges without stifling innovation. Both companies will discuss how Databricks Data Intelligence Platform is enabling secure and robust AI development in support of AI security and governance requirements.<\/p>","track":"Artificial Intelligence","level":"Beginner","type":"Breakout","industry":["Media and Entertainment"],"category":["MLFlow, Unity Catalog"],"areas_of_interest":["Cybersecurity, Generative AI (LLMs), Security & Compliance"],"delivery":["In Person"],"speakers":[],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/sponsored-deloitte-ai-innovation-and-governance-att-and-deloitte","alias":"\/data-ai-summit-2025\/session\/sponsored-deloitte-ai-innovation-and-governance-att-and-deloitte","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535294+00:00"}
{"id":"D25L3345SPO","title":"Sponsored by: Infosys | Beyond Hype: Scale & Democratize Agentic AI across enterprise to realize business outcomes.","description":"<p>Agentic AI and multimodal data are the next frontiers for realizing intelligent and autonomous business systems.  Learn how Infosys innovates with Databricks for accelerating data to AI agent journey at scale across an enterprise. Hear our pragmatic capability driven approach instead of use case-based approach to bring the data universe, AI foundations, agent management, data and AI governance and collaboration under unified management.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Lightning Talk","industry":["Enterprise Technology, Health and Life Sciences, Retail and CPG - Food"],"category":["Delta Lake, Mosaic AI, Unity Catalog"],"areas_of_interest":["AI Agents, Generative AI (LLMs), Partner Innovation Showcase"],"delivery":["In Person"],"speakers":[],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/sponsored-infosys-beyond-hype-scale-democratize-agentic-ai-across","alias":"\/data-ai-summit-2025\/session\/sponsored-infosys-beyond-hype-scale-democratize-agentic-ai-across","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535314+00:00"}
{"id":"D25L3375SPO","title":"Sponsored by: Moveworks | Unlocking Full-stack AI Transformation with the Moveworks Platform","description":"<p>Learn how visionaries from the world’s leading organizations use Moveworks to give employees a single place to find information, automate tasks, and be more productive. See the Moveworks AI Assistant in action and experience how its reasoning-based architecture allows it to be a one-stop-shop for all employee requests (across IT, HR, finance, sales, and more), how Moveworks empowers developers to easily build new AI agents atop this architecture, and how we give stakeholders tools to implement effective AI governance. Finally, experience how customers and partners alike leverage information in Databricks to supplement their employees' AI journeys.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Lightning Talk","industry":["Enterprise Technology, Manufacturing, Retail and CPG - Food"],"category":["AI\/BI, Partner Connect"],"areas_of_interest":["AI Agents, Developer Experience, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/sponsored-moveworks-unlocking-full-stack-ai-transformation-moveworks","alias":"\/data-ai-summit-2025\/session\/sponsored-moveworks-unlocking-full-stack-ai-transformation-moveworks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535323+00:00"}
{"id":"D25M3202","title":"Startup Forum","description":"Hear from VC leaders, startup founders and early stage customers building on Databricks around what they are seeing in the market and how they are scaling their early stage companies on Databricks. This event is a must see for VCs, founders and those interested in the early stage company ecosystem.","track":"Artificial Intelligence","level":"Beginner","type":"Meetup","industry":["Enterprise Technology"],"category":["AI\/BI"],"areas_of_interest":["AI Agents"],"delivery":["In Person"],"speakers":[],"day":"Tuesday","room":"InterCon, Level 5, InterCon Ballroom","starts":"2025-06-10T16:00:00","ends":"2025-06-10T17:30:00","starts_pst":"2025-06-10T09:00:00","ends_pst":"2025-06-10T10:30:00","start_time":"4:00 pm","end_time":"5:30 pm","pst_start_time":"9:00 am","pst_end_time":"10:30 am","duration":"90","path":"\/session\/startup-forum","alias":"\/data-ai-summit-2025\/session\/startup-forum","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535337+00:00"}
{"id":"D25B3288DBX","title":"State of Enterprise AI: AI Agents and Beyond ","description":"<p>AI is evolving fast — from LLMs to intelligent agents and autonomous decision-making — and organizations are rethinking how they build and deploy data and AI systems. This session, led by Databricks executives, breaks down what’s happening now and what’s coming next. You’ll learn how these technologies are reshaping data architectures, what it takes to support AI systems at scale, and how Databricks is enabling businesses to move from experimentation to real-world impact.<\/p><p> <\/p><p>What you’ll learn:<\/p><ul>\t<li>Key trends shaping enterprise AI strategies and adoption<\/li>\t<li>How AI agents are impacting modern data and compute architectures<\/li>\t<li>Practical steps to align your data and AI platform with the direction of autonomous systems<\/li><\/ul>","track":"Artificial Intelligence","level":"Beginner","type":"Breakout","industry":["Enterprise Technology"],"category":["Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Craig Wiley","company":"Databricks","job_title":"AI\/ML Product Mgmt","bio":"Craig leads Product for Artificial Intelligence at Databricks. He joined three years ago from Google Cloud where he led their Cloud AI Products and built Vertex AI. Previous to Google, Craig spent 9 years at Amazon. Most recently, as the founding General Manager of Amazon SageMaker, AWS’ machine learning platform. Previous to AWS, he led pricing and analytics for Fulfillment By Amazon. Craig has a deep belief in democratizing the power of data. He pushes to improve the tooling for experienced users while also seeking to simplify it for the growing set of less experienced users. Outside of work he enjoys spending time with his family, and spending time on his bike.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/linkedinpic_1745610410485001pKXW.jpg?h=fbf7a813&itok=4P8nlz2G","alt":"Craig Wiley"}},{"name":"Hanlin Tang","company":"Databricks","job_title":"CTO, Neural Networks","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/state-enterprise-ai-ai-agents-and-beyond","alias":"\/data-ai-summit-2025\/session\/state-enterprise-ai-ai-agents-and-beyond","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535340+00:00"}
{"id":"D25L3080","title":"Streamlining DSPy Development: Track, Debug, and Deploy With MLflow","description":"<p>DSPy is a framework for authoring GenAI applications with automatic prompt optimization, while MLflow provides powerful MLOps tooling to track, monitor, and productize machine learning workflows. In this lightning talk, we demonstrate how to integrate MLflow with DSPy to bring full observability to your DSPy development.<\/p><p> <\/p><p>We’ll walk through how to track DSPy module calls, evaluations, and optimizers using MLflow’s tracing and autologging capabilities. By the end, you'll see how combining these two tools makes it easier to debug, iterate, and understand your DSPy workflows, then deploy your DSPy program — end to end.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Lightning Talk","industry":["Enterprise Technology, Professional Services"],"category":["MLFlow, DSPy"],"areas_of_interest":["AI Agents, Generative AI (LLMs), ML\/LLMOps, Open Source"],"delivery":["In Person"],"speakers":[{"name":"Chen Qian","company":"Databricks","job_title":"Senior Software Engineer","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/streamlining-dspy-development-track-debug-and-deploy-mlflow","alias":"\/data-ai-summit-2025\/session\/streamlining-dspy-development-track-debug-and-deploy-mlflow","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535364+00:00"}
{"id":"D25B3308DBX","title":"Talking to All Your Data: Building Multi-Agent Systems for Structured and Unstructured Information","description":"<p>Learn how to build sophisticated systems that enable natural language interactions with both your structured databases and unstructured document collections. This session explores advanced techniques for creating unified and governed AI systems that can seamlessly interpret questions, retrieve relevant information and generate accurate answers across your entire data ecosystem.<\/p><p> <\/p><p>Key takeaways include:<\/p><ul>\t<li>Strategies for combining vector search over unstructured documents with retrieval from structured databases<\/li>\t<li>Techniques for optimizing unstructured data processing through effective parsing, metadata enrichment and intelligent chunking<\/li>\t<li>Methods for integrating different retrieval mechanisms while ensuring consistent data governance and security<\/li>\t<li>Practical approaches for evaluating and improving KBQA system quality through automated and human feedback<\/li><\/ul>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Xiangrui Meng","company":"Databricks","job_title":"Principal Software Engineer","bio":"Xiangrui Meng is an Apache Spark PMC member and a software engineer at Databricks. His main interests center around developing and implementing scalable algorithms for scientific applications. He has been actively involved in the development and maintenance of Spark MLlib since he joined Databricks. Before Databricks, he worked as an applied research engineer at LinkedIn, where he was the main developer of an offline machine learning framework in Hadoop MapReduce. His Ph.D. work at Stanford is on randomized algorithms for large-scale linear regression problems.","image":{}},{"name":"Kasey Uhlenhuth","company":"Databricks","job_title":"Director of Product","bio":"Kasey Uhlenhuth is a product manager on the machine learning platform team at Databricks. Before Databricks, she worked on the Visual Studio and C# team at Microsoft building developer productivity tools. Kasey holds an MBA from the Stanford Graduate School of Business and a BA in Computer Science from Harvard University.<br \/>\n","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/talking-all-your-data-building-multi-agent-systems-structured-and","alias":"\/data-ai-summit-2025\/session\/talking-all-your-data-building-multi-agent-systems-structured-and","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535382+00:00"}
{"id":"D25B3307DBX","title":"Taming the LLM Wild West: A Unified Approach to GenAI Governance","description":"<p>Whether you're using OpenAI, Anthropic or open-source models like Meta Llama, the Mosaic AI Gateway is the central control plane across any AI model or agent. Learn how you can streamline access controls, enforce guardrails for compliance, ensure an audit trail and monitor costs across providers — without slowing down innovation. Lastly, we’ll dive even deeper into how AI Gateway works with Unity Catalog to deliver a full governance story for your end-to-end AI agents across models, tools and data.<\/p><p> <\/p><p>Key takeaways:<\/p><ul>\t<li>Centrally manage governance and observability across any LLM (proprietary or open-source)<\/li>\t<li>Give developers a unified query interface to swap, experiment and A\/B test across models<\/li>\t<li>Attribute costs and usage to teams for better visibility and chargebacks<\/li>\t<li>Enforce enterprise-grade compliance with guardrails and payload logging<\/li>\t<li>Ensure production reliability with load balancing and fallbacks<\/li><\/ul>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Archika Dogra","company":"Databricks","job_title":"Product Manager","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/taming-llm-wild-west-unified-approach-genai-governance","alias":"\/data-ai-summit-2025\/session\/taming-llm-wild-west-unified-approach-genai-governance","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535386+00:00"}
{"id":"D25B2908","title":"The AI Regulation Dilemma: Spur Innovation, or Guardrails? — Where Are We and the Impact of Trump 2","description":"<p>The Trump 2 AI agenda prioritizes US leadership by opposing regulation on bias and frontier AI risks, favoring innovation and AI expansion. With comprehensive federal AI regulation unlikely, states are advancing AI laws on bias, harmful content and transparency (e.g., Colorado). Meanwhile, the EU AI Act imposes global obligations. The emerging patchwork of state rules will burden US companies more than a unified federal approach, undermining Trump’s deregulatory goals. Ironically, the Trump agenda may accelerate state-level regulation and impede innovation. A light federal AI law preempting state rules is politically unlikely, leaving US companies with a fragmented landscape similar to privacy regulation where the EU AI Act — in the role of GDPR — has set the stage, and the states are asserting themselves with various incremental requirements. Important developments to then cover: EU GPAI Code of Practice (effective 8\/2\/25), newly enacted state laws, Korean AI law, Japan — if final.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Health and Life Sciences, Public Sector, Financial Services"],"category":["AI\/BI"],"areas_of_interest":["Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Scott Starbird","company":"Databricks","job_title":"Chief Public Affairs Officer","bio":"Scott Starbird heads the Public Affairs function at Databricks, and has held various leadership positions within Databricks’ Legal Department since early 2016. Scott is a member of the Board of Directors of BSA | The Software Alliance.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Scott%2520Starbird%2520Photo_1745353077434001eN6f.png?h=8bad69de&itok=-cqw5Sro","alt":"Scott Starbird"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/ai-regulation-dilemma-spur-innovation-or-guardrails-where-are-we-and","alias":"\/data-ai-summit-2025\/session\/ai-regulation-dilemma-spur-innovation-or-guardrails-where-are-we-and","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535420+00:00"}
{"id":"D25B1540","title":"The Future of Anti-Cheat","description":"<p>As online gaming evolves, so do cheating methods that exploit client-server vulnerabilities. Traditional anti-cheat, such as kernel-level drivers and runtime detections, has long been the primary defense. However, recent high-profile failures expose the risks of operating in kernel space. More critically, advanced cheats like Direct Memory Access (DMA) exploits and AI-powered Computer Vision (CV) hacks increasingly render client-side detection ineffective.<\/p><p> <\/p><p>This presentation examines the escalating arms race between cheat creators and developers, highlighting client-side limitations. With CV cheats mimicking human behavior, anti-cheat must shift toward server-side, data-driven detection. By leveraging AI, machine learning, and behavioral analytics to analyze player patterns, input anomalies, and decision inconsistencies, future solutions can move beyond static detection to adaptive security models, ensuring fair play at scale. <\/p>","track":"Artificial Intelligence","level":"Advanced","type":"Breakout","industry":["Media and Entertainment"],"category":["Apache Spark, MLFlow, AI\/BI"],"areas_of_interest":["Cybersecurity, Data Applications, Machine Learning, Gaming"],"delivery":["In Person"],"speakers":[{"name":"Carly Taylor","company":"Rebel Data Science","job_title":null,"bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/future-anti-cheat","alias":"\/data-ai-summit-2025\/session\/future-anti-cheat","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535427+00:00"}
{"id":"D25B1574","title":"The Next Wave of AI Applications Driven by Agentic Workflow at Adidas Using Databricks","description":"<p>Curious to know how Adidas is transforming customer experience and business impact with agentic workflows, powered by Databricks? By leveraging cutting-edge tools like MosaicML’s deployment capabilities, Mosaic AI Gateway, and MLflow, Adidas built a scalable GenAI agentic infrastructure that delivers actionable insights from growing 2 million product reviews annually.<\/p><p> <\/p><p>With remarkable results:<\/p><ul>\t<li>60% latency reduction (15.5 seconds to 6 seconds)<\/li>\t<li>91.67% cost savings (transitioning to more efficient LLMs)<\/li>\t<li>98.5% token efficiency, reducing input tokens from 200k to just 3k<\/li>\t<li>20% increase in productivity (faster time to insight)<\/li>\t<li>Empowering over 500 decision-makers across 150+ countries, this infrastructure is set to optimize products and services for Adidas’ 500 million members by 2025 while supporting dozens of upcoming AI-driven solutions.<\/li><\/ul><p> <\/p><p>Join us to explore how Adidas turned agentic workflows infra into a strategic advantage using Databricks and learn how you can do the same!<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology, Manufacturing, Retail and CPG - Food"],"category":["MLFlow, Mosaic AI, Partner Connect"],"areas_of_interest":["AI Agents, Generative AI (LLMs), Machine Learning"],"delivery":["In Person"],"speakers":[{"name":"Mahavir Teraiya","company":"Databricks","job_title":"Resident Solutions Architect","bio":"Mahavir Teraiya is a Resident Solutions Architect at Databricks with 15+ years of experience in Data, ML, and large-scale AI platform design. Formerly with AWS and Zalando, he now focuses on helping enterprise customers scale GenAI through agentic workflows. At DAIS, Mahavir will present the groundbreaking GenAI platform built with Adidas—the first of its kind in EMEA—driving 20% productivity gains and up to 91% cost savings. He is currently pursuing a PhD in Federated Learning and an MBA in IT. A passionate technologist and frequent speaker at AWS events and GopherCon, Mahavir thrives at the intersection of cutting-edge tech and business value.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Mahavir_Teraiya_1744530900151001IvQv.png?h=f99c3556&itok=r0EEOstS","alt":"Mahavir Teraiya"}},{"name":"Joana Ferreira","company":"Adidas AG","job_title":"ML Engineer","bio":"I have worn many hats in the Machine Learning field, starting as a Data Scientist, transitioning to Data Engineering, and now specializing as a Machine Learning Engineer. I leverage this diverse background to develop advanced Machine Learning solutions that drive innovation and enhance efficiency across adidas.<br \/>\n<br \/>\nI am passionate about empowering teams to harness AI capabilities in an ethical and environmentally responsible way. By creating frameworks that align with this vision, I aim to foster a culture of Responsible AI.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Joana_Ferreira_1745491595677001mQHN.png?h=fbf7a813&itok=iIriJDay","alt":"Joana Ferreira"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/next-wave-ai-applications-driven-agentic-workflow-adidas-using","alias":"\/data-ai-summit-2025\/session\/next-wave-ai-applications-driven-agentic-workflow-adidas-using","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535458+00:00"}
{"id":"D25L1595","title":"Three Big Unlocks to AI Interoperability With Databricks","description":"<p>The ability for different AI systems to collaborate is more critical than ever. From traditional ML development to fine-tuning GenAI models, Databricks delivers the stability, cost-optimization and productivity Expedia Group (EG) needs. Learn how to unlock the full potential of AI interoperability with Databricks.<\/p><ul>\t<li>AI acceleration: Discover how Databricks acts as a central hub, helping to scale AI model training and prediction generation to deliver high-quality insights for customers.<\/li>\t<li>Cross-platform synergy: Learn how EG seamlessly integrated Databricks' powerful features into its ecosystem, streamlining workflows and accelerating time to market.<\/li>\t<li>Scalable deployment: Understand how Databricks stability and reliability increased efficiency in prototyping and running scalable production workloads.<\/li><\/ul><p> <\/p><p>Join Shiyi Pickrell to understand the future of AI interoperability, how it’s generating business value and driving the next generation of travel AI-powered experiences.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Lightning Talk","industry":["Travel and Hospitality"],"category":["Apache Spark, Databricks Workflows, Unity Catalog"],"areas_of_interest":["Generative AI (LLMs), Machine Learning, ML\/LLMOps"],"delivery":["In Person"],"speakers":[{"name":"Shiyi Pickrell","company":"Expedia","job_title":"Senior Vice President","bio":"Shiyi Pickrell, senior vice president of Data and Artificial Intelligence at Expedia Group, oversees machine learning, data, and AI products. She focuses on unifying and modernizing machine learning platforms, increasing testing velocity, and transforming data into premium products for travelers, B2B partners, and developers. Before joining Expedia in 2021, Shiyi was Chief Data Scientist at SWARM Engineering, where she developed algorithms to reduce logistics costs and CO2 emissions in agriculture. Previously, she led the machine learning and analytics team at Microsoft and managed analytics tools at Amazon. Shiyi holds a Ph.D. in neuroscience from USC and an MBA from the University of Washington.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Shiyi%2520headshot3_small_1745359879588001uLCZ.jpg?h=d319a73a&itok=zdN4-qGW","alt":"Shiyi Pickrell"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/three-big-unlocks-ai-interoperability-databricks","alias":"\/data-ai-summit-2025\/session\/three-big-unlocks-ai-interoperability-databricks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535473+00:00"}
{"id":"D25B3297DBX","title":"Traditional ML at Scale: Implementing Classical Techniques With Databricks Mosaic AI","description":"<p>Struggling to implement traditional machine learning models that deliver real business value? Join us for a hands-on exploration of classical ML techniques powered by Databricks' Mosaic AI platform. This session focuses on time-tested approaches like regression, classification and clustering — showing how these foundational methods can solve real business problems when combined with Databricks' scalable infrastructure and MLOps capabilities.<\/p><p> <\/p><p>Key takeaways:<\/p><ul>\t<li>Building production-ready ML pipelines for common business use cases including customer segmentation, demand forecasting and anomaly detection<\/li>\t<li>Optimizing model performance using Databricks' distributed computing capabilities for large-scale datasets<\/li>\t<li>Implementing automated feature engineering and selection workflows<\/li>\t<li>Establishing robust MLOps practices for model monitoring, retraining and governance<\/li>\t<li>Integrating classical ML models with modern data processing techniques<\/li><\/ul>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Craig Wiley","company":"Databricks","job_title":"AI\/ML Product Mgmt","bio":"Craig leads Product for Artificial Intelligence at Databricks. He joined three years ago from Google Cloud where he led their Cloud AI Products and built Vertex AI. Previous to Google, Craig spent 9 years at Amazon. Most recently, as the founding General Manager of Amazon SageMaker, AWS’ machine learning platform. Previous to AWS, he led pricing and analytics for Fulfillment By Amazon. Craig has a deep belief in democratizing the power of data. He pushes to improve the tooling for experienced users while also seeking to simplify it for the growing set of less experienced users. Outside of work he enjoys spending time with his family, and spending time on his bike.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/linkedinpic_1745610410485001pKXW.jpg?h=fbf7a813&itok=4P8nlz2G","alt":"Craig Wiley"}},{"name":"Nicolas Pelaez","company":null,"job_title":"Staff Technical Marketing","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/traditional-ml-scale-implementing-classical-techniques-databricks","alias":"\/data-ai-summit-2025\/session\/traditional-ml-scale-implementing-classical-techniques-databricks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535492+00:00"}
{"id":"D25B3076","title":"Transforming Title Insurance With Databricks Batch Inference","description":"<p>Join us as we explore how First American Data & Analytics, a leading property-centric information provider, revolutionized its data extraction processes using batch inference on the Databricks Platform. Discover how it overcame the challenges of extracting data from millions of historical title policy images and reduced project timelines by 75%.<\/p><p> <\/p><p>Learn how First American optimized its data processing capabilities, reduced costs by 70% and enhanced the efficiency of its title insurance processes, ultimately improving the home-buying experience for buyers, sellers and lenders. This session will delve into the strategic integration of AI technologies, highlighting the power of collaboration and innovation in transforming complex data challenges into scalable solutions.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Financial Services"],"category":["MLFlow, Mosaic AI, Unity Catalog"],"areas_of_interest":["AI Agents, Data Intelligence, Generative AI (LLMs)"],"delivery":["In Person"],"speakers":[{"name":"Prabhaker Narsina","company":"First American Financial Corporation","job_title":"VP, Data and AI","bio":null,"image":{}},{"name":"Prabhu Madhu Kolli","company":"First American","job_title":"Sr Director AI","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/transforming-title-insurance-databricks-batch-inference","alias":"\/data-ai-summit-2025\/session\/transforming-title-insurance-databricks-batch-inference","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535524+00:00"}
{"id":"D25B3298DBX","title":"Unlocking Quality, Scale and Cost-Efficient Retrieval With Mosaic AI Vector Search","description":"<p>Mosaic AI Vector Search is powering high-accuracy retrieval systems in production across a wide range of use cases — including RAG applications, entity resolution, recommendation systems and search. Fully integrated with the Databricks Data Intelligence Platform, it eliminates pipeline maintenance by automatically syncing data from source to index. Over the past year, customers have asked for greater scale, better quality out-of-the-box and cost-efficient performance. This session delivers on those needs — showcasing best practices for implementing high-quality retrieval systems and revealing major product advancements that improve scalability, efficiency and relevance.<\/p><p> <\/p><p>What you’ll learn:<\/p><ul>\t<li>How to optimize Vector Search with hybrid retrieval and reranking for better out-of-the-box results<\/li>\t<li>Best practices for managing vector indexes with minimal operational overhead<\/li>\t<li>Real-world examples of how organizations have scaled and improved their search and recommendation systems<\/li><\/ul>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Ankit Vij","company":"Databricks","job_title":"Senior Software Engineer","bio":"Ankit is a Software Engineer at Databricks with a deep interest in information retrieval and machine learning. He is the founding engineer on the vector search team and has been working in the search domain for over 7 years. Ankit holds a Master's degree in Computer Science from the University of Wisconsin-Madison.","image":{}},{"name":"Adam Gurary","company":"Databricks","job_title":"Product Manager","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/unlocking-quality-scale-and-cost-efficient-retrieval-mosaic-ai-vector","alias":"\/data-ai-summit-2025\/session\/unlocking-quality-scale-and-cost-efficient-retrieval-mosaic-ai-vector","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535716+00:00"}
{"id":"D25B1266","title":"Use External Models in Databricks: Connecting to Azure, AWS, GCP, Anthropic and More","description":"<p>In this session you will learn how to leverage a wide set of GenAI models in Databricks, including external connections to cloud vendors and other model providers. We will cover establishing connection to externally served models, via Mosaic AI Gateway. This will showcase connection to Azure, AWS & GCP models, as well as model vendors like Anthropic, Cohere, AI21 Labs and more. You will also discover best practices on model comparison, governance and cost control on those model deployments.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Llama, Mosaic AI"],"areas_of_interest":["AI Agents, Generative AI (LLMs), ML\/LLMOps"],"delivery":["In Person"],"speakers":[{"name":"Ina Koleva","company":"Databricks","job_title":"Product Manager","bio":"Ina Koleva is a part of the Product team at Databricks working on the GenAI stack of services.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/profile-photo_1744813660814001GMM4.png?h=a7e6d17b&itok=TIkXe4PG","alt":"Ina Koleva"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/use-external-models-databricks-connecting-azure-aws-gcp-anthropic-and","alias":"\/data-ai-summit-2025\/session\/use-external-models-databricks-connecting-azure-aws-gcp-anthropic-and","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535740+00:00"}
{"id":"D25B3294DBX","title":"Using AI Runtimes for Model Training and Development on Databricks","description":"<p>Tired of managing complex GPU infrastructure for AI projects? Join us to discover how Databricks' AI Runtime simplifies GPU-accelerated model development with a serverless experience. Learn how the Machine Learning Runtime provides access to pre-configured GPU environments with popular ML frameworks and optimizations for unmatched performance.<\/p><p> <\/p><p>Key takeaways:<\/p><ul>\t<li>Deploying models to serverless GPUs with automatically prepared containers including necessary libraries<\/li>\t<li>Selecting optimal GPU configurations for different workloads<\/li>\t<li>Managing costs through automatic scaling based on demand<\/li>\t<li>Utilizing pre-configured drivers for popular frameworks like TensorFlow and PyTorch<\/li>\t<li>Achieving 3–5x performance improvements through built-in optimizations<\/li><\/ul><p> <\/p><p>Whether training custom models or fine-tuning foundation models, learn to focus on building AI solutions rather than managing infrastructure.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["MLFlow, Mosaic AI"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Tejas Sundaresan","company":null,"job_title":null,"bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/using-ai-runtimes-model-training-and-development-databricks","alias":"\/data-ai-summit-2025\/session\/using-ai-runtimes-model-training-and-development-databricks","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535744+00:00"}
{"id":"D25B1270","title":"When AI Helps Saving Lives","description":"<p>AI is set to revolutionize healthcare by enhancing diagnostic accuracy, optimising treatment protocols and improving response times in time-critical medical emergencies. As a world leader in this field, Laerdal Medical is continuously working to develop innovative solutions for training and equipment enabling healthcare workers and community responders to provide the best possible care. All to support our overall mission of \"Helping save one million more lives every year from 2030\".<\/p><p> <\/p><p>From the RevivR app, using AI to enable mobile-based and self-paced CPR training, to LiveBorn using ambient intelligence to reduce neonatal mortality and a new set of AI agents that will make sure we can reach our mission goal.<\/p><p> <\/p><p>In this presentation we will show how Laerdal is using AI and data to develop this new generation of innovative healthcare products, as well as how we work with partners and solutions like Databricks and MosaicML to make the development and operations of these AI tools efficient.<\/p>","track":"Artificial Intelligence","level":"Intermediate","type":"Breakout","industry":["Health and Life Sciences"],"category":["MLFlow, AI\/BI, Mosaic AI"],"areas_of_interest":["AI Agents, Data Science, Machine Learning"],"delivery":["In Person"],"speakers":[{"name":"Alexander Dahl","company":"Laerdal Medical","job_title":null,"bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/when-ai-helps-saving-lives","alias":"\/data-ai-summit-2025\/session\/when-ai-helps-saving-lives","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535808+00:00"}
{"id":"D25S3199","title":"Women in Data + AI ","description":"Don't miss this enlightening panel discussion featuring remarkable women in the data and AI field. This event aims to celebrate their outstanding contributions and accomplishments while providing valuable insights into the evolving landscape of data and AI. Our distinguished panelists will delve into their personal stories, shedding light on their journey to success and the pivotal role they play in shaping the industry. ","track":"Artificial Intelligence","level":"Beginner","type":"Special Interest","industry":["Professional Services"],"category":["AI\/BI"],"areas_of_interest":["Thought Leadership"],"delivery":["In Person"],"speakers":[],"day":"Wednesday","room":"Marriott, Lower B2,  Yerba Buena Salon 9","starts":"2025-06-11T22:00:00","ends":"2025-06-12T00:30:00","starts_pst":"2025-06-11T15:00:00","ends_pst":"2025-06-11T17:30:00","start_time":"10:00 pm","end_time":"12:30 am","pst_start_time":"3:00 pm","pst_end_time":"5:30 pm","duration":"150","path":"\/session\/women-data-ai","alias":"\/data-ai-summit-2025\/session\/women-data-ai","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535815+00:00"}
