{"id":"D25L1586","title":"Breaking Silos: Cigna’s Journey to Seamless Data Sharing with Delta Sharing","description":"<p>As data ecosystems grow increasingly complex, the ability to share data securely, seamlessly, and in real time has become a strategic differentiator. In this session, Cigna will showcase how Delta Sharing on Databricks has enabled them to modernize data delivery, reduce operational overhead, and unlock new market opportunities.<\/p><p> <\/p><p>Learn how Cigna achieved significant savings by streamlining operations, compute, and platform overhead for just one use case. Explore how decentralizing data ownership—transitioning from hyper-centralized teams to empowered product owners—has simplified delivery and accelerated innovation. Most importantly, see how this modern open data-sharing framework has positioned Cigna to win contracts they previously couldn’t, by enabling real-time, cross-organizational data collaboration with external partners.<\/p><p> <\/p><p>Join us to hear how Cigna is using Delta Sharing not just as a technical enabler, but as a business catalyst.<\/p>","track":"Data Sharing and Collaboration","level":"Beginner","type":"Lightning Talk","industry":["Health and Life Sciences"],"category":["Apache Spark, Databricks SQL, Unity Catalog"],"areas_of_interest":["Collaboration, Cybersecurity, Data Applications"],"delivery":["In Person"],"speakers":[{"name":"Jay Ehlen","company":"Evernorth Health Services","job_title":"Senior Director","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/breaking-silos-cignas-journey-seamless-data-sharing-delta-sharing","alias":"\/data-ai-summit-2025\/session\/breaking-silos-cignas-journey-seamless-data-sharing-delta-sharing","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533845+00:00"}
{"id":"D25B3281DBX","title":"Breaking Silos: Using the SAP Delta Sharing Connector for Seamless Access in Databricks","description":"<p>We’re excited to announce the General Availability of the SAP Delta Sharing Connector, enabling SAP Business Data Cloud (BDC) customers to securely and seamlessly share data with Databricks — no complex ETL or data duplication required. This connector enables organizations to securely share SAP data for analytics and AI in Databricks, while also supporting bidirectional data sharing back to SAP.<\/p><p> <\/p><p>In this session, we’ll walk through a live demo of the SAP Delta Sharing Connector in action, followed by a real-world customer story showcasing how this integration is driving value across analytics and AI use cases. You’ll also leave with practical best practices to help you implement the connector in your own environment.<\/p><p> <\/p><p>Whether you’re looking to bring SAP data into Databricks for advanced analytics or build AI models on top of trusted SAP datasets, this session will show you how to get started — securely and efficiently.<\/p>","track":"Data Sharing and Collaboration","level":"Beginner","type":"Breakout","industry":["Manufacturing, Retail and CPG - Food, Financial Services"],"category":["Delta Sharing"],"areas_of_interest":["Collaboration, Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Darshana Sivakumar","company":"Databricks","job_title":"Staff Product Manager","bio":"Darshana is a Product Manager on the Marketplace and Lakehouse Collaboration team at Databricks. She is passionate about helping organizations propel innovation through data and AI. Prior to Databricks, she spent some years at HashiCorp, building Vault. Before that, she was at AWS for a few years, where she helped launch brand new analytics services such as AWS Glue and Amazon Athena.","image":{}},{"name":"Benjamin Mathew","company":"Databricks","job_title":"Product Manager","bio":"Ben is a product manager on Databricks' Growth team, making data and AI accessible to new markets and users. He helps drive product management for the SAP-Databricks partnership and Databricks \"SaaS\".","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/BenPFP_1745608638261001pHvX.jpg?h=35a90d7f&itok=48LM6XSs","alt":"Benjamin Mathew"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/breaking-silos-using-sap-delta-sharing-connector-seamless-access","alias":"\/data-ai-summit-2025\/session\/breaking-silos-using-sap-delta-sharing-connector-seamless-access","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533852+00:00"}
{"id":"D25B3088","title":"Collaborative Innovation: How to Spur Innovation While Driving Efficiency","description":"Collaboration is redefining efficiency in insurance. This session explores how technologies such as Databricks Delta Sharing, secure data clean rooms, and data marketplaces are empowering insurers to securely share and analyze data across organizational boundaries—without exposing sensitive information. Discover how these solutions streamline operations, enhance risk modeling with real-time data integration, and enable the creation of tailored products through multi-party collaboration. Learn how insurers are leveraging these collaborative data ecosystems to reduce costs, drive innovation, and deliver better customer outcomes, all while maintaining strong privacy and governance standards. Join us to see how embracing collaborative frameworks is helping insurers operate smarter, faster, and more efficiently.","track":"Data Sharing and Collaboration","level":"Beginner","type":"Breakout","industry":["Financial Services"],"category":["Delta Sharing"],"areas_of_interest":["Data Intelligence, Thought Leadership, Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Antoine Amend","company":"Databricks","job_title":"Financial Services Industry Director","bio":null,"image":{}},{"name":"Anthony Meyers","company":"Aon","job_title":"Managing Director","bio":null,"image":{}},{"name":"Priyanka Kapoor","company":"Everest","job_title":"Head of Advanced Engineering","bio":null,"image":{}},{"name":"Paul McComish","company":"LV=","job_title":"Senior Data Engineering Manager","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/collaborative-innovation-how-spur-innovation-while-driving-efficiency","alias":"\/data-ai-summit-2025\/session\/collaborative-innovation-how-spur-innovation-while-driving-efficiency","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.533965+00:00"}
{"id":"D25B1101","title":"Cross-Cloud Data Mesh with Delta Sharing and UniForm in Mercedes-Benz","description":"<p>In this presentation, we'll show how we achieved a unified development experience for teams working on Mercedes-Benz Data Platforms in AWS and Azure.<\/p><p> <\/p><p>We will demonstrate how we implemented Azure to AWS and AWS to Azure data product sharing (using Delta Sharing and Cloud Tokens), integration with AWS Glue Iceberg tables through UniForm and automation to drive everything using Azure DevOps Pipelines and DABs. <\/p><p> <\/p><p>We will also show how to monitor and track cloud egress costs and how we present a consolidated view of all the data products and relevant cost information.<\/p><p> <\/p><p>The end goal is to show how customers can offer the same user experience to their engineers and not have to worry about which cloud or region the Data Product lives in. Instead, they can enroll in the data product through self-service and have it available to them in minutes, regardless of where it originates.<\/p>","track":"Data Sharing and Collaboration","level":"Intermediate","type":"Breakout","industry":["Manufacturing"],"category":["Delta Lake, Apache Iceberg, Delta Sharing"],"areas_of_interest":["Catalogs, Data Applications, Developer Experience"],"delivery":["In Person"],"speakers":[{"name":"Aleksandar Dragojevic","company":"Databricks","job_title":"Sr. Resident Solutions Architect","bio":"Aleksandar is a Resident Solutions Architect at Databricks with more than a decade of software-engineering and technical-leadership experience. They specialize in architecting and delivering high-performance, scalable systems that remain elegant and easy to reason about. At Databricks, Aleksandar partners with enterprise customers worldwide to design, deploy, and operate cloud-native data platforms at massive scale, helping organizations unlock actionable insights and accelerate innovation.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/1517589703084_1745565944250001VIPO.png?h=a7e6d17b&itok=Q2pLCepV","alt":"Aleksandar Dragojevic"}},{"name":"Alexander Summa","company":"Mercedes-Benz Group AG","job_title":"Lead Architect","bio":"After completing his PhD in physics, Alexander Summa worked as a research associate at the Max Planck Institute for Astrophysics in Garching, where he studied stellar explosions by performing large-scale simulations on European supercomputers. In 2017, he joined Mercedes-Benz as a Senior Data Scientist, implementing data and AI use cases for various business units across the organization. He supported the development of the big data and analytics platform for Mercedes in Azure as a solution and data architect. In his current role as Lead Architect, he is responsible for the internal data sharing platform and the multi-cloud Databricks setup at Mercedes-Benz.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/alsumma_1745699349129001at9i.jpg?h=2633ca57&itok=NFkZvFmR","alt":"Alexander Summa"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/cross-cloud-data-mesh-delta-sharing-and-uniform-mercedes-benz","alias":"\/data-ai-summit-2025\/session\/cross-cloud-data-mesh-delta-sharing-and-uniform-mercedes-benz","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534003+00:00"}
{"id":"D25L2540","title":"Data Monetization Through Delta Sharing and Data Clean Rooms","description":"<p>Deep Sync, a leader in deterministic identity solutions, leverages the Databricks Lakehouse to manage an identity spine containing the most accurate and up-to-date attribute data for over 98% of U.S. households. In partnership with T-Mobile, Deep Sync is building a Data as a Service (DaaS) business on Databricks, enabling the use of consented subscriber data to create hyper-personalized experiences, measure marketing impact and more. This collaboration represents the first time T-Mobile’s consented data will be brought to market. The technical presentation, jointly delivered by Deep Sync and T-Mobile, will showcase the Databricks solutions powering this initiative, including Lakehouse (DBSQL, GenieRooms), Unity Catalog, Delta Sharing and multi-party Data Clean Rooms. The session will focus on Databricks solutions used to enable management, governance, security and collaboration between T-Mobile, Deep Sync and third-party customers.<\/p>","track":"Data Sharing and Collaboration","level":"Intermediate","type":"Lightning Talk","industry":["Enterprise Technology, Media and Entertainment, Retail and CPG - Food"],"category":["Databricks SQL, Delta Sharing, Unity Catalog"],"areas_of_interest":["Collaboration, Data Applications, Marketing, Telecommunications"],"delivery":["In Person"],"speakers":[{"name":"Paul Turner","company":"Deep Sync","job_title":null,"bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/data-monetization-through-delta-sharing-and-data-clean-rooms","alias":"\/data-ai-summit-2025\/session\/data-monetization-through-delta-sharing-and-data-clean-rooms","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534050+00:00"}
{"id":"D25L3398","title":"Delta Sharing Demystified: Options, Use Cases and How it Works","description":"<p>Data sharing doesn’t have to be complicated. In this session, we’ll take a practical look at Delta Sharing in Databricks — what it is, how it works and how it fits into your organization’s data ecosystem.<\/p><p> <\/p><p>The focus will be on giving an overview of the different ways to share data using Databricks, from direct sharing setups to broader distribution via the Databricks Marketplace and more collaborative approaches like Clean Rooms.<\/p><p> <\/p><p>This talk is meant for anyone curious about modern, secure data sharing — whether you're just getting started or looking to expand your use of Databricks. Attendees will walk away with a clearer picture of what’s possible, what’s required to get started and how to choose the right sharing method for the right scenario.<\/p>","track":"Data Sharing and Collaboration","level":"Intermediate","type":"Lightning Talk","industry":["Enterprise Technology"],"category":["Delta Sharing, Unity Catalog"],"areas_of_interest":["Collaboration"],"delivery":["In Person"],"speakers":[{"name":"Julia Førde","company":"Amesto Nextbride","job_title":"Senior Business Analyst Consultant","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/delta-sharing-demystified-options-use-cases-and-how-it-works","alias":"\/data-ai-summit-2025\/session\/delta-sharing-demystified-options-use-cases-and-how-it-works","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534144+00:00"}
{"id":"D25B3266DBX","title":"Delta Sharing in Action: Architecture and Best Practices","description":"<p>Delta Sharing is revolutionizing how enterprises share live data and AI assets securely, openly and at scale. As the industry’s first open data-sharing protocol, it empowers organizations to collaborate seamlessly across platforms and with any partner, whether inside or outside the Databricks ecosystem.<\/p><p> <\/p><p>In this deep-dive session, you’ll learn best practices and real-world use cases that show how Delta Sharing helps accelerate collaboration and fuel AI-driven innovation.<\/p><p> <\/p><p>We’ll also unveil the latest advancements, including:<\/p><ul>\t<li>Managed network configurations for easier, secure setup<\/li>\t<li>OIDC identity federation for trusted, open sharing<\/li>\t<li>Expanded asset types including dynamic views, materialized views, federated tables, read clones and more<\/li><\/ul><p> <\/p><p>Whether you’re a data engineer, architect, or data leader, you’ll leave with practical strategies to future-proof your data-sharing architecture. Don’t miss the live demos, expert guidance and an exclusive look at what’s next in data collaboration.<\/p>","track":"Data Sharing and Collaboration","level":"Intermediate","type":"Breakout","industry":["Health and Life Sciences, Retail and CPG - Food, Financial Services"],"category":["Delta Sharing, Unity Catalog"],"areas_of_interest":["Collaboration, Databricks Experience (DBX), Open Source"],"delivery":["In Person"],"speakers":[{"name":"Mengxi Chen","company":"Databricks","job_title":"Engineering Manager","bio":"Mengxi Chen is an Engineering Manager at Databricks for the Marketplace teams, leading the engineering team who is building the Databricks Marketplace from ground up. Prior to Databricks, Mengxi worked at Tableau for 6 years as software engineer and later manager building the Tableau Prep through its V1. He is passionate about data, analytics, engineering and building new products to solve different kinds of data problems people face. He lives in Bellevue, Washington.","image":{}},{"name":"Darshana Sivakumar","company":"Databricks","job_title":"Staff Product Manager","bio":"Darshana is a Product Manager on the Marketplace and Lakehouse Collaboration team at Databricks. She is passionate about helping organizations propel innovation through data and AI. Prior to Databricks, she spent some years at HashiCorp, building Vault. Before that, she was at AWS for a few years, where she helped launch brand new analytics services such as AWS Glue and Amazon Athena.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/delta-sharing-action-architecture-and-best-practices","alias":"\/data-ai-summit-2025\/session\/delta-sharing-action-architecture-and-best-practices","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534147+00:00"}
{"id":"D25L2305","title":"Empowering Data Collaboration Using Delta Sharing","description":"<p>At Procore, we're transforming the construction industry through innovative data solutions. This session unveils how we've supercharged our analytics offerings using a unified lakehouse architecture and Delta Sharing, delivering game-changing results for our customers and our business and how data professionals can unlock the full potential of their data assets and drive meaningful business outcomes. <\/p><p> <\/p><p>Key highlights:<\/p><ul>\t<li>Learn how we've implemented seamless, secure sharing of large datasets across various BI tools and programming languages, dramatically accelerating time-to-insights for our customers<\/li>\t<li>Discover our approach to sharing dynamically filtered subsets of data across our numerous customers with cross-platform view sharing<\/li>\t<li>We'll demonstrate how our architecture has eliminated the need for data replication, fostering a more efficient, collaborative data ecosystem<\/li><\/ul>","track":"Data Sharing and Collaboration","level":"Intermediate","type":"Lightning Talk","industry":["Enterprise Technology, Manufacturing"],"category":["Apache Spark, Delta Lake, Delta Sharing"],"areas_of_interest":["Collaboration, Customer Data Platform, Data Applications"],"delivery":["In Person"],"speakers":[{"name":"vishnu sreenivasan","company":"Procore","job_title":"Staff Data Engineer","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/empowering-data-collaboration-using-delta-sharing","alias":"\/data-ai-summit-2025\/session\/empowering-data-collaboration-using-delta-sharing","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534225+00:00"}
{"id":"D25B2524","title":"Enabling Sleep Science Research With Databricks and Delta Sharing","description":"<p>Leveraging Databricks as a platform, we facilitate the sharing of anonymized datasets across various Databricks workspaces and accounts, spanning multiple cloud environments such as AWS, Azure, and GCP. This capability, powered by Delta Sharing, extends both within and outside Sleep Number, enabling accelerated insights while ensuring compliance with data security and privacy standards.<\/p><p> <\/p><p>In this session, we will showcase our architecture and implementation strategy for data sharing, highlighting the use of Databricks’ Unity Catalog and Delta Sharing, along with integration with platforms like Jira, Jenkins, and Terraform to streamline project management and system orchestration.<\/p>","track":"Data Sharing and Collaboration","level":"Intermediate","type":"Breakout","industry":["Health and Life Sciences, Manufacturing, Retail and CPG - Food"],"category":["Delta Sharing, Unity Catalog"],"areas_of_interest":["Collaboration, Developer Experience, Security & Compliance"],"delivery":["In Person"],"speakers":[{"name":"Alexandr Rivlin","company":"Sleep Number Labs","job_title":"Director, Data Platform","bio":null,"image":{}},{"name":"Sajeev Mayandi","company":"Sleep Number","job_title":"Sr Director Architecture & Data Platform","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/enabling-sleep-science-research-databricks-and-delta-sharing","alias":"\/data-ai-summit-2025\/session\/enabling-sleep-science-research-databricks-and-delta-sharing","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534242+00:00"}
{"id":"D25B2336","title":"FactSet in Collaboration with a Leading Customer: Harnessing Delta Sharing for Accelerated Insights","description":"<p>Integrating external vendor data often means facing fragmented pipelines, costly ETL, and lengthy onboarding cycles. Join us to learn how a customer partnered with FactSet, using Delta Sharing to break through these barriers and significantly elevate their analytics capabilities.<\/p><p> <\/p><p>Why Attend?<\/p><ul>\t<li>Efficiency gains: see how onboarding delays, redundant engineering tasks, and inefficiencies in sharing data across teams were resolved<\/li>\t<li>Real solutions: uncover how Delta Sharing and powerful analytics capabilities transform workflows, reducing complex tasks from days to minutes<\/li>\t<li>Valuable outcomes: learn about simplified data pipelines, accelerated insights, and faster onboarding achieved through curated notebooks<\/li><\/ul><p> <\/p><p>We'll explore how your organization can overcome similar challenges and set the stage for future innovation. Discover practical ways to enhance your data capabilities, advance strategic initiatives, and achieve faster insights with seamless integration of FactSet data on Databricks.<\/p>","track":"Data Sharing and Collaboration","level":"Intermediate","type":"Breakout","industry":["Financial Services"],"category":["Databricks Workflows, Delta Sharing, Unity Catalog"],"areas_of_interest":["Collaboration, Data Applications, ETL"],"delivery":["In Person"],"speakers":[{"name":"Kristen Clark","company":"Factset","job_title":"VP, Principal Product Manager","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/factset-collaboration-leading-customer-harnessing-delta-sharing","alias":"\/data-ai-summit-2025\/session\/factset-collaboration-leading-customer-harnessing-delta-sharing","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534285+00:00"}
{"id":"D25B2739","title":"From News to Insights: Unlock Actionable Outcomes With LSEG’s Machine Readable News and DeltaSharing","description":"<p>In today’s fast-paced business environment, access to comprehensive, credible, real-time and historical data in one place is essential for effective decision-making and risk management. LSEG’s Machine Readable News (MRN) solution transforms unstructured data into actionable insights, with ultra-low latency delivery and extensive historical news archives powered by AI and natural language processing (NLP). Leveraging Databricks Delta Sharing, businesses can seamlessly integrate this valuable data with their own internal datasets, additional LSEG data and third-party sources. This combination enables clients to optimize workflows, enhance risk models and make smarter, faster decisions across diverse use cases — from event-based trading to risk management. <\/p><p> <\/p><p>In this session, we’ll explore how Delta Sharing facilitates the integration of diverse, trustworthy data, unlocking new opportunities and driving smarter investment strategies.<\/p>","track":"Data Sharing and Collaboration","level":"Intermediate","type":"Breakout","industry":["Financial Services"],"category":["Delta Sharing, Mosaic AI, Unity Catalog"],"areas_of_interest":["Data Science, Generative AI (LLMs), Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Naftali Cohen","company":"LSEG","job_title":"Global Head of Cloud Partners","bio":"Naftali Cohen is the Global Head of Partner Cloud Strategy at LSEG. In this role, he is responsible for developing and implementing partner strategies to drive growth and profitability across the LSEG organization. Mr. Cohen joined LSEG in 2022 through the acquisition of MayStreet, where he served as Chief Revenue Officer. Before his time at MayStreet, Naftali was an early founder of LiquidityBook, holding the positions of Partner and Director of Operations. Prior to that, he worked as a Data Analyst at Kearney. Naftali holds a B.A. in Philosophy, Politics, and Economics from Hebrew University and a Post Baccalaureate in Business from Columbia University.","image":{}},{"name":"Simon Gauld","company":"LSEG","job_title":"Director, Data Distribution","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/news-insights-unlock-actionable-outcomes-lsegs-machine-readable-news","alias":"\/data-ai-summit-2025\/session\/news-insights-unlock-actionable-outcomes-lsegs-machine-readable-news","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534334+00:00"}
{"id":"D25B1674","title":"How Danone Enhanced Global Data Sharing with Delta Sharing","description":"<p>Learn how Danone, a global leader in the food industry, improved its data-sharing processes using Delta Sharing, an open protocol developed by Databricks. This session will explore how Danone migrated from a traditional hub-and-spoke model to a more efficient and scalable data-sharing approach that works seamlessly across regions and platforms.<\/p><p> <\/p><p>We’ll discuss practical concepts such as in-region and cross-region data sharing, fine-grained access control, data discovery, and the implementation of data contracts. You’ll also hear about the strategies Danone uses to deliver governed data efficiently while maintaining compliance with global regulations. Additionally, we’ll discuss a cost comparison between direct data access and replication.<\/p><p> <\/p><p>Finally, we’ll share insights into the challenges faced by global organizations in managing data sharing at scale and how Danone addressed these issues. Attendees will gain practical knowledge on building a reliable and secure data-sharing framework for international collaboration.<\/p>","track":"Data Sharing and Collaboration","level":"Intermediate","type":"Breakout","industry":["Manufacturing, Retail and CPG - Food"],"category":["Delta Sharing, Unity Catalog"],"areas_of_interest":["Catalogs, Collaboration, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"Gergő Pásztor","company":"Databricks","job_title":"Resident Solution Architect","bio":null,"image":{}},{"name":"BASELTO Yohan","company":"Danone","job_title":"Lead Data Engineer","bio":"Yohan Baselto is Lead Data Engineer for Danone's Data & AI Platform with 8+ years of experience. Yohan contributes to Danone's new enterprise data platform, designing scalable infrastructure that transforms how the company leverages its data assets.<br \/>\nHis technical expertise focuses on building robust data pipelines, implementing modern data architecture, and integrating advanced analytics capabilities across the organization. <br \/>\n<br \/>\nAdditionally, Yohan leads Danone's Global Data Engineering Community, fostering best practices and methodologies. His work enables stakeholders to derive actionable insights and drives the company's data-driven transformation initiatives.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Photo_Come_BARDON_3938%2520LINKEDIN_1745847183509001WjUH.jpg?h=1e66e246&itok=SMZZhRLf","alt":"BASELTO Yohan"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/how-danone-enhanced-global-data-sharing-delta-sharing","alias":"\/data-ai-summit-2025\/session\/how-danone-enhanced-global-data-sharing-delta-sharing","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534463+00:00"}
{"id":"D25B3107","title":"How Data Sharing is Transforming Healthcare: Real World Insights","description":"In today’s rapidly evolving healthcare landscape, the ability to securely and efficiently share data is critical to driving better patient outcomes, operational efficiencies, and groundbreaking research. In this session, Komodo Health will explore how Delta sharing unlocks new opportunities across the life sciences ecosystem, with de-identified longitudinal patient data without compromising patient privacy. We will share insights into customers' experiences leveraging de-identified patient data to reduce the burden of disease while improving the overall patient experience. Attendees will learn practical approaches to compliantly share data in life sciences.","track":"Data Sharing and Collaboration","level":"Beginner","type":"Breakout","industry":["Health and Life Sciences"],"category":["Data Marketplace, Delta Sharing"],"areas_of_interest":["Collaboration, Data Intelligence, Thought Leadership"],"delivery":["In Person"],"speakers":[{"name":"John Wollman","company":"Komodo Health","job_title":"Head of Revenue Strategy","bio":"With over 38 years of executive leadership in Life Sciences and Healthcare across consulting, data, and software, John Wollman brings a rare blend of strategic vision, technical expertise, and entrepreneurial success. He has played a pivotal role in growing and selling multiple companies and is currently the Head of Revenue Strategy and fast-growing Komodo Health.<br \/>\n<br \/>\nIn addition to his professional accomplishments, John is an active angel investor and board member, contributing to the growth of businesses and creative ventures alike. He has produced and acted in several independent films. John’s passions span filmmaking, martial arts, philanthropy, and fostering innovation at the intersection of health and technology.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Wollman%2520Headshot_1744832947600001UrFZ.png?h=44460c36&itok=WXNi2txb","alt":"John Wollman"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/how-data-sharing-transforming-healthcare-real-world-insights","alias":"\/data-ai-summit-2025\/session\/how-data-sharing-transforming-healthcare-real-world-insights","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534467+00:00"}
{"id":"D25B1198","title":"How HP Is Optimizing the 3D Printing Supply Chain Using Delta Sharing","description":"<p>HP’s 3D Print division empowers manufacturers with telemetry data to optimize operations and streamline maintenance. Using Delta Sharing, Unity Catalog and AI\/BI dashboards, HP provides a secure, scalable solution for data sharing and analytics.<\/p><p> <\/p><p>Delta Sharing D2O enables seamless data access, even for customers not on Databricks. Apigee masks private URLs, and Unity Catalog enhances security by managing data assets. Predictive maintenance with Mosaic AI boosts uptime by identifying issues early and alerting support teams.<\/p><p> <\/p><p>Custom dashboards and sample code let customers run analytics using any supported client, while Apigee simplifies access by abstracting complexity. Insights from A\/BI dashboards help HP refines data strategy, aligning solutions with customer needs despite the complexity of diverse technologies, fragmented systems and customer-specific requirements. This fosters trust, drives innovation,and strengthens HP as a trusted partner for scalable, secure data solutions. <\/p>","track":"Data Sharing and Collaboration","level":"Intermediate","type":"Breakout","industry":["Manufacturing"],"category":["AI\/BI, Delta Sharing, Unity Catalog"],"areas_of_interest":["Catalogs, Collaboration, Data Applications"],"delivery":["In Person"],"speakers":[{"name":"javier.lagares javier.lagares","company":"HP","job_title":"Principal Data Engineer","bio":"Experienced Principal Engineer with over 20 years of expertise in data engineering, IoT, and software solutions, specializing in Databricks, cloud platforms, and digital transformation. Proven track record in leading global teams, optimizing data architectures, and delivering scalable solutions.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Javier_Lagares_1745937930570001zThn.png?h=57024e64&itok=Mk8M-iJV","alt":"javier.lagares javier.lagares"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/how-hp-optimizing-3d-printing-supply-chain-using-delta-sharing","alias":"\/data-ai-summit-2025\/session\/how-hp-optimizing-3d-printing-supply-chain-using-delta-sharing","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534487+00:00"}
{"id":"D25B2904","title":"How mParticle & EasyJet Unlock Advanced Personalization With Delta Sharing & Databricks Marketplace","description":"<p>This presentation highlights how EasyJet leverages Delta Sharing to enable secure and frictionless data sharing with mParticle. By utilizing Delta Sharing, EasyJet leverages mParticle’s customer data platform (CDP), available on Databricks Marketplace, without data duplication, enhancing audience segmentation and personalization strategies. The integration empowers EasyJet to streamline its data sharing workflows while maintaining robust governance and compliance, fostering advanced customer personalization and operational efficiency across platforms<\/p>","track":"Data Sharing and Collaboration","level":"Intermediate","type":"Breakout","industry":["Travel and Hospitality"],"category":["Databricks SQL, Delta Sharing"],"areas_of_interest":["Collaboration, Customer Data Platform, Streaming pipelines, Marketing"],"delivery":["In Person"],"speakers":[{"name":"Shiv Nayak","company":"easyjet","job_title":"Head of Data Architecture","bio":null,"image":{}},{"name":"Russel Woodward","company":"easyJet","job_title":"Head of customer data","bio":"Head of customer data at easyJet","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/how-mparticle-easyjet-unlock-advanced-personalization-delta-sharing","alias":"\/data-ai-summit-2025\/session\/how-mparticle-easyjet-unlock-advanced-personalization-delta-sharing","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534490+00:00"}
{"id":"D25B2556","title":"Intuit's Privacy-Safe Lending Marketplace: Leveraging Databricks Clean Rooms","description":"<p>Intuit leverages Databricks Clean Rooms to create a secure, privacy-safe lending marketplace, enabling small business lending partners to perform analytics and deploy ML\/AI workflows on sensitive data assets.<\/p><p> <\/p><p>This session explores the technical foundations of building isolated clean rooms across multiple partners and cloud providers, differentiating Databricks Clean Rooms from market alternatives. We'll demonstrate our automated approach to clean room lifecycle management using APIs, covering creation, collaborator onboarding, data asset sharing, workflow orchestration and activity auditing. The integration with Unity Catalog for managing clean room inputs and outputs will also be discussed.<\/p><p> <\/p><p>Attendees will gain insights into harnessing collaborative ML\/AI potential, support various languages and workloads, and enable complex computations without compromising sensitive information in Clean Rooms.<\/p>","track":"Data Sharing and Collaboration","level":"Intermediate","type":"Breakout","industry":["Financial Services"],"category":["Delta Sharing, Unity Catalog"],"areas_of_interest":["Collaboration, Data Applications, Security & Compliance"],"delivery":["In Person"],"speakers":[{"name":"Anurag Malik","company":"Intuit Inc.","job_title":"Staff Software Engineer","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/intuits-privacy-safe-lending-marketplace-leveraging-databricks-clean","alias":"\/data-ai-summit-2025\/session\/intuits-privacy-safe-lending-marketplace-leveraging-databricks-clean","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534614+00:00"}
{"id":"D25B3114","title":"Let’s Elevate: An Open Source Model for Data Sharing and Collaboration in Retail and Consumer Goods","description":"<p>Retailers and suppliers face persistent financial and technical challenges to data sharing — including expensive proprietary platforms, complex data integration hurdles, fragmented governance and more — which currently restrict seamless data exchange primarily to their largest trading partners.<\/p><p> <\/p><p>In this session, we’ll provide an in-depth explanation of Elevate, an industry alliance focused on building open source standards for data sharing and collaboration to drive greater efficiency across the entire ecosystem. This session will highlight proposed standards for data sharing, data models, business cases on the ROI and potential areas of innovation to democratize data sharing, drastically reduce costs, simplify integration processes and foster transparent, trusted collaboration.<\/p><p> <\/p><p>Learn about the Elevate industry data-sharing initiative and how your company can participate and help guide standards to improve data sharing with your key partners.<\/p>","track":"Data Sharing and Collaboration","level":"Beginner","type":"Breakout","industry":["Retail and CPG - Food"],"category":["Data Marketplace, Delta Sharing"],"areas_of_interest":["Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Rob Saker","company":"Databricks","job_title":"Global VP | Consumer Industries GTM","bio":null,"image":{}},{"name":"Sabrina Miller","company":"Databricks","job_title":"Director of Value Acceleration","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/lets-elevate-open-source-model-data-sharing-and-collaboration-retail","alias":"\/data-ai-summit-2025\/session\/lets-elevate-open-source-model-data-sharing-and-collaboration-retail","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534693+00:00"}
{"id":"D25L3393","title":"No-Trust, All Value: Monetizing Analytics With Databricks Clean Rooms","description":"<p>In a world where data collaboration is essential but trust is scarce, Databricks Clean Rooms delivers a game-changing model: no data shared, all value gained. Discover how data providers can unlock new revenue streams by launching subscription-based analytics and “Built-on-Databricks” services that run on customer data — without exposing raw data or violating compliance. Clean Rooms integrates Unity Catalog’s governance, Delta Sharing’s secure exchange and serverless compute to enable true multi-party collaboration — without moving data. See how privacy-preserving models like fraud detection, clinical analytics and ad measurement become scalable, productizable and monetizable across industries. Walk away with a proven pattern to productize analytics, preserve compliance and turn trustless collaboration into recurring revenue.<\/p>","track":"Data Sharing and Collaboration","level":"Intermediate","type":"Lightning Talk","industry":["Professional Services"],"category":["Databricks Workflows, Delta Sharing, Unity Catalog"],"areas_of_interest":["Collaboration"],"delivery":["In Person"],"speakers":[{"name":"Eddie Edgeworth","company":"Koantek","job_title":"CTO","bio":"Eddie Edgeworth is Chief Technology Officer at Koantek, a four-time Databricks Partner of the Year, where he drives award-winning IP accelerators such as X2D™ and Ascend AI. A Databricks MVP, Developer Champion, and member of the Databricks Product Advisory Board, Eddie has been building on the platform since 2016.<br \/>\n<br \/>\nWith 25 years in data architecture, cloud engineering, and AI-driven productization, he has delivered lakehouse and governance solutions that slash TCO by 60 percent and accelerate value for Fortune 500 enterprises across healthcare, finance, and manufacturing. Eddie’s passion is turning complex data challenges into scalable, compliant outcomes.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Headshot_1746037877332001d8zc.png?h=7208460a&itok=XkdA-xAH","alt":"Eddie Edgeworth"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"0","path":"\/session\/no-trust-all-value-monetizing-analytics-databricks-clean-rooms","alias":"\/data-ai-summit-2025\/session\/no-trust-all-value-monetizing-analytics-databricks-clean-rooms","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.534831+00:00"}
{"id":"D25L3001","title":"Scaling Modern MDM With Databricks, Delta Sharing and Dun & Bradstreet","description":"<p>Master Data Management (MDM) is the foundation of a successful enterprise data strategy — delivering consistency, accuracy and trust across all systems that depend on reliable data. But how can organizations integrate trusted third-party data to enhance their MDM frameworks? How can they ensure that this master data is securely and efficiently shared across internal platforms and external ecosystems?<\/p><p> <\/p><p>This session explores how Dun & Bradstreet’s pre-mastered data serves as a single source of truth for customers, suppliers and vendors — reducing duplication and driving alignment across enterprise systems. With Delta Sharing, organizations can natively ingest Dun & Bradstreet data into their Databricks environment and establish a scalable, interoperable MDM framework. Delta Sharing also enables secure, real-time distribution of master data across the enterprise ensuring that every system operates from a consistent and trusted foundation.<\/p>","track":"Data Sharing and Collaboration","level":"Intermediate","type":"Lightning Talk","industry":["Financial Services"],"category":["Databricks SQL, Delta Sharing, Unity Catalog"],"areas_of_interest":["Collaboration, Data Applications, Data Intelligence"],"delivery":["In Person"],"speakers":[{"name":"Anna Krayn","company":"Dun & Bradstreet","job_title":"GM, Partnerships & Alliances","bio":"Anna Krayn is a commercial sales and strategy executive with a track record of driving double-digit growth in data, analytics, and technology businesses. She is currently GM, Partnerships & Alliances at Dun & Bradstreet, leading a team responsible for revenue generation through distribution and co-sell partners, defining strategic alliances, and developing new offerings.<br \/>\n<br \/>\nPreviously, as Senior Director, Risk & Accounting Solutions at Moody’s Analytics, Anna led teams in structuring solutions for impairment, stress testing, and capital planning. She also worked in Enterprise Risk Solutions, focusing on loss estimation and counterparty credit risk.<br \/>\n<br \/>\nBefore Moody’s, she gained experience in investment banking at Bank of America and private equity at Titan International. She holds a B.S. in Finance & International Business and an MBA from NYU Stern.","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"20","path":"\/session\/scaling-modern-mdm-databricks-delta-sharing-and-dun-bradstreet","alias":"\/data-ai-summit-2025\/session\/scaling-modern-mdm-databricks-delta-sharing-and-dun-bradstreet","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535088+00:00"}
{"id":"D25D2899","title":"Securing Data Collaboration: A Deep Dive Into Security, Frameworks, and Use Cases ","description":"<p>This session will focus on the security aspects of Databricks Delta Sharing, Databricks Cleanrooms and Databricks Marketplace, providing an exploration of how these solutions enable secure and scalable data collaboration while prioritizing privacy.<\/p><p> <\/p><p>Highlights:<\/p><ul>\t<li>Use cases — Understand how Delta Sharing facilitates governed, real-time data exchange across platforms and how Cleanrooms support multi-party analytics without exposing sensitive information<\/li>\t<li>Security internals — Dive into Delta Sharing's security frameworks<\/li>\t<li>Dynamic views — Learn about fine-grained security controls<\/li>\t<li>Privacy-first Cleanrooms — Explore how Cleanrooms enable secure analytics while maintaining strict data privacy standards<\/li>\t<li>Private exchanges — Explore the role of private exchanges using Databricks Marketplace in securely sharing custom datasets and AI models with specific partners or subsidiaries<\/li>\t<li>Network security & compliance — Review best practices for network configurations and compliance measures<\/li><\/ul>","track":"Data Sharing and Collaboration","level":"Advanced","type":"Deep Dive","industry":["Enterprise Technology, Retail and CPG - Food, Financial Services"],"category":["Data Marketplace, Delta Sharing, Unity Catalog"],"areas_of_interest":["Collaboration, Security & Compliance"],"delivery":["In Person"],"speakers":[{"name":"Bhavin Kukadia","company":"Databricks","job_title":"Work hard, have fun, make money","bio":"Work hard, have fun, make money.<br \/>\nBrickster since 2017, all things platform security","image":{}},{"name":"Bilal Obeidat","company":"Databricks","job_title":"Principal Product Specialist","bio":"Bilal Obeidat is a seasoned cloud data and AI architect with over 20 years of experience with top tech companies like Databricks, Microsoft, and Snowflake. As a Principal Product Specialist at Databricks, he is part of the Field Engineering team, focusing on Delta and collaboration products. He acts as a Subject Matter Expert (SME), co-selling with specific opportunities, enabling Direct SAs and Partners, and working closely with clients to accelerate their product adoption while sharing best practices. Bilal has a proven track record in designing and implementing large-scale, cloud-based data solutions across industries such as retail, telecom, and healthcare. ","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Bilal_headshot_jpg_1745266475764001FIhg.jpg?h=521577f2&itok=g7xJVrzb","alt":"Bilal Obeidat"}},{"name":"El Ghali Benchekroun","company":"Databricks","job_title":"Specialist Solutions Architect","bio":"El Ghali Benchekroun is a Specialist Solutions Architect at Databricks, based in Paris (France) with extensive expertise in Cloud Architecture, Security, DevOps, and MLOps. As a technology enthusiast and adaptable fast learner, El Ghali is passionate about leveraging AI to help major companies navigate complex technological transformations. His result-driven approach focuses on supporting organizations through their most critical projects and, in his own words, \"making things happen!\"","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/elghali_1745324494741001XBsY.png?h=71c6bed4&itok=SYtccaDy","alt":"El Ghali Benchekroun"}}],"day":"Wednesday","room":"South, Level 3, Room 304","starts":"2025-06-11T20:50:00","ends":"2025-06-11T22:20:00","starts_pst":"2025-06-11T13:50:00","ends_pst":"2025-06-11T15:20:00","start_time":"8:50 pm","end_time":"10:20 pm","pst_start_time":"1:50 pm","pst_end_time":"3:20 pm","duration":"90","path":"\/session\/securing-data-collaboration-deep-dive-security-frameworks-and-use-cases","alias":"\/data-ai-summit-2025\/session\/securing-data-collaboration-deep-dive-security-frameworks-and-use-cases","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535137+00:00"}
{"id":"D25B3282DBX","title":"Simplified Delta Sharing With Network Security","description":"<p>Delta Sharing enables cross-domain sharing of data assets for collaboration. A practical concern providers and recipients face in doing so is the need to manually configure network and storage firewalls. This is particularly challenging for large-scale providers and recipients with strict compliance requirements. In this talk, we will describe our solution to fully eliminate these complexities. This enhances user experience, scalability and security, facilitating seamless data collaboration across diverse environments and cloud platforms.<\/p>","track":"Data Sharing and Collaboration","level":"Intermediate","type":"Breakout","industry":["Health and Life Sciences, Retail and CPG - Food, Financial Services"],"category":["Delta Sharing, Unity Catalog"],"areas_of_interest":["Collaboration, Databricks Experience (DBX), Security & Compliance"],"delivery":["In Person"],"speakers":[{"name":"Samrat Ray","company":"Databricks","job_title":"Senior Staff Product Manager","bio":"Samrat is responsible for enterprise security for the Databricks platform including security of the serverless platform, encryption, data protection and privacy. In his previous role at Google Cloud, he has led several industry-leading products such as VPC Service Controls and Cloud SQL from concept to scale.  Samrat is a founding PM of Istio and led the vision for zero-trust security in modern production environments. ","image":{}},{"name":"Krishna Puttaswamy","company":"Databricks","job_title":"Principal Engineer","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/simplified-delta-sharing-network-security","alias":"\/data-ai-summit-2025\/session\/simplified-delta-sharing-network-security","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535194+00:00"}
{"id":"D25B3093","title":"Tech Industry Session: Building Collaborative Ecosystems With Openness and Portability","description":"<p>Join us to discover how leading tech companies accelerate growth using open ecosystems and built-on solutions to foster collaboration, accelerate innovation and create scalable data products. This session will explore how organizations use Databricks to securely share data, integrate with partners and enable teams to build impactful applications powered by AI and analytics.<\/p><p> <\/p><p>Topics include:<\/p><ul>\t<li>Using Delta Sharing for secure, real-time data collaboration across teams and partners<\/li>\t<li>Embedding analytics and creating marketplaces to extend product capabilities<\/li>\t<li>Building with open standards and governance frameworks to ensure compliance without sacrificing agility<\/li><\/ul><p> <\/p><p>Hear real-world examples of how open ecosystems empower organizations to widen the aperture on collaboration, driving better business outcomes. Walk away with insights into how open data sharing and built-on solutions can help your teams innovate faster at scale.<\/p>","track":"Data Sharing and Collaboration","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology"],"category":["Data Marketplace, Delta Sharing, Unity Catalog"],"areas_of_interest":["Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Bob Pisani","company":"Addepar","job_title":"CTO","bio":"Bob is the Chief Technology Officer at Addepar where he leads engineering, product, and design to deliver a complete, transformative technology and data platform for wealth and asset management. Prior to Addepar, Bob was the Chief Technology Officer at Schonfeld Strategic Advisors, a global quantitative multi-manager hedge fund, where he led the firm through a complete technology transformation and global platform expansion. He is an experienced technology leader with 25+ years of deep hands-on expertise in software, architecture, strategy, and digital transformation. He holds a B.A. from Long Island University and earned his M.B.A. from The Wharton School of the University of Pennsylvania.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Bob-Photo%2520%25281%2529%2520%255BPreferred%2520Image%255D_1744413112145001yMK6.png?h=57924478&itok=qVL_40D6","alt":"Bob Pisani"}},{"name":"Adrian Bolosan","company":"Databricks","job_title":"Sr. Director Data Collaboration","bio":null,"image":{}},{"name":"Matthew Houser","company":"Tealium","job_title":"SVP Engineering","bio":null,"image":{}},{"name":"Davis Matson","company":"Health Catalyst","job_title":"SVP Platform Engineering","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/tech-industry-session-building-collaborative-ecosystems-openness-and","alias":"\/data-ai-summit-2025\/session\/tech-industry-session-building-collaborative-ecosystems-openness-and","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535394+00:00"}
{"id":"D25B3275DBX","title":"Unify Enterprise Data in Databricks With Zero-Copy Data Sharing From SAP & Salesforce Data Cloud","description":"<p>How can enterprises securely share their SAP and Salesforce data with Databricks — without the cost and complexity of data duplication or movement? This session explores how Delta Sharing enables zero-copy, secure data access from SAP Business data cloud and Salesforce Data Cloud, making it easier to activate enterprise data for analytics and AI.<\/p><p> <\/p><p>We’ll walk through two powerful integrations:<\/p><ul>\t<li>SAP Business Data Cloud: Use live data for operational reporting, supply chain optimization and financial planning<\/li>\t<li>Salesforce Data Cloud: Enable customer analytics, churn prediction, and personalized marketing<\/li><\/ul><p> <\/p><p>You’ll also learn implementation best practices to ensure security, governance and efficient workflows — so you can accelerate decision-making while staying compliant. Ideal for data leaders, architects and engineers looking to drive value from enterprise systems in Databricks.<\/p>","track":"Data Sharing and Collaboration","level":"Beginner","type":"Breakout","industry":["Health and Life Sciences, Retail and CPG - Food, Financial Services"],"category":["Delta Sharing, Unity Catalog"],"areas_of_interest":["Collaboration, Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Akram Chetibi","company":"Databricks","job_title":"Director, Product Management","bio":"Director, Product Management","image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/unify-enterprise-data-databricks-zero-copy-data-sharing-sap-salesforce","alias":"\/data-ai-summit-2025\/session\/unify-enterprise-data-databricks-zero-copy-data-sharing-sap-salesforce","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535646+00:00"}
{"id":"D25B2328","title":"Unlocking Industrial Intelligence with AVEVA and Agnico Eagle","description":"<p>Industrial data is the foundation for operational excellence, but sharing and leveraging this data across systems presents significant challenges. Fragmented approaches create delays in decision-making, increase maintenance costs, and erode trust in data quality. This session explores how the partnership between AVEVA and Databricks addresses these issues through CONNECT, which integrates directly with Databricks via Delta Sharing. By accelerating time to value, eliminating data wrangling, ensuring high data quality, and reducing maintenance costs, this solution drives faster, more confident decision-making and greater user adoption.<\/p><p> <\/p><p>We will showcase how Agnico Eagle Mines—the world’s third-largest gold producer with 10 mines across Canada, Australia, Mexico, and Finland—is leveraging this capability to overcome data intelligence barriers at scale. With this solution, Agnico Eagle is making insights more accessible and actionable across its entire organization. <\/p>","track":"Data Sharing and Collaboration","level":"Beginner","type":"Breakout","industry":["Manufacturing"],"category":["AI\/BI, Delta Sharing"],"areas_of_interest":["Collaboration, Data Ingestion, Machine Learning"],"delivery":["In Person"],"speakers":[{"name":"Bry Dillon","company":"AVEVA","job_title":"SVP, Partners and Commercial Strategy","bio":"Bry Dillon has been in the enterprise software industry for over 25 years, spanning roles in sales and business development from venture funded startups to Fortune 500 organizations. His experience includes supply chain management,  unstructured data, and 14 years in industrial software at AVEVA.  He led the PI Business in the Western US, covering a variety of customers from both traditional and emerging markets.  Bry also led Global Business Development; focused on helping customers extend their PI Infrastructure to leverage the power of Cloud Technologies.  In his current role as SVP, Partners and Commercial Strategy, Bry is responsible for AVEVA’s overall Partner strategy and the incubation of CONNECT, AVEVA's Industrial Platform.  ","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/Bry-Dillon%2520headshot%2520png_1744656519452001TbzV.png?h=d809010e&itok=n31Sx7-b","alt":"Bry Dillon"}},{"name":"Raymond Yip","company":"Agnico-Eagle","job_title":"VP, Digital Transformation","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/unlocking-industrial-intelligence-aveva-and-agnico-eagle","alias":"\/data-ai-summit-2025\/session\/unlocking-industrial-intelligence-aveva-and-agnico-eagle","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535712+00:00"}
{"id":"D25B1686","title":"Unlocking the Future of Dairy Farming: Leveraging Data Marketplaces at Lely","description":"<p>Lely, a Dutch company specializing in dairy farming robotics, helps farmers with advanced solutions for milking, feeding and cleaning. This session explores Lely’s implementation of an Internal Data Marketplace, built around Databricks' Private Exchange Marketplace.<\/p><p> <\/p><p>The marketplace serves as a central hub for data teams and business users, offering seamless access to data, analytics and dashboards. Powered by Delta Sharing, it enables secure, private listing of data products across business domains, including notebooks, views, models and functions.<\/p><p> <\/p><p>This session covers the pros and cons of this approach, best practices for setting up a data marketplace and its impact on Lely’s operations. Real-world examples and insights will showcase the potential of integrating data-driven solutions into dairy farming.<\/p><p> <\/p><p>Join us to discover how data innovation drives the future of dairy farming through Lely’s experience.<\/p>","track":"Data Sharing and Collaboration","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology, Manufacturing"],"category":["Data Marketplace, Delta Sharing, Unity Catalog"],"areas_of_interest":["Catalogs, Collaboration"],"delivery":["In Person"],"speakers":[{"name":"Bulut Ficici","company":"Lely","job_title":"Data Platform Engineer","bio":"Bulut Ficici is a Data Platform Engineer at Lely Industries N.V., a Dutch company specialized in farming robotics. Over the past three years, Bulut has been dedicated to building, architecting, and tailoring Lely's Databricks platform.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/bficici_1745937953027001CFWc.jpg?h=a9d39ae0&itok=oExFbfvW","alt":"Bulut Ficici"}},{"name":"Simon Krejci","company":"Lely","job_title":"Senior Data Engineer","bio":"Simon Krejci is a Senior Data Engineer at Lely, an international family business specializing in dairy farming robotics. Before joining Lely, Simon graduated in Software Engineering, developed environmental monitoring systems for the public sector, and worked for the European Space Agency. <br \/>\n<br \/>\nAt Lely, Simon drives the entire data pipeline, from telemetry data on the farm to innovative data products for stakeholders. Sphere, an emission-reducing system, is one of his notable projects. The collaboration between the robotics teams and the Data & AI department at Lely is exceptional, with Simon playing a key role in advancing the company's data-driven initiatives.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/profile_picture_1746083024942001GS3V.jpg?h=e77f7b80&itok=4BAhjoYB","alt":"Simon Krejci"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/unlocking-future-dairy-farming-leveraging-data-marketplaces-lely","alias":"\/data-ai-summit-2025\/session\/unlocking-future-dairy-farming-leveraging-data-marketplaces-lely","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535723+00:00"}
{"id":"D25B3112","title":"Unlocking the Power of Retail Media Networks: How Data is Changing the Retail Promotions Landscape","description":"<p>Retail Media Networks (RMNs) are transforming how brands engage and connect with consumers throughout the omnichannel. In this session, Databricks and Hightouch will explore how data-driven advertising is reshaping retail promotions and enabling real-time activation of customer insights.<\/p><p> <\/p><p>Learn how unified data architectures and composable customer stacks are driving hyper-personalized, high-ROI campaigns. Whether you're a retailer monetizing first-party data or a brand optimizing ad spend, this session offers practical strategies and real-world examples to thrive in the evolving RMN landscape.<\/p>","track":"Data Sharing and Collaboration","level":"Beginner","type":"Breakout","industry":["Retail and CPG - Food"],"category":["AI\/BI, DLT"],"areas_of_interest":["Customer Data Platform, Industry Experience"],"delivery":["In Person"],"speakers":[{"name":"Bryan Smith","company":"Databricks","job_title":"Partner Solutions, Consumer Industries","bio":null,"image":{}},{"name":"John Lopus","company":"Hightouch","job_title":"Head of Solutions Engineering","bio":"Solutions Leader with expertise in building Solutions teams in the MarTech and AdTech spaces to sell complex, technical products to Enterprise customers.<br \/>\n<br \/>\nA self-directional leader with a diverse set of experiences across a number of verticals including eCommerce, Gaming, and Finance\/Banking. Led the solutioning on engagements with: JP Morgan Chase, Nike, Walmart, Robinhood, Sony, Xbox, Target, Bestbuy, Activision\/Blizzard\/King (Diablo, Call of Duty, Candy Crush), Supercell (Clash of Clans) among others.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/image_1744403713502001t1L4.png?h=aabaf923&itok=bq1dxDM4","alt":"John Lopus"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/unlocking-power-retail-media-networks-how-data-changing-retail","alias":"\/data-ai-summit-2025\/session\/unlocking-power-retail-media-networks-how-data-changing-retail","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535730+00:00"}
{"id":"D25B2923","title":"Unlocking TV Viewership Insights: Privacy-Compliant Data Sharing with Clean Rooms","description":"<p>Delivering TV viewership data while balancing customer needs and privacy compliance is a complex challenge. After evaluating multiple solutions, FreeWheel, a Comcast company, selected Databricks Clean Rooms for their ability to programmatically enforce k-anonymization constraints and differential privacy, enabling secure and flexible data exploration.<\/p><p> <\/p><p>Unlike other solutions that require rigid templates and manual approvals, Clean Rooms gives FreeWheel's customers the freedom to run custom SQL queries while automatically excluding non-compliant data. With Clean Rooms, FreeWheel has streamlined workflows, simplified data management and unlocked new opportunities to monetize its data. The solution supports diverse and complex workloads with high performance and security, making it ideal for current needs and adaptable to future use cases<\/p><p> <\/p><p>Join this session to learn how FreeWheel is leveraging Clean Rooms to revolutionize TV viewership data sharing — enabling secure collaboration, improving efficiency and driving innovation in data monetization.<\/p>","track":"Data Sharing and Collaboration","level":"Intermediate","type":"Breakout","industry":["Enterprise Technology, Media and Entertainment"],"category":["Databricks Workflows, Delta Sharing, Unity Catalog"],"areas_of_interest":["Collaboration, Customer Data Platform, Security & Compliance, Marketing"],"delivery":["In Person"],"speakers":[{"name":"Richard Sharrott","company":"FreeWheel, A Comcast Company","job_title":"Software Engineering Manager","bio":null,"image":{}},{"name":"Johanna Hughes","company":"Databricks","job_title":"Solution Architect","bio":"Johanna Hughes, M.S., has been at Databricks for two years as a Solution Architect in the Media & Advertising industry vertical. She also functions as a Clean Rooms subject matter expert across the field. ","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/headshot%255B206%255D_1744727067212001BNpH.png?h=7f412c8f&itok=DHmCN4ru","alt":"Johanna Hughes"}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/unlocking-tv-viewership-insights-privacy-compliant-data-sharing-clean","alias":"\/data-ai-summit-2025\/session\/unlocking-tv-viewership-insights-privacy-compliant-data-sharing-clean","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535733+00:00"}
{"id":"D25B3283DBX","title":"Using Clean Rooms for Privacy-Safe Data Collaboration","description":"<p>Databricks Clean Rooms make privacy-safe collaboration possible for data, analytics, and AI — across clouds and platforms. Built on Delta Sharing, Clean Rooms enable organizations to securely share and analyze data together in a governed, isolated environment — without ever exposing raw data.<\/p><p> <\/p><p>In this session, you’ll learn how to get started with Databricks Clean Rooms and unlock advanced use cases including:<\/p><ul>\t<li>Cross-platform collaboration and joint analytics<\/li>\t<li>Training machine learning and AI models<\/li>\t<li>Enforcing custom privacy policies<\/li>\t<li>Analyzing unstructured data<\/li>\t<li>Incorporating proprietary libraries in Python and SQL notebooks<\/li>\t<li>Auditing clean room activity for compliance<\/li><\/ul><p> <\/p><p>Whether you're a data scientist, engineer or data leader, this session will equip you to drive high-value collaboration while maintaining full control over data privacy and governance.<\/p>","track":"Data Sharing and Collaboration","level":"Beginner","type":"Breakout","industry":["Media and Entertainment, Retail and CPG - Food, Financial Services"],"category":["Delta Sharing"],"areas_of_interest":["Collaboration, Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Nikhil Gaekwad","company":null,"job_title":null,"bio":null,"image":{}},{"name":"DJ Sharkey","company":"Databricks","job_title":"Staff Software Engineer","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/using-clean-rooms-privacy-safe-data-collaboration","alias":"\/data-ai-summit-2025\/session\/using-clean-rooms-privacy-safe-data-collaboration","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535748+00:00"}
{"id":"D25B3265DBX","title":"What's New with Data Sharing and Collaboration with Live Demos","description":"<p>Databricks continues to redefine how organizations securely and openly collaborate on data. With new innovations like Clean Rooms for multi-party collaboration, Sharing for Lakehouse Federation, cross-platform view sharing and Databricks Apps in the Marketplace, teams can now share and access data more easily, cost-effectively and across platforms — whether or not they’re using Databricks.<\/p><p> <\/p><p>In this session, we’ll deliver live demos of key capabilities that power this transformation:<\/p><ul>\t<li>Delta Sharing: The industry’s only open protocol for seamless cross-platform data sharing<\/li>\t<li>Databricks Marketplace: A central hub for discovering and monetizing data and AI assets<\/li>\t<li>Clean Rooms: A privacy-preserving solution for secure, multi-party data collaboration<\/li><\/ul><p> <\/p><p>Join us to see how these tools enable trusted data sharing, accelerate insights and drive innovation across your ecosystem. Bring your questions and walk away with practical ways to put these capabilities into action today.<\/p>","track":"Data Sharing and Collaboration","level":"Beginner","type":"Breakout","industry":["Health and Life Sciences, Retail and CPG - Food, Financial Services"],"category":["Data Marketplace, Delta Sharing, Unity Catalog"],"areas_of_interest":["Collaboration, Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Tao Tao","company":"Databricks","job_title":"Director, Engineering","bio":"Tao Tao is a Director of Engineering at Databricks leading the Collaboration and Ecosystem team. Prior to Databricks Tao led various platform efforts at Tableau and worked on the big data analysis platform Cosmos at Microsoft. Tao holds a Master’s in Computer Science from University of Pennsylvania.","image":{}},{"name":"Harish Gaur","company":null,"job_title":"Director of Product Marketing","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/whats-new-data-sharing-and-collaboration-live-demos","alias":"\/data-ai-summit-2025\/session\/whats-new-data-sharing-and-collaboration-live-demos","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535798+00:00"}
{"id":"D25B3248DBX","title":"What's New With Databricks Marketplace","description":"<p>Databricks Marketplace is the fastest-growing open marketplace for discovering, sharing, and monetizing data, AI models, notebooks, and applications — empowering organizations to accelerate analytics and AI innovation without vendor lock-in. In this session, we’ll showcase the latest enhancements that make Databricks Marketplace more powerful and accessible than ever. Join us for a live walkthrough of new features and capabilities, including: private exchange, partner connect, provider usage analytics, AI Assistant integration etc. Whether you are a data provider or a data consumer, learn how the latest Databricks Marketplace innovations can help you unlock new value from your data and AI investments.<\/p>","track":"Data Sharing and Collaboration","level":"Beginner","type":"Breakout","industry":["Enterprise Technology"],"category":["Data Marketplace"],"areas_of_interest":["Databricks Experience (DBX)"],"delivery":["In Person"],"speakers":[{"name":"Tia Chang","company":"Databricks","job_title":"Product Manager","bio":"Tia is a Product Manager on the Lakehouse Collaboration and Partner Ecosystem team, more specifically working on Delta Sharing and Marketplace.","image":{"url":"https:\/\/microsites.databricks.com\/sites\/default\/files\/styles\/headshot\/public\/media\/images\/dataaisummit_speaker\/tia%2520headshot%25202_1746142003808001Q59X.jpg?h=e54d7d27&itok=BeP2GObr","alt":"Tia Chang"}},{"name":"Justin DeBrabant","company":null,"job_title":"Director of Product, Apps","bio":null,"image":{}}],"day":"","room":"","starts":null,"ends":null,"starts_pst":"","ends_pst":"","start_time":"","end_time":"","pst_start_time":"","pst_end_time":"","duration":"40","path":"\/session\/whats-new-databricks-marketplace","alias":"\/data-ai-summit-2025\/session\/whats-new-databricks-marketplace","slides":null,"video":null,"scraped_at":"2025-05-02T15:15:21.535805+00:00"}
